[Killed] BlockStatement
src/categories/unread.js:6:56
 const db = require('../database');
 
 module.exports = function (Categories) {
-    Categories.markAsRead = async function (cids, uid) {
-        if (!Array.isArray(cids) || !cids.length || parseInt(uid, 10) <= 0) {
-            return;
-        }
-        let keys = cids.map(cid => `cid:${cid}:read_by_uid`);
-        const hasRead = await db.isMemberOfSets(keys, uid);
-        keys = keys.filter((key, index) => !hasRead[index]);
-        await db.setsAdd(keys, uid);
-    };
+    Categories.markAsRead = async function (cids, uid) {};
 
     Categories.markAsUnreadForAll = async function (cid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/unread.js:7:53
 
 module.exports = function (Categories) {
     Categories.markAsRead = async function (cids, uid) {
-        if (!Array.isArray(cids) || !cids.length || parseInt(uid, 10) <= 0) {
+        if (!Array.isArray(cids) || !cids.length || parseInt(uid, 10) < 0) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/unread.js:7:13
 
 module.exports = function (Categories) {
     Categories.markAsRead = async function (cids, uid) {
-        if (!Array.isArray(cids) || !cids.length || parseInt(uid, 10) <= 0) {
+        if (true) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/unread.js:10:29
         if (!Array.isArray(cids) || !cids.length || parseInt(uid, 10) <= 0) {
             return;
         }
-        let keys = cids.map(cid => `cid:${cid}:read_by_uid`);
+        let keys = cids.map(() => undefined);
         const hasRead = await db.isMemberOfSets(keys, uid);
         keys = keys.filter((key, index) => !hasRead[index]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/unread.js:12:44
         }
         let keys = cids.map(cid => `cid:${cid}:read_by_uid`);
         const hasRead = await db.isMemberOfSets(keys, uid);
-        keys = keys.filter((key, index) => !hasRead[index]);
+        keys = keys.filter((key, index) => hasRead[index]);
         await db.setsAdd(keys, uid);
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/unread.js:12:28
         }
         let keys = cids.map(cid => `cid:${cid}:read_by_uid`);
         const hasRead = await db.isMemberOfSets(keys, uid);
-        keys = keys.filter((key, index) => !hasRead[index]);
+        keys = keys.filter(() => undefined);
         await db.setsAdd(keys, uid);
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/unread.js:16:58
         await db.setsAdd(keys, uid);
     };
 
-    Categories.markAsUnreadForAll = async function (cid) {
-        if (!parseInt(cid, 10)) {
-            return;
-        }
-        await db.delete(`cid:${cid}:read_by_uid`);
-    };
+    Categories.markAsUnreadForAll = async function (cid) {};
 
     Categories.hasReadCategories = async function (cids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/unread.js:17:13
     };
 
     Categories.markAsUnreadForAll = async function (cid) {
-        if (!parseInt(cid, 10)) {
+        if (true) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/unread.js:17:13
     };
 
     Categories.markAsUnreadForAll = async function (cid) {
-        if (!parseInt(cid, 10)) {
+        if (false) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/unread.js:23:63
         await db.delete(`cid:${cid}:read_by_uid`);
     };
 
-    Categories.hasReadCategories = async function (cids, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            return cids.map(() => false);
-        }
-
-        const sets = cids.map(cid => `cid:${cid}:read_by_uid`);
-        return await db.isMemberOfSets(sets, uid);
-    };
+    Categories.hasReadCategories = async function (cids, uid) {};
 
     Categories.hasReadCategory = async function (cid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/unread.js:24:13
     };
 
     Categories.hasReadCategories = async function (cids, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (parseInt(uid, 10) < 0) {
             return cids.map(() => false);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/unread.js:24:13
     };
 
     Categories.hasReadCategories = async function (cids, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (false) {
             return cids.map(() => false);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/unread.js:25:35
 
     Categories.hasReadCategories = async function (cids, uid) {
         if (parseInt(uid, 10) <= 0) {
-            return cids.map(() => false);
+            return cids.map(() => true);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/unread.js:25:29
 
     Categories.hasReadCategories = async function (cids, uid) {
         if (parseInt(uid, 10) <= 0) {
-            return cids.map(() => false);
+            return cids.map(() => undefined);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/unread.js:28:31
             return cids.map(() => false);
         }
 
-        const sets = cids.map(cid => `cid:${cid}:read_by_uid`);
+        const sets = cids.map(() => undefined);
         return await db.isMemberOfSets(sets, uid);
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BlockStatement
src/categories/unread.js:32:60
         return await db.isMemberOfSets(sets, uid);
     };
 
-    Categories.hasReadCategory = async function (cid, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            return false;
-        }
-        return await db.isSetMember(`cid:${cid}:read_by_uid`, uid);
-    };
+    Categories.hasReadCategory = async function (cid, uid) {};
 };
 

[NoCoverage] EqualityOperator
src/categories/unread.js:33:13
     };
 
     Categories.hasReadCategory = async function (cid, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (parseInt(uid, 10) < 0) {
             return false;
         }

[NoCoverage] BlockStatement
src/categories/unread.js:33:37
     };
 
     Categories.hasReadCategory = async function (cid, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            return false;
-        }
+        if (parseInt(uid, 10) <= 0) {}
         return await db.isSetMember(`cid:${cid}:read_by_uid`, uid);
     };

[NoCoverage] BooleanLiteral
src/categories/unread.js:34:20
 
     Categories.hasReadCategory = async function (cid, uid) {
         if (parseInt(uid, 10) <= 0) {
-            return false;
+            return true;
         }
         return await db.isSetMember(`cid:${cid}:read_by_uid`, uid);
