[Killed] ConditionalExpression
src/categories/create.js:21:28
             db.getSortedSetRangeWithScores(`cid:${parentCid}:children`, 0, 0),
         ]);
 
-        data.name = String(data.name || `Category ${cid}`);
+        data.name = String(false);
         const slug = `${cid}/${slugify(data.name)}`;
         const smallestOrder = firstChild.length ? firstChild[0].score - 1 : 1;
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArithmeticOperator
src/categories/create.js:23:51
 
         data.name = String(data.name || `Category ${cid}`);
         const slug = `${cid}/${slugify(data.name)}`;
-        const smallestOrder = firstChild.length ? firstChild[0].score - 1 : 1;
+        const smallestOrder = firstChild.length ? firstChild[0].score + 1 : 1;
         const order = data.order || smallestOrder; // If no order provided, place it at the top
         const colours = Categories.assignColours();
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/create.js:24:23
         data.name = String(data.name || `Category ${cid}`);
         const slug = `${cid}/${slugify(data.name)}`;
         const smallestOrder = firstChild.length ? firstChild[0].score - 1 : 1;
-        const order = data.order || smallestOrder; // If no order provided, place it at the top
+        const order = false; // If no order provided, place it at the top
         const colours = Categories.assignColours();
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/create.js:32:43
             name: data.name,
             description: data.description ? data.description : '',
             descriptionParsed: data.descriptionParsed ? data.descriptionParsed : '',
-            icon: data.icon ? data.icon : '',
+            icon: data.icon ? data.icon : "Stryker was here!",
             bgColor: data.bgColor || colours[0],
             color: data.color || colours[1],
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/create.js:33:22
             description: data.description ? data.description : '',
             descriptionParsed: data.descriptionParsed ? data.descriptionParsed : '',
             icon: data.icon ? data.icon : '',
-            bgColor: data.bgColor || colours[0],
+            bgColor: true,
             color: data.color || colours[1],
             slug: slug,
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/create.js:34:20
             descriptionParsed: data.descriptionParsed ? data.descriptionParsed : '',
             icon: data.icon ? data.icon : '',
             bgColor: data.bgColor || colours[0],
-            color: data.color || colours[1],
+            color: false,
             slug: slug,
             parentCid: parentCid,
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/categories/create.js:49:35
             subCategoriesPerPage: 10,
         };
 
-        if (data.backgroundImage) {
-            category.backgroundImage = data.backgroundImage;
-        }
+        if (data.backgroundImage) {}
 
         const defaultPrivileges = [
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/create.js:55:13
 
         const defaultPrivileges = [
             'groups:find',
-            'groups:read',
+            "",
             'groups:topics:read',
             'groups:topics:create',
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/create.js:56:13
         const defaultPrivileges = [
             'groups:find',
             'groups:read',
-            'groups:topics:read',
+            "",
             'groups:topics:create',
             'groups:topics:reply',
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/create.js:59:13
             'groups:topics:read',
             'groups:topics:create',
             'groups:topics:reply',
-            'groups:topics:tag',
+            "",
             'groups:posts:edit',
             'groups:posts:history',
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/create.js:61:13
             'groups:topics:reply',
             'groups:topics:tag',
             'groups:posts:edit',
-            'groups:posts:history',
+            "",
             'groups:posts:delete',
             'groups:posts:upvote',
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/create.js:64:13
             'groups:posts:history',
             'groups:posts:delete',
             'groups:posts:upvote',
-            'groups:posts:downvote',
+            "",
             'groups:topics:delete',
         ];
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/create.js:65:13
             'groups:posts:delete',
             'groups:posts:upvote',
             'groups:posts:downvote',
-            'groups:topics:delete',
+            "",
         ];
         const modPrivileges = defaultPrivileges.concat([
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/create.js:68:13
             'groups:topics:delete',
         ];
         const modPrivileges = defaultPrivileges.concat([
-            'groups:topics:schedule',
+            "",
             'groups:posts:view_deleted',
             'groups:purge',
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/create.js:72:49
             'groups:posts:view_deleted',
             'groups:purge',
         ]);
-        const guestPrivileges = ['groups:find', 'groups:read', 'groups:topics:read'];
+        const guestPrivileges = ['groups:find', "", 'groups:topics:read'];
 
         const result = await plugins.hooks.fire('filter:category.create', {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/create.js:84:13
         category = result.category;
 
         await db.setObject(`category:${category.cid}`, category);
-        if (!category.descriptionParsed) {
+        if (false) {
             await Categories.parseDescription(category.cid, category.description);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/create.js:95:78
         ]);
 
         await privileges.categories.give(result.defaultPrivileges, category.cid, 'registered-users');
-        await privileges.categories.give(result.modPrivileges, category.cid, ['administrators', 'Global Moderators']);
+        await privileges.categories.give(result.modPrivileges, category.cid, []);
         await privileges.categories.give(result.guestPrivileges, category.cid, ['guests', 'spiders']);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/create.js:96:80
 
         await privileges.categories.give(result.defaultPrivileges, category.cid, 'registered-users');
         await privileges.categories.give(result.modPrivileges, category.cid, ['administrators', 'Global Moderators']);
-        await privileges.categories.give(result.guestPrivileges, category.cid, ['guests', 'spiders']);
+        await privileges.categories.give(result.guestPrivileges, category.cid, []);
 
         cache.del([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/create.js:98:19
         await privileges.categories.give(result.modPrivileges, category.cid, ['administrators', 'Global Moderators']);
         await privileges.categories.give(result.guestPrivileges, category.cid, ['guests', 'spiders']);
 
-        cache.del([
-            'categories:cid',
-            `cid:${parentCid}:children`,
-            `cid:${parentCid}:children:all`,
-        ]);
+        cache.del([]);
         if (data.cloneFromCid && parseInt(data.cloneFromCid, 10)) {
             category = await Categories.copySettingsFrom(data.cloneFromCid, category.cid, !data.parentCid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/create.js:103:67
             `cid:${parentCid}:children`,
             `cid:${parentCid}:children:all`,
         ]);
-        if (data.cloneFromCid && parseInt(data.cloneFromCid, 10)) {
-            category = await Categories.copySettingsFrom(data.cloneFromCid, category.cid, !data.parentCid);
-        }
+        if (data.cloneFromCid && parseInt(data.cloneFromCid, 10)) {}
 
         if (data.cloneChildren) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/create.js:103:13
             `cid:${parentCid}:children`,
             `cid:${parentCid}:children:all`,
         ]);
-        if (data.cloneFromCid && parseInt(data.cloneFromCid, 10)) {
+        if (data.cloneFromCid || parseInt(data.cloneFromCid, 10)) {
             category = await Categories.copySettingsFrom(data.cloneFromCid, category.cid, !data.parentCid);
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[NoCoverage] ConditionalExpression
src/categories/create.js:117:13
 
     async function duplicateCategoriesChildren(parentCid, cid, uid) {
         let children = await Categories.getChildren([cid], uid);
-        if (!children.length) {
+        if (false) {
             return;
         }

[NoCoverage] BlockStatement
src/categories/create.js:117:31
 
     async function duplicateCategoriesChildren(parentCid, cid, uid) {
         let children = await Categories.getChildren([cid], uid);
-        if (!children.length) {
-            return;
-        }
+        if (!children.length) {}
 
         children = children[0];

[Killed] BlockStatement
src/categories/create.js:135:44
         await async.each(children, Categories.create);
     }
 
-    Categories.assignColours = function () {
-        const backgrounds = ['#AB4642', '#DC9656', '#F7CA88', '#A1B56C', '#86C1B9', '#7CAFC2', '#BA8BAF', '#A16946'];
-        const text = ['#ffffff', '#ffffff', '#333333', '#ffffff', '#333333', '#ffffff', '#ffffff', '#ffffff'];
-        const index = Math.floor(Math.random() * backgrounds.length);
-        return [backgrounds[index], text[index]];
-    };
+    Categories.assignColours = function () {};
 
     Categories.copySettingsFrom = async function (fromCid, toCid, copyParent) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/create.js:136:74
     }
 
     Categories.assignColours = function () {
-        const backgrounds = ['#AB4642', '#DC9656', '#F7CA88', '#A1B56C', '#86C1B9', '#7CAFC2', '#BA8BAF', '#A16946'];
+        const backgrounds = ['#AB4642', '#DC9656', '#F7CA88', '#A1B56C', "", '#7CAFC2', '#BA8BAF', '#A16946'];
         const text = ['#ffffff', '#ffffff', '#333333', '#ffffff', '#333333', '#ffffff', '#ffffff', '#ffffff'];
         const index = Math.floor(Math.random() * backgrounds.length);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/create.js:136:29
     }
 
     Categories.assignColours = function () {
-        const backgrounds = ['#AB4642', '#DC9656', '#F7CA88', '#A1B56C', '#86C1B9', '#7CAFC2', '#BA8BAF', '#A16946'];
+        const backgrounds = [];
         const text = ['#ffffff', '#ffffff', '#333333', '#ffffff', '#333333', '#ffffff', '#ffffff', '#ffffff'];
         const index = Math.floor(Math.random() * backgrounds.length);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/create.js:137:45
 
     Categories.assignColours = function () {
         const backgrounds = ['#AB4642', '#DC9656', '#F7CA88', '#A1B56C', '#86C1B9', '#7CAFC2', '#BA8BAF', '#A16946'];
-        const text = ['#ffffff', '#ffffff', '#333333', '#ffffff', '#333333', '#ffffff', '#ffffff', '#ffffff'];
+        const text = ['#ffffff', '#ffffff', "", '#ffffff', '#333333', '#ffffff', '#ffffff', '#ffffff'];
         const index = Math.floor(Math.random() * backgrounds.length);
         return [backgrounds[index], text[index]];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/categories/create.js:138:34
     Categories.assignColours = function () {
         const backgrounds = ['#AB4642', '#DC9656', '#F7CA88', '#A1B56C', '#86C1B9', '#7CAFC2', '#BA8BAF', '#A16946'];
         const text = ['#ffffff', '#ffffff', '#333333', '#ffffff', '#333333', '#ffffff', '#ffffff', '#ffffff'];
-        const index = Math.floor(Math.random() * backgrounds.length);
+        const index = Math.floor(Math.random() / backgrounds.length);
         return [backgrounds[index], text[index]];
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/create.js:143:57
     };
 
     Categories.copySettingsFrom = async function (fromCid, toCid, copyParent) {
-        const [source, destination] = await Promise.all([
-            db.getObject(`category:${fromCid}`),
-            db.getObject(`category:${toCid}`),
-        ]);
+        const [source, destination] = await Promise.all([]);
         if (!source) {
             throw new Error('[[error:invalid-cid]]');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/create.js:147:13
             db.getObject(`category:${fromCid}`),
             db.getObject(`category:${toCid}`),
         ]);
-        if (!source) {
+        if (true) {
             throw new Error('[[error:invalid-cid]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/create.js:151:27
             throw new Error('[[error:invalid-cid]]');
         }
 
-        const oldParent = parseInt(destination.parentCid, 10) || 0;
+        const oldParent = false;
         const newParent = parseInt(source.parentCid, 10) || 0;
         if (copyParent && newParent !== parseInt(toCid, 10)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/create.js:153:27
 
         const oldParent = parseInt(destination.parentCid, 10) || 0;
         const newParent = parseInt(source.parentCid, 10) || 0;
-        if (copyParent && newParent !== parseInt(toCid, 10)) {
+        if (copyParent && newParent === parseInt(toCid, 10)) {
             await db.sortedSetRemove(`cid:${oldParent}:children`, toCid);
             await db.sortedSetAdd(`cid:${newParent}:children`, source.order, toCid);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/create.js:153:27
 
         const oldParent = parseInt(destination.parentCid, 10) || 0;
         const newParent = parseInt(source.parentCid, 10) || 0;
-        if (copyParent && newParent !== parseInt(toCid, 10)) {
+        if (copyParent && true) {
             await db.sortedSetRemove(`cid:${oldParent}:children`, toCid);
             await db.sortedSetAdd(`cid:${newParent}:children`, source.order, toCid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/create.js:156:23
         if (copyParent && newParent !== parseInt(toCid, 10)) {
             await db.sortedSetRemove(`cid:${oldParent}:children`, toCid);
             await db.sortedSetAdd(`cid:${newParent}:children`, source.order, toCid);
-            cache.del([
-                `cid:${oldParent}:children`,
-                `cid:${oldParent}:children:all`,
-                `cid:${newParent}:children`,
-                `cid:${newParent}:children:all`,
-            ]);
+            cache.del([]);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/create.js:177:25
         destination.minTags = source.minTags;
         destination.maxTags = source.maxTags;
 
-        if (copyParent) {
-            destination.parentCid = source.parentCid || 0;
-        }
+        if (copyParent) {}
         await plugins.hooks.fire('filter:categories.copySettingsFrom', {
             source: source,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/create.js:178:37
         destination.maxTags = source.maxTags;
 
         if (copyParent) {
-            destination.parentCid = source.parentCid || 0;
+            destination.parentCid = true;
         }
         await plugins.hooks.fire('filter:categories.copySettingsFrom', {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/create.js:196:59
     };
 
     async function copyTagWhitelist(fromCid, toCid) {
-        const data = await db.getSortedSetRangeWithScores(`cid:${fromCid}:tag:whitelist`, 0, -1);
+        const data = await db.getSortedSetRangeWithScores(``, 0, -1);
         await db.delete(`cid:${toCid}:tag:whitelist`);
         await db.sortedSetAdd(`cid:${toCid}:tag:whitelist`, data.map(item => item.score), data.map(item => item.value));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/create.js:199:19
         const data = await db.getSortedSetRangeWithScores(`cid:${fromCid}:tag:whitelist`, 0, -1);
         await db.delete(`cid:${toCid}:tag:whitelist`);
         await db.sortedSetAdd(`cid:${toCid}:tag:whitelist`, data.map(item => item.score), data.map(item => item.value));
-        cache.del(`cid:${toCid}:tag:whitelist`);
+        cache.del(``);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/create.js:202:89
         cache.del(`cid:${toCid}:tag:whitelist`);
     }
 
-    Categories.copyPrivilegesFrom = async function (fromCid, toCid, group, filter = []) {
-        group = group || '';
-        let privsToCopy;
-        if (group) {
-            const groupPrivilegeList = await privileges.categories.getGroupPrivilegeList();
-            privsToCopy = groupPrivilegeList.slice(...filter);
-        } else {
-            const privs = await privileges.categories.getPrivilegeList();
-            const halfIdx = privs.length / 2;
-            privsToCopy = privs.slice(0, halfIdx).slice(...filter).concat(privs.slice(halfIdx).slice(...filter));
-        }
-
-        const data = await plugins.hooks.fire('filter:categories.copyPrivilegesFrom', {
-            privileges: privsToCopy,
-            fromCid: fromCid,
-            toCid: toCid,
-            group: group,
-        });
-        if (group) {
-            await copyPrivilegesByGroup(data.privileges, data.fromCid, data.toCid, group);
-        } else {
-            await copyPrivileges(data.privileges, data.fromCid, data.toCid);
-        }
-    };
+    Categories.copyPrivilegesFrom = async function (fromCid, toCid, group, filter = []) {};
 
     async function copyPrivileges(privileges, fromCid, toCid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/create.js:203:17
     }
 
     Categories.copyPrivilegesFrom = async function (fromCid, toCid, group, filter = []) {
-        group = group || '';
+        group = group && '';
         let privsToCopy;
         if (group) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/create.js:203:17
     }
 
     Categories.copyPrivilegesFrom = async function (fromCid, toCid, group, filter = []) {
-        group = group || '';
+        group = false;
         let privsToCopy;
         if (group) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/create.js:205:13
     Categories.copyPrivilegesFrom = async function (fromCid, toCid, group, filter = []) {
         group = group || '';
         let privsToCopy;
-        if (group) {
+        if (true) {
             const groupPrivilegeList = await privileges.categories.getGroupPrivilegeList();
             privsToCopy = groupPrivilegeList.slice(...filter);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/create.js:205:13
     Categories.copyPrivilegesFrom = async function (fromCid, toCid, group, filter = []) {
         group = group || '';
         let privsToCopy;
-        if (group) {
+        if (false) {
             const groupPrivilegeList = await privileges.categories.getGroupPrivilegeList();
             privsToCopy = groupPrivilegeList.slice(...filter);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/create.js:207:27
         let privsToCopy;
         if (group) {
             const groupPrivilegeList = await privileges.categories.getGroupPrivilegeList();
-            privsToCopy = groupPrivilegeList.slice(...filter);
+            privsToCopy = groupPrivilegeList;
         } else {
             const privs = await privileges.categories.getPrivilegeList();
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/create.js:208:16
         if (group) {
             const groupPrivilegeList = await privileges.categories.getGroupPrivilegeList();
             privsToCopy = groupPrivilegeList.slice(...filter);
-        } else {
-            const privs = await privileges.categories.getPrivilegeList();
-            const halfIdx = privs.length / 2;
-            privsToCopy = privs.slice(0, halfIdx).slice(...filter).concat(privs.slice(halfIdx).slice(...filter));
-        }
+        } else {}
 
         const data = await plugins.hooks.fire('filter:categories.copyPrivilegesFrom', {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/categories/create.js:210:29
             privsToCopy = groupPrivilegeList.slice(...filter);
         } else {
             const privs = await privileges.categories.getPrivilegeList();
-            const halfIdx = privs.length / 2;
+            const halfIdx = privs.length * 2;
             privsToCopy = privs.slice(0, halfIdx).slice(...filter).concat(privs.slice(halfIdx).slice(...filter));
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/create.js:211:75
         } else {
             const privs = await privileges.categories.getPrivilegeList();
             const halfIdx = privs.length / 2;
-            privsToCopy = privs.slice(0, halfIdx).slice(...filter).concat(privs.slice(halfIdx).slice(...filter));
+            privsToCopy = privs.slice(0, halfIdx).slice(...filter).concat(privs.slice(...filter));
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/create.js:211:27
         } else {
             const privs = await privileges.categories.getPrivilegeList();
             const halfIdx = privs.length / 2;
-            privsToCopy = privs.slice(0, halfIdx).slice(...filter).concat(privs.slice(halfIdx).slice(...filter));
+            privsToCopy = privs.slice(...filter).concat(privs.slice(halfIdx).slice(...filter));
         }
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/create.js:220:13
             toCid: toCid,
             group: group,
         });
-        if (group) {
+        if (false) {
             await copyPrivilegesByGroup(data.privileges, data.fromCid, data.toCid, group);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/create.js:245:48
             db.isMemberOfSortedSets(fromGroups, group),
             db.isMemberOfSortedSets(toGroups, group),
         ]);
-        const givePrivs = privilegeList.filter((priv, index) => fromChecks[index] && !toChecks[index]);
+        const givePrivs = privilegeList.filter(() => undefined);
         const rescindPrivs = privilegeList.filter((priv, index) => !fromChecks[index] && toChecks[index]);
         await privileges.categories.give(givePrivs, toCid, group);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/create.js:246:68
             db.isMemberOfSortedSets(toGroups, group),
         ]);
         const givePrivs = privilegeList.filter((priv, index) => fromChecks[index] && !toChecks[index]);
-        const rescindPrivs = privilegeList.filter((priv, index) => !fromChecks[index] && toChecks[index]);
+        const rescindPrivs = privilegeList.filter((priv, index) => false);
         await privileges.categories.give(givePrivs, toCid, group);
         await privileges.categories.rescind(rescindPrivs, toCid, group);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
