[Killed] BlockStatement
src/categories/update.js:12:51
 const cache = require('../cache');
 
 module.exports = function (Categories) {
-    Categories.update = async function (modified) {
-        const cids = Object.keys(modified);
-        await Promise.all(cids.map(cid => updateCategory(cid, modified[cid])));
-        return cids;
-    };
+    Categories.update = async function (modified) {};
 
     async function updateCategory(cid, modifiedFields) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/update.js:14:36
 module.exports = function (Categories) {
     Categories.update = async function (modified) {
         const cids = Object.keys(modified);
-        await Promise.all(cids.map(cid => updateCategory(cid, modified[cid])));
+        await Promise.all(cids.map(() => undefined));
         return cids;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/update.js:20:13
 
     async function updateCategory(cid, modifiedFields) {
         const exists = await Categories.exists(cid);
-        if (!exists) {
+        if (exists) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/update.js:20:13
 
     async function updateCategory(cid, modifiedFields) {
         const exists = await Categories.exists(cid);
-        if (!exists) {
+        if (false) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/update.js:24:52
             return;
         }
 
-        if (modifiedFields.hasOwnProperty('name')) {
-            const translated = await translator.translate(modifiedFields.name);
-            modifiedFields.slug = `${cid}/${slugify(translated)}`;
-        }
+        if (modifiedFields.hasOwnProperty('name')) {}
         const result = await plugins.hooks.fire('filter:category.update', { cid: cid, category: modifiedFields });
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/update.js:24:13
             return;
         }
 
-        if (modifiedFields.hasOwnProperty('name')) {
+        if (true) {
             const translated = await translator.translate(modifiedFields.name);
             modifiedFields.slug = `${cid}/${slugify(translated)}`;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/update.js:28:49
             const translated = await translator.translate(modifiedFields.name);
             modifiedFields.slug = `${cid}/${slugify(translated)}`;
         }
-        const result = await plugins.hooks.fire('filter:category.update', { cid: cid, category: modifiedFields });
+        const result = await plugins.hooks.fire("", { cid: cid, category: modifiedFields });
 
         const { category } = result;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/update.js:34:38
         const fields = Object.keys(category);
         // move parent to front, so its updated first
         const parentCidIndex = fields.indexOf('parentCid');
-        if (parentCidIndex !== -1 && fields.length > 1) {
+        if (parentCidIndex !== -1 && fields.length <= 1) {
             fields.splice(0, 0, fields.splice(parentCidIndex, 1)[0]);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/update.js:34:38
         const fields = Object.keys(category);
         // move parent to front, so its updated first
         const parentCidIndex = fields.indexOf('parentCid');
-        if (parentCidIndex !== -1 && fields.length > 1) {
+        if (parentCidIndex !== -1 && true) {
             fields.splice(0, 0, fields.splice(parentCidIndex, 1)[0]);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/update.js:38:35
             fields.splice(0, 0, fields.splice(parentCidIndex, 1)[0]);
         }
 
-        for (const key of fields) {
-            // eslint-disable-next-line no-await-in-loop
-            await updateCategoryField(cid, key, category[key]);
-        }
+        for (const key of fields) {}
         plugins.hooks.fire('action:category.update', { cid: cid, modified: category });
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/categories/update.js:42:54
             // eslint-disable-next-line no-await-in-loop
             await updateCategoryField(cid, key, category[key]);
         }
-        plugins.hooks.fire('action:category.update', { cid: cid, modified: category });
+        plugins.hooks.fire('action:category.update', {});
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/update.js:45:57
         plugins.hooks.fire('action:category.update', { cid: cid, modified: category });
     }
 
-    async function updateCategoryField(cid, key, value) {
-        if (key === 'parentCid') {
-            return await updateParent(cid, value);
-        } else if (key === 'tagWhitelist') {
-            return await updateTagWhitelist(cid, value);
-        } else if (key === 'name') {
-            return await updateName(cid, value);
-        } else if (key === 'order') {
-            return await updateOrder(cid, value);
-        }
-
-        await db.setObjectField(`category:${cid}`, key, value);
-        if (key === 'description') {
-            await Categories.parseDescription(cid, value);
-        }
-    }
+    async function updateCategoryField(cid, key, value) {}
 
     async function updateParent(cid, newParent) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/update.js:46:13
     }
 
     async function updateCategoryField(cid, key, value) {
-        if (key === 'parentCid') {
+        if (false) {
             return await updateParent(cid, value);
         } else if (key === 'tagWhitelist') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/update.js:46:13
     }
 
     async function updateCategoryField(cid, key, value) {
-        if (key === 'parentCid') {
+        if (true) {
             return await updateParent(cid, value);
         } else if (key === 'tagWhitelist') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/update.js:48:20
     async function updateCategoryField(cid, key, value) {
         if (key === 'parentCid') {
             return await updateParent(cid, value);
-        } else if (key === 'tagWhitelist') {
+        } else if (false) {
             return await updateTagWhitelist(cid, value);
         } else if (key === 'name') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/update.js:48:20
     async function updateCategoryField(cid, key, value) {
         if (key === 'parentCid') {
             return await updateParent(cid, value);
-        } else if (key === 'tagWhitelist') {
+        } else if (true) {
             return await updateTagWhitelist(cid, value);
         } else if (key === 'name') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/update.js:50:36
             return await updateParent(cid, value);
         } else if (key === 'tagWhitelist') {
             return await updateTagWhitelist(cid, value);
-        } else if (key === 'name') {
-            return await updateName(cid, value);
-        } else if (key === 'order') {
+        } else if (key === 'name') {} else if (key === 'order') {
             return await updateOrder(cid, value);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/update.js:50:20
             return await updateParent(cid, value);
         } else if (key === 'tagWhitelist') {
             return await updateTagWhitelist(cid, value);
-        } else if (key === 'name') {
+        } else if (key !== 'name') {
             return await updateName(cid, value);
         } else if (key === 'order') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/update.js:52:20
             return await updateTagWhitelist(cid, value);
         } else if (key === 'name') {
             return await updateName(cid, value);
-        } else if (key === 'order') {
+        } else if (true) {
             return await updateOrder(cid, value);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/update.js:52:20
             return await updateTagWhitelist(cid, value);
         } else if (key === 'name') {
             return await updateName(cid, value);
-        } else if (key === 'order') {
+        } else if (key !== 'order') {
             return await updateOrder(cid, value);
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/update.js:56:33
             return await updateOrder(cid, value);
         }
 
-        await db.setObjectField(`category:${cid}`, key, value);
+        await db.setObjectField(``, key, value);
         if (key === 'description') {
             await Categories.parseDescription(cid, value);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/update.js:57:36
         }
 
         await db.setObjectField(`category:${cid}`, key, value);
-        if (key === 'description') {
-            await Categories.parseDescription(cid, value);
-        }
+        if (key === 'description') {}
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/update.js:57:13
         }
 
         await db.setObjectField(`category:${cid}`, key, value);
-        if (key === 'description') {
+        if (true) {
             await Categories.parseDescription(cid, value);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/update.js:63:21
     }
 
     async function updateParent(cid, newParent) {
-        newParent = parseInt(newParent, 10) || 0;
+        newParent = false;
         if (parseInt(cid, 10) === newParent) {
             throw new Error('[[error:cant-set-self-as-parent]]');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/update.js:63:21
     }
 
     async function updateParent(cid, newParent) {
-        newParent = parseInt(newParent, 10) || 0;
+        newParent = true;
         if (parseInt(cid, 10) === newParent) {
             throw new Error('[[error:cant-set-self-as-parent]]');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/update.js:64:46
 
     async function updateParent(cid, newParent) {
         newParent = parseInt(newParent, 10) || 0;
-        if (parseInt(cid, 10) === newParent) {
-            throw new Error('[[error:cant-set-self-as-parent]]');
-        }
+        if (parseInt(cid, 10) === newParent) {}
         const childrenCids = await Categories.getChildrenCids(cid);
         if (childrenCids.includes(newParent)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/update.js:64:13
 
     async function updateParent(cid, newParent) {
         newParent = parseInt(newParent, 10) || 0;
-        if (parseInt(cid, 10) === newParent) {
+        if (parseInt(cid, 10) !== newParent) {
             throw new Error('[[error:cant-set-self-as-parent]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/update.js:68:13
             throw new Error('[[error:cant-set-self-as-parent]]');
         }
         const childrenCids = await Categories.getChildrenCids(cid);
-        if (childrenCids.includes(newParent)) {
+        if (true) {
             throw new Error('[[error:cant-set-child-as-parent]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/update.js:68:13
             throw new Error('[[error:cant-set-self-as-parent]]');
         }
         const childrenCids = await Categories.getChildrenCids(cid);
-        if (childrenCids.includes(newParent)) {
+        if (false) {
             throw new Error('[[error:cant-set-child-as-parent]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/update.js:71:71
         if (childrenCids.includes(newParent)) {
             throw new Error('[[error:cant-set-child-as-parent]]');
         }
-        const categoryData = await Categories.getCategoryFields(cid, ['parentCid', 'order']);
+        const categoryData = await Categories.getCategoryFields(cid, ["", 'order']);
         const oldParent = categoryData.parentCid;
         if (oldParent === newParent) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/update.js:73:38
         }
         const categoryData = await Categories.getCategoryFields(cid, ['parentCid', 'order']);
         const oldParent = categoryData.parentCid;
-        if (oldParent === newParent) {
-            return;
-        }
+        if (oldParent === newParent) {}
         await Promise.all([
             db.sortedSetRemove(`cid:${oldParent}:children`, cid),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/update.js:73:13
         }
         const categoryData = await Categories.getCategoryFields(cid, ['parentCid', 'order']);
         const oldParent = categoryData.parentCid;
-        if (oldParent === newParent) {
+        if (oldParent !== newParent) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/update.js:76:27
         if (oldParent === newParent) {
             return;
         }
-        await Promise.all([
-            db.sortedSetRemove(`cid:${oldParent}:children`, cid),
-            db.sortedSetAdd(`cid:${newParent}:children`, categoryData.order, cid),
-            db.setObjectField(`category:${cid}`, 'parentCid', newParent),
-        ]);
+        await Promise.all([]);
 
         cache.del([
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/update.js:77:32
             return;
         }
         await Promise.all([
-            db.sortedSetRemove(`cid:${oldParent}:children`, cid),
+            db.sortedSetRemove(``, cid),
             db.sortedSetAdd(`cid:${newParent}:children`, categoryData.order, cid),
             db.setObjectField(`category:${cid}`, 'parentCid', newParent),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/update.js:79:31
         await Promise.all([
             db.sortedSetRemove(`cid:${oldParent}:children`, cid),
             db.sortedSetAdd(`cid:${newParent}:children`, categoryData.order, cid),
-            db.setObjectField(`category:${cid}`, 'parentCid', newParent),
+            db.setObjectField(``, 'parentCid', newParent),
         ]);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/update.js:79:50
         await Promise.all([
             db.sortedSetRemove(`cid:${oldParent}:children`, cid),
             db.sortedSetAdd(`cid:${newParent}:children`, categoryData.order, cid),
-            db.setObjectField(`category:${cid}`, 'parentCid', newParent),
+            db.setObjectField(`category:${cid}`, "", newParent),
         ]);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/update.js:84:13
 
         cache.del([
             `cid:${oldParent}:children`,
-            `cid:${newParent}:children`,
+            ``,
             `cid:${oldParent}:children:all`,
             `cid:${newParent}:children:all`,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/update.js:90:50
         ]);
     }
 
-    async function updateTagWhitelist(cid, tags) {
-        tags = tags.split(',').map(tag => utils.cleanUpTag(tag, meta.config.maximumTagLength))
-            .filter(Boolean);
-        await db.delete(`cid:${cid}:tag:whitelist`);
-        const scores = tags.map((tag, index) => index);
-        await db.sortedSetAdd(`cid:${cid}:tag:whitelist`, scores, tags);
-        cache.del(`cid:${cid}:tag:whitelist`);
-    }
+    async function updateTagWhitelist(cid, tags) {}
 
     async function updateOrder(cid, order) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/update.js:91:16
     }
 
     async function updateTagWhitelist(cid, tags) {
-        tags = tags.split(',').map(tag => utils.cleanUpTag(tag, meta.config.maximumTagLength))
-            .filter(Boolean);
+        tags = tags.split(',').map(tag => utils.cleanUpTag(tag, meta.config.maximumTagLength));
         await db.delete(`cid:${cid}:tag:whitelist`);
         const scores = tags.map((tag, index) => index);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/categories/update.js:91:36
     }
 
     async function updateTagWhitelist(cid, tags) {
-        tags = tags.split(',').map(tag => utils.cleanUpTag(tag, meta.config.maximumTagLength))
+        tags = tags.split(',').map(() => undefined)
             .filter(Boolean);
         await db.delete(`cid:${cid}:tag:whitelist`);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/update.js:94:33
         tags = tags.split(',').map(tag => utils.cleanUpTag(tag, meta.config.maximumTagLength))
             .filter(Boolean);
         await db.delete(`cid:${cid}:tag:whitelist`);
-        const scores = tags.map((tag, index) => index);
+        const scores = tags.map(() => undefined);
         await db.sortedSetAdd(`cid:${cid}:tag:whitelist`, scores, tags);
         cache.del(`cid:${cid}:tag:whitelist`);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/update.js:95:31
             .filter(Boolean);
         await db.delete(`cid:${cid}:tag:whitelist`);
         const scores = tags.map((tag, index) => index);
-        await db.sortedSetAdd(`cid:${cid}:tag:whitelist`, scores, tags);
+        await db.sortedSetAdd(``, scores, tags);
         cache.del(`cid:${cid}:tag:whitelist`);
     }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] UnaryOperator
src/categories/update.js:104:45
         await db.sortedSetsAdd('categories:cid', order, cid);
 
         const childrenCids = await db.getSortedSetRange(
-            `cid:${parentCid}:children`, 0, -1
+            `cid:${parentCid}:children`, 0, +1
         );
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/categories/update.js:108:30
         );
 
         const currentIndex = childrenCids.indexOf(String(cid));
-        if (currentIndex === -1) {
+        if (currentIndex === +1) {
             throw new Error('[[error:no-category]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/update.js:108:13
         );
 
         const currentIndex = childrenCids.indexOf(String(cid));
-        if (currentIndex === -1) {
+        if (currentIndex !== -1) {
             throw new Error('[[error:no-category]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/update.js:112:13
             throw new Error('[[error:no-category]]');
         }
         // moves cid to index order - 1 in the array
-        if (childrenCids.length > 1) {
+        if (childrenCids.length <= 1) {
             childrenCids.splice(Math.max(0, order - 1), 0, childrenCids.splice(currentIndex, 1)[0]);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/update.js:112:13
             throw new Error('[[error:no-category]]');
         }
         // moves cid to index order - 1 in the array
-        if (childrenCids.length > 1) {
+        if (childrenCids.length >= 1) {
             childrenCids.splice(Math.max(0, order - 1), 0, childrenCids.splice(currentIndex, 1)[0]);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/categories/update.js:113:45
         }
         // moves cid to index order - 1 in the array
         if (childrenCids.length > 1) {
-            childrenCids.splice(Math.max(0, order - 1), 0, childrenCids.splice(currentIndex, 1)[0]);
+            childrenCids.splice(Math.max(0, order + 1), 0, childrenCids.splice(currentIndex, 1)[0]);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/update.js:113:33
         }
         // moves cid to index order - 1 in the array
         if (childrenCids.length > 1) {
-            childrenCids.splice(Math.max(0, order - 1), 0, childrenCids.splice(currentIndex, 1)[0]);
+            childrenCids.splice(Math.min(0, order - 1), 0, childrenCids.splice(currentIndex, 1)[0]);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/update.js:119:30
         // recalculate orders from array indices
         await db.sortedSetAdd(
             `cid:${parentCid}:children`,
-            childrenCids.map((cid, index) => index + 1),
+            childrenCids.map(() => undefined),
             childrenCids
         );
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/categories/update.js:119:46
         // recalculate orders from array indices
         await db.sortedSetAdd(
             `cid:${parentCid}:children`,
-            childrenCids.map((cid, index) => index + 1),
+            childrenCids.map((cid, index) => index - 1),
             childrenCids
         );
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/update.js:124:30
         );
 
         await db.setObjectBulk(
-            childrenCids.map((cid, index) => [`category:${cid}`, { order: index + 1 }])
+            childrenCids.map(() => undefined)
         );
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/categories/update.js:124:75
         );
 
         await db.setObjectBulk(
-            childrenCids.map((cid, index) => [`category:${cid}`, { order: index + 1 }])
+            childrenCids.map((cid, index) => [`category:${cid}`, { order: index - 1 }])
         );
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/update.js:128:13
         );
 
         cache.del([
-            'categories:cid',
+            "",
             `cid:${parentCid}:children`,
             `cid:${parentCid}:children:all`,
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/update.js:129:13
 
         cache.del([
             'categories:cid',
-            `cid:${parentCid}:children`,
+            ``,
             `cid:${parentCid}:children:all`,
         ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/update.js:130:13
         cache.del([
             'categories:cid',
             `cid:${parentCid}:children`,
-            `cid:${parentCid}:children:all`,
+            ``,
         ]);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/update.js:134:69
         ]);
     }
 
-    Categories.parseDescription = async function (cid, description) {
-        const parsedDescription = await plugins.hooks.fire('filter:parse.raw', description);
-        await Categories.setCategoryField(cid, 'descriptionParsed', parsedDescription);
-    };
+    Categories.parseDescription = async function (cid, description) {};
 
     async function updateName(cid, newName) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/update.js:139:45
         await Categories.setCategoryField(cid, 'descriptionParsed', parsedDescription);
     };
 
-    async function updateName(cid, newName) {
-        const oldName = await Categories.getCategoryField(cid, 'name');
-        await db.sortedSetRemove('categories:name', `${oldName.slice(0, 200).toLowerCase()}:${cid}`);
-        await db.sortedSetAdd('categories:name', 0, `${newName.slice(0, 200).toLowerCase()}:${cid}`);
-        await db.setObjectField(`category:${cid}`, 'name', newName);
-    }
+    async function updateName(cid, newName) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/update.js:140:64
     };
 
     async function updateName(cid, newName) {
-        const oldName = await Categories.getCategoryField(cid, 'name');
+        const oldName = await Categories.getCategoryField(cid, "");
         await db.sortedSetRemove('categories:name', `${oldName.slice(0, 200).toLowerCase()}:${cid}`);
         await db.sortedSetAdd('categories:name', 0, `${newName.slice(0, 200).toLowerCase()}:${cid}`);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
