[Killed] StringLiteral
src/categories/delete.js:30:30
     };
 
     async function purgeCategory(cid, categoryData) {
-        const bulkRemove = [['categories:cid', cid]];
+        const bulkRemove = [["", cid]];
         if (categoryData && categoryData.name) {
             bulkRemove.push(['categories:name', `${categoryData.name.slice(0, 200).toLowerCase()}:${cid}`]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/delete.js:30:28
     };
 
     async function purgeCategory(cid, categoryData) {
-        const bulkRemove = [['categories:cid', cid]];
+        const bulkRemove = [];
         if (categoryData && categoryData.name) {
             bulkRemove.push(['categories:name', `${categoryData.name.slice(0, 200).toLowerCase()}:${cid}`]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/delete.js:31:48
 
     async function purgeCategory(cid, categoryData) {
         const bulkRemove = [['categories:cid', cid]];
-        if (categoryData && categoryData.name) {
-            bulkRemove.push(['categories:name', `${categoryData.name.slice(0, 200).toLowerCase()}:${cid}`]);
-        }
+        if (categoryData && categoryData.name) {}
         await db.sortedSetRemoveBulk(bulkRemove);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/delete.js:38:28
 
         await removeFromParent(cid);
         await deleteTags(cid);
-        await db.deleteAll([
-            `cid:${cid}:tids`,
-            `cid:${cid}:tids:pinned`,
-            `cid:${cid}:tids:posts`,
-            `cid:${cid}:tids:votes`,
-            `cid:${cid}:tids:views`,
-            `cid:${cid}:tids:lastposttime`,
-            `cid:${cid}:recent_tids`,
-            `cid:${cid}:pids`,
-            `cid:${cid}:read_by_uid`,
-            `cid:${cid}:uid:watch:state`,
-            `cid:${cid}:children`,
-            `cid:${cid}:tag:whitelist`,
-            `category:${cid}`,
-        ]);
+        await db.deleteAll([]);
         const privilegeList = await privileges.categories.getPrivilegeList();
         await groups.destroy(privilegeList.map(privilege => `cid:${cid}:privileges:${privilege}`));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/delete.js:42:13
             `cid:${cid}:tids`,
             `cid:${cid}:tids:pinned`,
             `cid:${cid}:tids:posts`,
-            `cid:${cid}:tids:votes`,
+            ``,
             `cid:${cid}:tids:views`,
             `cid:${cid}:tids:lastposttime`,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/delete.js:46:13
             `cid:${cid}:tids:views`,
             `cid:${cid}:tids:lastposttime`,
             `cid:${cid}:recent_tids`,
-            `cid:${cid}:pids`,
+            ``,
             `cid:${cid}:read_by_uid`,
             `cid:${cid}:uid:watch:state`,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/delete.js:49:13
             `cid:${cid}:pids`,
             `cid:${cid}:read_by_uid`,
             `cid:${cid}:uid:watch:state`,
-            `cid:${cid}:children`,
+            ``,
             `cid:${cid}:tag:whitelist`,
             `category:${cid}`,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/delete.js:51:13
             `cid:${cid}:uid:watch:state`,
             `cid:${cid}:children`,
             `cid:${cid}:tag:whitelist`,
-            `category:${cid}`,
+            ``,
         ]);
         const privilegeList = await privileges.categories.getPrivilegeList();
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/delete.js:58:57
     }
 
     async function removeFromParent(cid) {
-        const [parentCid, children] = await Promise.all([
-            Categories.getCategoryField(cid, 'parentCid'),
-            db.getSortedSetRange(`cid:${cid}:children`, 0, -1),
-        ]);
+        const [parentCid, children] = await Promise.all([]);
 
         const bulkAdd = [];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] StringLiteral
src/categories/delete.js:66:20
         const bulkAdd = [];
         const childrenKeys = children.map((cid) => {
             bulkAdd.push(['cid:0:children', cid, cid]);
-            return `category:${cid}`;
+            return ``;
         });
 

[Killed] ArrayDeclaration
src/categories/delete.js:75:19
             db.sortedSetAddBulk(bulkAdd),
         ]);
 
-        cache.del([
-            'categories:cid',
-            'cid:0:children',
-            `cid:${parentCid}:children`,
-            `cid:${parentCid}:children:all`,
-            `cid:${cid}:children`,
-            `cid:${cid}:children:all`,
-            `cid:${cid}:tag:whitelist`,
-        ]);
+        cache.del([]);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/delete.js:78:13
         cache.del([
             'categories:cid',
             'cid:0:children',
-            `cid:${parentCid}:children`,
+            ``,
             `cid:${parentCid}:children:all`,
             `cid:${cid}:children`,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
