[Killed] BlockStatement
src/categories/index.js:27:43
 require('./watch')(Categories);
 require('./search')(Categories);
 
-Categories.exists = async function (cids) {
-    return await db.exists(
-        Array.isArray(cids) ? cids.map(cid => `category:${cid}`) : `category:${cids}`
-    );
-};
+Categories.exists = async function (cids) {};
 
 Categories.getCategoryById = async function (data) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:29:40
 
 Categories.exists = async function (cids) {
     return await db.exists(
-        Array.isArray(cids) ? cids.map(cid => `category:${cid}`) : `category:${cids}`
+        Array.isArray(cids) ? cids.map(() => undefined) : `category:${cids}`
     );
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:35:25
 
 Categories.getCategoryById = async function (data) {
     const categories = await Categories.getCategories([data.cid], data.uid);
-    if (!categories[0]) {
-        return null;
-    }
+    if (!categories[0]) {}
     const category = categories[0];
     data.category = category;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:35:9
 
 Categories.getCategoryById = async function (data) {
     const categories = await Categories.getCategories([data.cid], data.uid);
-    if (!categories[0]) {
+    if (true) {
         return null;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/index.js:44:34
     const promises = [
         Categories.getCategoryTopics(data),
         Categories.getTopicCount(data),
-        Categories.getWatchState([data.cid], data.uid),
+        Categories.getWatchState([], data.uid),
         getChildrenTree(category, data.uid),
     ];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:48:9
         getChildrenTree(category, data.uid),
     ];
 
-    if (category.parentCid) {
+    if (true) {
         promises.push(Categories.getCategoryData(category.parentCid));
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:48:9
         getChildrenTree(category, data.uid),
     ];
 
-    if (category.parentCid) {
+    if (false) {
         promises.push(Categories.getCategoryData(category.parentCid));
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:56:26
     category.topics = topics.topics;
     category.nextStart = topics.nextStart;
     category.topic_count = topicCount;
-    category.isWatched = watchState[0] === Categories.watchStates.watching;
+    category.isWatched = false;
     category.isNotWatched = watchState[0] === Categories.watchStates.notwatching;
     category.isIgnored = watchState[0] === Categories.watchStates.ignoring;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/index.js:56:26
     category.topics = topics.topics;
     category.nextStart = topics.nextStart;
     category.topic_count = topicCount;
-    category.isWatched = watchState[0] === Categories.watchStates.watching;
+    category.isWatched = watchState[0] !== Categories.watchStates.watching;
     category.isNotWatched = watchState[0] === Categories.watchStates.notwatching;
     category.isIgnored = watchState[0] === Categories.watchStates.ignoring;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:57:29
     category.nextStart = topics.nextStart;
     category.topic_count = topicCount;
     category.isWatched = watchState[0] === Categories.watchStates.watching;
-    category.isNotWatched = watchState[0] === Categories.watchStates.notwatching;
+    category.isNotWatched = false;
     category.isIgnored = watchState[0] === Categories.watchStates.ignoring;
     category.parent = parent;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:57:29
     category.nextStart = topics.nextStart;
     category.topic_count = topicCount;
     category.isWatched = watchState[0] === Categories.watchStates.watching;
-    category.isNotWatched = watchState[0] === Categories.watchStates.notwatching;
+    category.isNotWatched = true;
     category.isIgnored = watchState[0] === Categories.watchStates.ignoring;
     category.parent = parent;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/index.js:58:26
     category.topic_count = topicCount;
     category.isWatched = watchState[0] === Categories.watchStates.watching;
     category.isNotWatched = watchState[0] === Categories.watchStates.notwatching;
-    category.isIgnored = watchState[0] === Categories.watchStates.ignoring;
+    category.isIgnored = watchState[0] !== Categories.watchStates.ignoring;
     category.parent = parent;
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:58:26
     category.topic_count = topicCount;
     category.isWatched = watchState[0] === Categories.watchStates.watching;
     category.isNotWatched = watchState[0] === Categories.watchStates.notwatching;
-    category.isIgnored = watchState[0] === Categories.watchStates.ignoring;
+    category.isIgnored = true;
     category.parent = parent;
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:69:53
     return result.category;
 };
 
-Categories.getAllCidsFromSet = async function (key) {
-    let cids = cache.get(key);
-    if (cids) {
-        return cids.slice();
-    }
-
-    cids = await db.getSortedSetRange(key, 0, -1);
-    cids = cids.map(cid => parseInt(cid, 10));
-    cache.set(key, cids);
-    return cids.slice();
-};
+Categories.getAllCidsFromSet = async function (key) {};
 
 Categories.getAllCategories = async function (uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:71:9
 
 Categories.getAllCidsFromSet = async function (key) {
     let cids = cache.get(key);
-    if (cids) {
+    if (true) {
         return cids.slice();
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:71:15
 
 Categories.getAllCidsFromSet = async function (key) {
     let cids = cache.get(key);
-    if (cids) {
-        return cids.slice();
-    }
+    if (cids) {}
 
     cids = await db.getSortedSetRange(key, 0, -1);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/index.js:72:16
 Categories.getAllCidsFromSet = async function (key) {
     let cids = cache.get(key);
     if (cids) {
-        return cids.slice();
+        return cids;
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/categories/index.js:75:47
         return cids.slice();
     }
 
-    cids = await db.getSortedSetRange(key, 0, -1);
+    cids = await db.getSortedSetRange(key, 0, +1);
     cids = cids.map(cid => parseInt(cid, 10));
     cache.set(key, cids);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:76:21
     }
 
     cids = await db.getSortedSetRange(key, 0, -1);
-    cids = cids.map(cid => parseInt(cid, 10));
+    cids = cids.map(() => undefined);
     cache.set(key, cids);
     return cids.slice();
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/index.js:78:12
     cids = await db.getSortedSetRange(key, 0, -1);
     cids = cids.map(cid => parseInt(cid, 10));
     cache.set(key, cids);
-    return cids.slice();
+    return cids;
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:81:52
     return cids.slice();
 };
 
-Categories.getAllCategories = async function (uid) {
-    const cids = await Categories.getAllCidsFromSet('categories:cid');
-    return await Categories.getCategories(cids, uid);
-};
+Categories.getAllCategories = async function (uid) {};
 
 Categories.getCidsByPrivilege = async function (set, uid, privilege) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:86:70
     return await Categories.getCategories(cids, uid);
 };
 
-Categories.getCidsByPrivilege = async function (set, uid, privilege) {
-    const cids = await Categories.getAllCidsFromSet(set);
-    return await privileges.categories.filterCids(privilege, cids, uid);
-};
+Categories.getCidsByPrivilege = async function (set, uid, privilege) {};
 
 Categories.getCategoriesByPrivilege = async function (set, uid, privilege) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:91:76
     return await privileges.categories.filterCids(privilege, cids, uid);
 };
 
-Categories.getCategoriesByPrivilege = async function (set, uid, privilege) {
-    const cids = await Categories.getCidsByPrivilege(set, uid, privilege);
-    return await Categories.getCategories(cids, uid);
-};
+Categories.getCategoriesByPrivilege = async function (set, uid, privilege) {};
 
 Categories.getModerators = async function (cid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BlockStatement
src/categories/index.js:96:49
     return await Categories.getCategories(cids, uid);
 };
 
-Categories.getModerators = async function (cid) {
-    const uids = await Categories.getModeratorUids([cid]);
-    return await user.getUsersFields(uids[0], ['uid', 'username', 'userslug', 'picture']);
-};
+Categories.getModerators = async function (cid) {};
 
 Categories.getModeratorUids = async function (cids) {

[Killed] BlockStatement
src/categories/index.js:102:51
 };
 
 Categories.getModeratorUids = async function (cids) {
-    const groupNames = cids.reduce((memo, cid) => {
-        memo.push(`cid:${cid}:privileges:moderate`);
-        memo.push(`cid:${cid}:privileges:groups:moderate`);
-        return memo;
-    }, []);
+    const groupNames = cids.reduce((memo, cid) => {}, []);
 
     const memberSets = await groups.getMembersOfGroups(groupNames);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/index.js:106:8
         memo.push(`cid:${cid}:privileges:moderate`);
         memo.push(`cid:${cid}:privileges:groups:moderate`);
         return memo;
-    }, []);
+    }, ["Stryker was here"]);
 
     const memberSets = await groups.getMembersOfGroups(groupNames);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:110:56
 
     const memberSets = await groups.getMembersOfGroups(groupNames);
     // Every other set is actually a list of user groups, not uids, so convert those to members
-    const sets = memberSets.reduce((memo, set, idx) => {
-        if (idx % 2) {
-            memo.groupNames.push(set);
-        } else {
-            memo.uids.push(set);
-        }
-
-        return memo;
-    }, { groupNames: [], uids: [] });
+    const sets = memberSets.reduce((memo, set, idx) => {}, { groupNames: [], uids: [] });
 
     const uniqGroups = _.uniq(_.flatten(sets.groupNames));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:111:22
     const memberSets = await groups.getMembersOfGroups(groupNames);
     // Every other set is actually a list of user groups, not uids, so convert those to members
     const sets = memberSets.reduce((memo, set, idx) => {
-        if (idx % 2) {
-            memo.groupNames.push(set);
-        } else {
+        if (idx % 2) {} else {
             memo.uids.push(set);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/categories/index.js:111:13
     const memberSets = await groups.getMembersOfGroups(groupNames);
     // Every other set is actually a list of user groups, not uids, so convert those to members
     const sets = memberSets.reduce((memo, set, idx) => {
-        if (idx % 2) {
+        if (idx * 2) {
             memo.groupNames.push(set);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/categories/index.js:113:16
     const sets = memberSets.reduce((memo, set, idx) => {
         if (idx % 2) {
             memo.groupNames.push(set);
-        } else {
-            memo.uids.push(set);
-        }
+        } else {}
 
         return memo;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:124:93
     const groupUids = await groups.getMembersOfGroups(uniqGroups);
     const map = _.zipObject(uniqGroups, groupUids);
     const moderatorUids = cids.map(
-        (cid, index) => _.uniq(sets.uids[index].concat(_.flatten(sets.groupNames[index].map(g => map[g]))))
+        (cid, index) => _.uniq(sets.uids[index].concat(_.flatten(sets.groupNames[index].map(() => undefined))))
     );
     return moderatorUids;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:124:9
     const groupUids = await groups.getMembersOfGroups(uniqGroups);
     const map = _.zipObject(uniqGroups, groupUids);
     const moderatorUids = cids.map(
-        (cid, index) => _.uniq(sets.uids[index].concat(_.flatten(sets.groupNames[index].map(g => map[g]))))
+        () => undefined
     );
     return moderatorUids;
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/categories/index.js:129:55
     return moderatorUids;
 };
 
-Categories.getCategories = async function (cids, uid) {
-    if (!Array.isArray(cids)) {
-        throw new Error('[[error:invalid-cid]]');
-    }
-
-    if (!cids.length) {
-        return [];
-    }
-    uid = parseInt(uid, 10);
-
-    const [categories, tagWhitelist, hasRead] = await Promise.all([
-        Categories.getCategoriesData(cids),
-        Categories.getTagWhitelist(cids),
-        Categories.hasReadCategories(cids, uid),
-    ]);
-    categories.forEach((category, i) => {
-        if (category) {
-            category.tagWhitelist = tagWhitelist[i];
-            category['unread-class'] = (category.topic_count === 0 || (hasRead[i] && uid !== 0)) ? '' : 'unread';
-        }
-    });
-    return categories;
-};
+Categories.getCategories = async function (cids, uid) {};
 
 Categories.getTagWhitelist = async function (cids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:130:9
 };
 
 Categories.getCategories = async function (cids, uid) {
-    if (!Array.isArray(cids)) {
+    if (true) {
         throw new Error('[[error:invalid-cid]]');
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:130:9
 };
 
 Categories.getCategories = async function (cids, uid) {
-    if (!Array.isArray(cids)) {
+    if (false) {
         throw new Error('[[error:invalid-cid]]');
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:134:9
         throw new Error('[[error:invalid-cid]]');
     }
 
-    if (!cids.length) {
+    if (false) {
         return [];
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:134:23
         throw new Error('[[error:invalid-cid]]');
     }
 
-    if (!cids.length) {
-        return [];
-    }
+    if (!cids.length) {}
     uid = parseInt(uid, 10);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/index.js:135:16
     }
 
     if (!cids.length) {
-        return [];
+        return ["Stryker was here"];
     }
     uid = parseInt(uid, 10);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/index.js:139:67
     }
     uid = parseInt(uid, 10);
 
-    const [categories, tagWhitelist, hasRead] = await Promise.all([
-        Categories.getCategoriesData(cids),
-        Categories.getTagWhitelist(cids),
-        Categories.hasReadCategories(cids, uid),
-    ]);
+    const [categories, tagWhitelist, hasRead] = await Promise.all([]);
     categories.forEach((category, i) => {
         if (category) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/categories/index.js:144:41
         Categories.getTagWhitelist(cids),
         Categories.hasReadCategories(cids, uid),
     ]);
-    categories.forEach((category, i) => {
-        if (category) {
-            category.tagWhitelist = tagWhitelist[i];
-            category['unread-class'] = (category.topic_count === 0 || (hasRead[i] && uid !== 0)) ? '' : 'unread';
-        }
-    });
+    categories.forEach((category, i) => {});
     return categories;
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:145:13
         Categories.hasReadCategories(cids, uid),
     ]);
     categories.forEach((category, i) => {
-        if (category) {
+        if (false) {
             category.tagWhitelist = tagWhitelist[i];
             category['unread-class'] = (category.topic_count === 0 || (hasRead[i] && uid !== 0)) ? '' : 'unread';
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/index.js:145:13
         Categories.hasReadCategories(cids, uid),
     ]);
     categories.forEach((category, i) => {
-        if (category) {
+        if (true) {
             category.tagWhitelist = tagWhitelist[i];
             category['unread-class'] = (category.topic_count === 0 || (hasRead[i] && uid !== 0)) ? '' : 'unread';
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/index.js:147:86
     categories.forEach((category, i) => {
         if (category) {
             category.tagWhitelist = tagWhitelist[i];
-            category['unread-class'] = (category.topic_count === 0 || (hasRead[i] && uid !== 0)) ? '' : 'unread';
+            category['unread-class'] = (category.topic_count === 0 || (hasRead[i] && uid === 0)) ? '' : 'unread';
         }
     });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:147:72
     categories.forEach((category, i) => {
         if (category) {
             category.tagWhitelist = tagWhitelist[i];
-            category['unread-class'] = (category.topic_count === 0 || (hasRead[i] && uid !== 0)) ? '' : 'unread';
+            category['unread-class'] = (category.topic_count === 0 || (false)) ? '' : 'unread';
         }
     });
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/categories/index.js:153:52
     return categories;
 };
 
-Categories.getTagWhitelist = async function (cids) {
-    const cachedData = {};
-
-    const nonCachedCids = cids.filter((cid) => {
-        const data = cache.get(`cid:${cid}:tag:whitelist`);
-        const isInCache = data !== undefined;
-        if (isInCache) {
-            cachedData[cid] = data;
-        }
-        return !isInCache;
-    });
-
-    if (!nonCachedCids.length) {
-        return cids.map(cid => cachedData[cid]);
-    }
-
-    const keys = nonCachedCids.map(cid => `cid:${cid}:tag:whitelist`);
-    const data = await db.getSortedSetsMembers(keys);
-
-    nonCachedCids.forEach((cid, index) => {
-        cachedData[cid] = data[index];
-        cache.set(`cid:${cid}:tag:whitelist`, data[index]);
-    });
-    return cids.map(cid => cachedData[cid]);
-};
+Categories.getTagWhitelist = async function (cids) {};
 
 // remove system tags from tag whitelist for non privileged user
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:156:48
 Categories.getTagWhitelist = async function (cids) {
     const cachedData = {};
 
-    const nonCachedCids = cids.filter((cid) => {
-        const data = cache.get(`cid:${cid}:tag:whitelist`);
-        const isInCache = data !== undefined;
-        if (isInCache) {
-            cachedData[cid] = data;
-        }
-        return !isInCache;
-    });
+    const nonCachedCids = cids.filter((cid) => {});
 
     if (!nonCachedCids.length) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/index.js:156:27
 Categories.getTagWhitelist = async function (cids) {
     const cachedData = {};
 
-    const nonCachedCids = cids.filter((cid) => {
-        const data = cache.get(`cid:${cid}:tag:whitelist`);
-        const isInCache = data !== undefined;
-        if (isInCache) {
-            cachedData[cid] = data;
-        }
-        return !isInCache;
-    });
+    const nonCachedCids = cids;
 
     if (!nonCachedCids.length) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/index.js:157:32
     const cachedData = {};
 
     const nonCachedCids = cids.filter((cid) => {
-        const data = cache.get(`cid:${cid}:tag:whitelist`);
+        const data = cache.get(``);
         const isInCache = data !== undefined;
         if (isInCache) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/index.js:158:27
 
     const nonCachedCids = cids.filter((cid) => {
         const data = cache.get(`cid:${cid}:tag:whitelist`);
-        const isInCache = data !== undefined;
+        const isInCache = data === undefined;
         if (isInCache) {
             cachedData[cid] = data;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:158:27
 
     const nonCachedCids = cids.filter((cid) => {
         const data = cache.get(`cid:${cid}:tag:whitelist`);
-        const isInCache = data !== undefined;
+        const isInCache = false;
         if (isInCache) {
             cachedData[cid] = data;
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/index.js:159:13
     const nonCachedCids = cids.filter((cid) => {
         const data = cache.get(`cid:${cid}:tag:whitelist`);
         const isInCache = data !== undefined;
-        if (isInCache) {
+        if (false) {
             cachedData[cid] = data;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:159:13
     const nonCachedCids = cids.filter((cid) => {
         const data = cache.get(`cid:${cid}:tag:whitelist`);
         const isInCache = data !== undefined;
-        if (isInCache) {
+        if (true) {
             cachedData[cid] = data;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/index.js:162:16
         if (isInCache) {
             cachedData[cid] = data;
         }
-        return !isInCache;
+        return isInCache;
     });
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:165:9
         return !isInCache;
     });
 
-    if (!nonCachedCids.length) {
+    if (true) {
         return cids.map(cid => cachedData[cid]);
     }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/index.js:165:9
         return !isInCache;
     });
 
-    if (!nonCachedCids.length) {
+    if (false) {
         return cids.map(cid => cachedData[cid]);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:166:25
     });
 
     if (!nonCachedCids.length) {
-        return cids.map(cid => cachedData[cid]);
+        return cids.map(() => undefined);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:169:36
         return cids.map(cid => cachedData[cid]);
     }
 
-    const keys = nonCachedCids.map(cid => `cid:${cid}:tag:whitelist`);
+    const keys = nonCachedCids.map(() => undefined);
     const data = await db.getSortedSetsMembers(keys);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:172:43
     const keys = nonCachedCids.map(cid => `cid:${cid}:tag:whitelist`);
     const data = await db.getSortedSetsMembers(keys);
 
-    nonCachedCids.forEach((cid, index) => {
-        cachedData[cid] = data[index];
-        cache.set(`cid:${cid}:tag:whitelist`, data[index]);
-    });
+    nonCachedCids.forEach((cid, index) => {});
     return cids.map(cid => cachedData[cid]);
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:176:21
         cachedData[cid] = data[index];
         cache.set(`cid:${cid}:tag:whitelist`, data[index]);
     });
-    return cids.map(cid => cachedData[cid]);
+    return cids.map(() => undefined);
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:180:71
 };
 
 // remove system tags from tag whitelist for non privileged user
-Categories.filterTagWhitelist = function (tagWhitelist, isAdminOrMod) {
-    const systemTags = (meta.config.systemTags || '').split(',');
-    if (!isAdminOrMod && systemTags.length) {
-        return tagWhitelist.filter(tag => !systemTags.includes(tag));
-    }
-    return tagWhitelist;
-};
+Categories.filterTagWhitelist = function (tagWhitelist, isAdminOrMod) {};
 
 function calculateTopicPostCount(category) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing
