[Killed] MethodExpression
src/categories/update.js:141:56
 
     async function updateName(cid, newName) {
         const oldName = await Categories.getCategoryField(cid, 'name');
-        await db.sortedSetRemove('categories:name', `${oldName.slice(0, 200).toLowerCase()}:${cid}`);
+        await db.sortedSetRemove('categories:name', `${oldName.slice(0, 200).toUpperCase()}:${cid}`);
         await db.sortedSetAdd('categories:name', 0, `${newName.slice(0, 200).toLowerCase()}:${cid}`);
         await db.setObjectField(`category:${cid}`, 'name', newName);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/update.js:141:56
 
     async function updateName(cid, newName) {
         const oldName = await Categories.getCategoryField(cid, 'name');
-        await db.sortedSetRemove('categories:name', `${oldName.slice(0, 200).toLowerCase()}:${cid}`);
+        await db.sortedSetRemove('categories:name', `${oldName.toLowerCase()}:${cid}`);
         await db.sortedSetAdd('categories:name', 0, `${newName.slice(0, 200).toLowerCase()}:${cid}`);
         await db.setObjectField(`category:${cid}`, 'name', newName);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/update.js:142:56
     async function updateName(cid, newName) {
         const oldName = await Categories.getCategoryField(cid, 'name');
         await db.sortedSetRemove('categories:name', `${oldName.slice(0, 200).toLowerCase()}:${cid}`);
-        await db.sortedSetAdd('categories:name', 0, `${newName.slice(0, 200).toLowerCase()}:${cid}`);
+        await db.sortedSetAdd('categories:name', 0, `${newName.slice(0, 200).toUpperCase()}:${cid}`);
         await db.setObjectField(`category:${cid}`, 'name', newName);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/update.js:142:56
     async function updateName(cid, newName) {
         const oldName = await Categories.getCategoryField(cid, 'name');
         await db.sortedSetRemove('categories:name', `${oldName.slice(0, 200).toLowerCase()}:${cid}`);
-        await db.sortedSetAdd('categories:name', 0, `${newName.slice(0, 200).toLowerCase()}:${cid}`);
+        await db.sortedSetAdd('categories:name', 0, `${newName.toLowerCase()}:${cid}`);
         await db.setObjectField(`category:${cid}`, 'name', newName);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/update.js:143:52
         const oldName = await Categories.getCategoryField(cid, 'name');
         await db.sortedSetRemove('categories:name', `${oldName.slice(0, 200).toLowerCase()}:${cid}`);
         await db.sortedSetAdd('categories:name', 0, `${newName.slice(0, 200).toLowerCase()}:${cid}`);
-        await db.setObjectField(`category:${cid}`, 'name', newName);
+        await db.setObjectField(`category:${cid}`, "", newName);
     }
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
