[Killed] ConditionalExpression
src/categories/index.js:181:25
 
 // remove system tags from tag whitelist for non privileged user
 Categories.filterTagWhitelist = function (tagWhitelist, isAdminOrMod) {
-    const systemTags = (meta.config.systemTags || '').split(',');
+    const systemTags = (false).split(',');
     if (!isAdminOrMod && systemTags.length) {
         return tagWhitelist.filter(tag => !systemTags.includes(tag));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:181:25
 
 // remove system tags from tag whitelist for non privileged user
 Categories.filterTagWhitelist = function (tagWhitelist, isAdminOrMod) {
-    const systemTags = (meta.config.systemTags || '').split(',');
+    const systemTags = (true).split(',');
     if (!isAdminOrMod && systemTags.length) {
         return tagWhitelist.filter(tag => !systemTags.includes(tag));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:182:45
 // remove system tags from tag whitelist for non privileged user
 Categories.filterTagWhitelist = function (tagWhitelist, isAdminOrMod) {
     const systemTags = (meta.config.systemTags || '').split(',');
-    if (!isAdminOrMod && systemTags.length) {
-        return tagWhitelist.filter(tag => !systemTags.includes(tag));
-    }
+    if (!isAdminOrMod && systemTags.length) {}
     return tagWhitelist;
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:182:9
 // remove system tags from tag whitelist for non privileged user
 Categories.filterTagWhitelist = function (tagWhitelist, isAdminOrMod) {
     const systemTags = (meta.config.systemTags || '').split(',');
-    if (!isAdminOrMod && systemTags.length) {
+    if (false) {
         return tagWhitelist.filter(tag => !systemTags.includes(tag));
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:183:36
 Categories.filterTagWhitelist = function (tagWhitelist, isAdminOrMod) {
     const systemTags = (meta.config.systemTags || '').split(',');
     if (!isAdminOrMod && systemTags.length) {
-        return tagWhitelist.filter(tag => !systemTags.includes(tag));
+        return tagWhitelist.filter(() => undefined);
     }
     return tagWhitelist;
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] MethodExpression
src/categories/index.js:183:16
 Categories.filterTagWhitelist = function (tagWhitelist, isAdminOrMod) {
     const systemTags = (meta.config.systemTags || '').split(',');
     if (!isAdminOrMod && systemTags.length) {
-        return tagWhitelist.filter(tag => !systemTags.includes(tag));
+        return tagWhitelist;
     }
     return tagWhitelist;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:188:44
     return tagWhitelist;
 };
 
-function calculateTopicPostCount(category) {
-    if (!category) {
-        return;
-    }
-
-    let postCount = category.post_count;
-    let topicCount = category.topic_count;
-    if (Array.isArray(category.children)) {
-        category.children.forEach((child) => {
-            calculateTopicPostCount(child);
-            postCount += parseInt(child.totalPostCount, 10) || 0;
-            topicCount += parseInt(child.totalTopicCount, 10) || 0;
-        });
-    }
-
-    category.totalPostCount = postCount;
-    category.totalTopicCount = topicCount;
-}
+function calculateTopicPostCount(category) {}
 Categories.calculateTopicPostCount = calculateTopicPostCount;
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/index.js:189:9
 };
 
 function calculateTopicPostCount(category) {
-    if (!category) {
+    if (category) {
         return;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:189:9
 };
 
 function calculateTopicPostCount(category) {
-    if (!category) {
+    if (false) {
         return;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:195:43
 
     let postCount = category.post_count;
     let topicCount = category.topic_count;
-    if (Array.isArray(category.children)) {
-        category.children.forEach((child) => {
-            calculateTopicPostCount(child);
-            postCount += parseInt(child.totalPostCount, 10) || 0;
-            topicCount += parseInt(child.totalTopicCount, 10) || 0;
-        });
-    }
+    if (Array.isArray(category.children)) {}
 
     category.totalPostCount = postCount;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:195:9
 
     let postCount = category.post_count;
     let topicCount = category.topic_count;
-    if (Array.isArray(category.children)) {
+    if (true) {
         category.children.forEach((child) => {
             calculateTopicPostCount(child);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:196:46
     let postCount = category.post_count;
     let topicCount = category.topic_count;
     if (Array.isArray(category.children)) {
-        category.children.forEach((child) => {
-            calculateTopicPostCount(child);
-            postCount += parseInt(child.totalPostCount, 10) || 0;
-            topicCount += parseInt(child.totalTopicCount, 10) || 0;
-        });
+        category.children.forEach((child) => {});
     }
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] AssignmentOperator
src/categories/index.js:198:13
     if (Array.isArray(category.children)) {
         category.children.forEach((child) => {
             calculateTopicPostCount(child);
-            postCount += parseInt(child.totalPostCount, 10) || 0;
+            postCount -= parseInt(child.totalPostCount, 10) || 0;
             topicCount += parseInt(child.totalTopicCount, 10) || 0;
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/index.js:198:26
     if (Array.isArray(category.children)) {
         category.children.forEach((child) => {
             calculateTopicPostCount(child);
-            postCount += parseInt(child.totalPostCount, 10) || 0;
+            postCount += parseInt(child.totalPostCount, 10) && 0;
             topicCount += parseInt(child.totalTopicCount, 10) || 0;
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:199:27
         category.children.forEach((child) => {
             calculateTopicPostCount(child);
             postCount += parseInt(child.totalPostCount, 10) || 0;
-            topicCount += parseInt(child.totalTopicCount, 10) || 0;
+            topicCount += true;
         });
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] AssignmentOperator
src/categories/index.js:199:13
         category.children.forEach((child) => {
             calculateTopicPostCount(child);
             postCount += parseInt(child.totalPostCount, 10) || 0;
-            topicCount += parseInt(child.totalTopicCount, 10) || 0;
+            topicCount -= parseInt(child.totalTopicCount, 10) || 0;
         });
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:208:47
 }
 Categories.calculateTopicPostCount = calculateTopicPostCount;
 
-Categories.getParents = async function (cids) {
-    const categoriesData = await Categories.getCategoriesFields(cids, ['parentCid']);
-    const parentCids = categoriesData.filter(c => c && c.parentCid).map(c => c.parentCid);
-    if (!parentCids.length) {
-        return cids.map(() => null);
-    }
-    const parentData = await Categories.getCategoriesData(parentCids);
-    const cidToParent = _.zipObject(parentCids, parentData);
-    return categoriesData.map(category => cidToParent[category.parentCid]);
-};
+Categories.getParents = async function (cids) {};
 
 Categories.getChildren = async function (cids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:210:51
 
 Categories.getParents = async function (cids) {
     const categoriesData = await Categories.getCategoriesFields(cids, ['parentCid']);
-    const parentCids = categoriesData.filter(c => c && c.parentCid).map(c => c.parentCid);
+    const parentCids = categoriesData.filter(c => false).map(c => c.parentCid);
     if (!parentCids.length) {
         return cids.map(() => null);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:210:46
 
 Categories.getParents = async function (cids) {
     const categoriesData = await Categories.getCategoriesFields(cids, ['parentCid']);
-    const parentCids = categoriesData.filter(c => c && c.parentCid).map(c => c.parentCid);
+    const parentCids = categoriesData.filter(() => undefined).map(c => c.parentCid);
     if (!parentCids.length) {
         return cids.map(() => null);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:211:9
 Categories.getParents = async function (cids) {
     const categoriesData = await Categories.getCategoriesFields(cids, ['parentCid']);
     const parentCids = categoriesData.filter(c => c && c.parentCid).map(c => c.parentCid);
-    if (!parentCids.length) {
+    if (false) {
         return cids.map(() => null);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:211:9
 Categories.getParents = async function (cids) {
     const categoriesData = await Categories.getCategoriesFields(cids, ['parentCid']);
     const parentCids = categoriesData.filter(c => c && c.parentCid).map(c => c.parentCid);
-    if (!parentCids.length) {
+    if (true) {
         return cids.map(() => null);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:212:25
     const categoriesData = await Categories.getCategoriesFields(cids, ['parentCid']);
     const parentCids = categoriesData.filter(c => c && c.parentCid).map(c => c.parentCid);
     if (!parentCids.length) {
-        return cids.map(() => null);
+        return cids.map(() => undefined);
     }
     const parentData = await Categories.getCategoriesData(parentCids);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ArrowFunction
src/categories/index.js:216:31
     }
     const parentData = await Categories.getCategoriesData(parentCids);
     const cidToParent = _.zipObject(parentCids, parentData);
-    return categoriesData.map(category => cidToParent[category.parentCid]);
+    return categoriesData.map(() => undefined);
 };
 

[Killed] BlockStatement
src/categories/index.js:219:53
     return categoriesData.map(category => cidToParent[category.parentCid]);
 };
 
-Categories.getChildren = async function (cids, uid) {
-    const categoryData = await Categories.getCategoriesFields(cids, ['parentCid']);
-    const categories = categoryData.map((category, index) => ({ cid: cids[index], parentCid: category.parentCid }));
-    await Promise.all(categories.map(c => getChildrenTree(c, uid)));
-    return categories.map(c => c && c.children);
-};
+Categories.getChildren = async function (cids, uid) {};
 
 async function getChildrenTree(category, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/index.js:220:69
 };
 
 Categories.getChildren = async function (cids, uid) {
-    const categoryData = await Categories.getCategoriesFields(cids, ['parentCid']);
+    const categoryData = await Categories.getCategoriesFields(cids, []);
     const categories = categoryData.map((category, index) => ({ cid: cids[index], parentCid: category.parentCid }));
     await Promise.all(categories.map(c => getChildrenTree(c, uid)));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:221:41
 
 Categories.getChildren = async function (cids, uid) {
     const categoryData = await Categories.getCategoriesFields(cids, ['parentCid']);
-    const categories = categoryData.map((category, index) => ({ cid: cids[index], parentCid: category.parentCid }));
+    const categories = categoryData.map(() => undefined);
     await Promise.all(categories.map(c => getChildrenTree(c, uid)));
     return categories.map(c => c && c.children);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:222:38
 Categories.getChildren = async function (cids, uid) {
     const categoryData = await Categories.getCategoriesFields(cids, ['parentCid']);
     const categories = categoryData.map((category, index) => ({ cid: cids[index], parentCid: category.parentCid }));
-    await Promise.all(categories.map(c => getChildrenTree(c, uid)));
+    await Promise.all(categories.map(() => undefined));
     return categories.map(c => c && c.children);
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:223:32
     const categoryData = await Categories.getCategoriesFields(cids, ['parentCid']);
     const categories = categoryData.map((category, index) => ({ cid: cids[index], parentCid: category.parentCid }));
     await Promise.all(categories.map(c => getChildrenTree(c, uid)));
-    return categories.map(c => c && c.children);
+    return categories.map(c => true);
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/index.js:223:32
     const categoryData = await Categories.getCategoriesFields(cids, ['parentCid']);
     const categories = categoryData.map((category, index) => ({ cid: cids[index], parentCid: category.parentCid }));
     await Promise.all(categories.map(c => getChildrenTree(c, uid)));
-    return categories.map(c => c && c.children);
+    return categories.map(c => c || c.children);
 };
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/categories/index.js:226:47
     return categories.map(c => c && c.children);
 };
 
-async function getChildrenTree(category, uid) {
-    let childrenCids = await Categories.getChildrenCids(category.cid);
-    childrenCids = await privileges.categories.filterCids('find', childrenCids, uid);
-    childrenCids = childrenCids.filter(cid => parseInt(category.cid, 10) !== parseInt(cid, 10));
-    if (!childrenCids.length) {
-        category.children = [];
-        return;
-    }
-    let childrenData = await Categories.getCategoriesData(childrenCids);
-    childrenData = childrenData.filter(Boolean);
-    childrenCids = childrenData.map(child => child.cid);
-    const hasRead = await Categories.hasReadCategories(childrenCids, uid);
-    childrenData.forEach((child, i) => {
-        child['unread-class'] = (child.topic_count === 0 || (hasRead[i] && uid !== 0)) ? '' : 'unread';
-    });
-    Categories.getTree([category].concat(childrenData), category.parentCid);
-}
+async function getChildrenTree(category, uid) {}
 
 Categories.getChildrenTree = getChildrenTree;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:229:40
 async function getChildrenTree(category, uid) {
     let childrenCids = await Categories.getChildrenCids(category.cid);
     childrenCids = await privileges.categories.filterCids('find', childrenCids, uid);
-    childrenCids = childrenCids.filter(cid => parseInt(category.cid, 10) !== parseInt(cid, 10));
+    childrenCids = childrenCids.filter(() => undefined);
     if (!childrenCids.length) {
         category.children = [];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:229:47
 async function getChildrenTree(category, uid) {
     let childrenCids = await Categories.getChildrenCids(category.cid);
     childrenCids = await privileges.categories.filterCids('find', childrenCids, uid);
-    childrenCids = childrenCids.filter(cid => parseInt(category.cid, 10) !== parseInt(cid, 10));
+    childrenCids = childrenCids.filter(cid => true);
     if (!childrenCids.length) {
         category.children = [];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:230:9
     let childrenCids = await Categories.getChildrenCids(category.cid);
     childrenCids = await privileges.categories.filterCids('find', childrenCids, uid);
     childrenCids = childrenCids.filter(cid => parseInt(category.cid, 10) !== parseInt(cid, 10));
-    if (!childrenCids.length) {
+    if (true) {
         category.children = [];
         return;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/index.js:230:9
     let childrenCids = await Categories.getChildrenCids(category.cid);
     childrenCids = await privileges.categories.filterCids('find', childrenCids, uid);
     childrenCids = childrenCids.filter(cid => parseInt(category.cid, 10) !== parseInt(cid, 10));
-    if (!childrenCids.length) {
+    if (childrenCids.length) {
         category.children = [];
         return;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/index.js:231:29
     childrenCids = await privileges.categories.filterCids('find', childrenCids, uid);
     childrenCids = childrenCids.filter(cid => parseInt(category.cid, 10) !== parseInt(cid, 10));
     if (!childrenCids.length) {
-        category.children = [];
+        category.children = ["Stryker was here"];
         return;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/index.js:235:20
         return;
     }
     let childrenData = await Categories.getCategoriesData(childrenCids);
-    childrenData = childrenData.filter(Boolean);
+    childrenData = childrenData;
     childrenCids = childrenData.map(child => child.cid);
     const hasRead = await Categories.hasReadCategories(childrenCids, uid);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/categories/index.js:236:37
     }
     let childrenData = await Categories.getCategoriesData(childrenCids);
     childrenData = childrenData.filter(Boolean);
-    childrenCids = childrenData.map(child => child.cid);
+    childrenCids = childrenData.map(() => undefined);
     const hasRead = await Categories.hasReadCategories(childrenCids, uid);
     childrenData.forEach((child, i) => {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:238:40
     childrenData = childrenData.filter(Boolean);
     childrenCids = childrenData.map(child => child.cid);
     const hasRead = await Categories.hasReadCategories(childrenCids, uid);
-    childrenData.forEach((child, i) => {
-        child['unread-class'] = (child.topic_count === 0 || (hasRead[i] && uid !== 0)) ? '' : 'unread';
-    });
+    childrenData.forEach((child, i) => {});
     Categories.getTree([category].concat(childrenData), category.parentCid);
 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/index.js:239:34
     childrenCids = childrenData.map(child => child.cid);
     const hasRead = await Categories.hasReadCategories(childrenCids, uid);
     childrenData.forEach((child, i) => {
-        child['unread-class'] = (child.topic_count === 0 || (hasRead[i] && uid !== 0)) ? '' : 'unread';
+        child['unread-class'] = (child.topic_count === 0 && hasRead[i] && uid !== 0) ? '' : 'unread';
     });
     Categories.getTree([category].concat(childrenData), category.parentCid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:239:34
     childrenCids = childrenData.map(child => child.cid);
     const hasRead = await Categories.hasReadCategories(childrenCids, uid);
     childrenData.forEach((child, i) => {
-        child['unread-class'] = (child.topic_count === 0 || (hasRead[i] && uid !== 0)) ? '' : 'unread';
+        child['unread-class'] = (false) ? '' : 'unread';
     });
     Categories.getTree([category].concat(childrenData), category.parentCid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/index.js:241:24
     childrenData.forEach((child, i) => {
         child['unread-class'] = (child.topic_count === 0 || (hasRead[i] && uid !== 0)) ? '' : 'unread';
     });
-    Categories.getTree([category].concat(childrenData), category.parentCid);
+    Categories.getTree([].concat(childrenData), category.parentCid);
 }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:246:56
 
 Categories.getChildrenTree = getChildrenTree;
 
-Categories.getParentCids = async function (currentCid) {
-    let cid = currentCid;
-    const parents = [];
-    while (parseInt(cid, 10)) {
-        // eslint-disable-next-line
-        cid = await Categories.getCategoryField(cid, 'parentCid');
-        if (cid) {
-            parents.unshift(cid);
-        }
-    }
-    return parents;
-};
+Categories.getParentCids = async function (currentCid) {};
 
 Categories.getChildrenCids = async function (rootCid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:249:31
 Categories.getParentCids = async function (currentCid) {
     let cid = currentCid;
     const parents = [];
-    while (parseInt(cid, 10)) {
-        // eslint-disable-next-line
-        cid = await Categories.getCategoryField(cid, 'parentCid');
-        if (cid) {
-            parents.unshift(cid);
-        }
-    }
+    while (parseInt(cid, 10)) {}
     return parents;
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:249:12
 Categories.getParentCids = async function (currentCid) {
     let cid = currentCid;
     const parents = [];
-    while (parseInt(cid, 10)) {
+    while (false) {
         // eslint-disable-next-line
         cid = await Categories.getCategoryField(cid, 'parentCid');
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/index.js:251:54
     const parents = [];
     while (parseInt(cid, 10)) {
         // eslint-disable-next-line
-        cid = await Categories.getCategoryField(cid, 'parentCid');
+        cid = await Categories.getCategoryField(cid, "");
         if (cid) {
             parents.unshift(cid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:252:13
     while (parseInt(cid, 10)) {
         // eslint-disable-next-line
         cid = await Categories.getCategoryField(cid, 'parentCid');
-        if (cid) {
+        if (true) {
             parents.unshift(cid);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:252:13
     while (parseInt(cid, 10)) {
         // eslint-disable-next-line
         cid = await Categories.getCategoryField(cid, 'parentCid');
-        if (cid) {
+        if (false) {
             parents.unshift(cid);
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/categories/index.js:259:55
     return parents;
 };
 
-Categories.getChildrenCids = async function (rootCid) {
-    let allCids = [];
-    async function recursive(keys) {
-        let childrenCids = await db.getSortedSetRange(keys, 0, -1);
-
-        childrenCids = childrenCids.filter(cid => !allCids.includes(parseInt(cid, 10)));
-        if (!childrenCids.length) {
-            return;
-        }
-        keys = childrenCids.map(cid => `cid:${cid}:children`);
-        childrenCids.forEach(cid => allCids.push(parseInt(cid, 10)));
-        await recursive(keys);
-    }
-    const key = `cid:${rootCid}:children`;
-    const cacheKey = `${key}:all`;
-    const childrenCids = cache.get(cacheKey);
-    if (childrenCids) {
-        return childrenCids.slice();
-    }
-
-    await recursive(key);
-    allCids = _.uniq(allCids);
-    cache.set(cacheKey, allCids);
-    return allCids.slice();
-};
+Categories.getChildrenCids = async function (rootCid) {};
 
 Categories.flattenCategories = function (allCategories, categoryData) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/index.js:260:19
 };
 
 Categories.getChildrenCids = async function (rootCid) {
-    let allCids = [];
+    let allCids = ["Stryker was here"];
     async function recursive(keys) {
         let childrenCids = await db.getSortedSetRange(keys, 0, -1);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:261:36
 
 Categories.getChildrenCids = async function (rootCid) {
     let allCids = [];
-    async function recursive(keys) {
-        let childrenCids = await db.getSortedSetRange(keys, 0, -1);
-
-        childrenCids = childrenCids.filter(cid => !allCids.includes(parseInt(cid, 10)));
-        if (!childrenCids.length) {
-            return;
-        }
-        keys = childrenCids.map(cid => `cid:${cid}:children`);
-        childrenCids.forEach(cid => allCids.push(parseInt(cid, 10)));
-        await recursive(keys);
-    }
+    async function recursive(keys) {}
     const key = `cid:${rootCid}:children`;
     const cacheKey = `${key}:all`;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/categories/index.js:262:64
 Categories.getChildrenCids = async function (rootCid) {
     let allCids = [];
     async function recursive(keys) {
-        let childrenCids = await db.getSortedSetRange(keys, 0, -1);
+        let childrenCids = await db.getSortedSetRange(keys, 0, +1);
 
         childrenCids = childrenCids.filter(cid => !allCids.includes(parseInt(cid, 10)));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
