[Killed] BlockStatement
src/categories/watch.js:13:55
         watching: 3,
     };
 
-    Categories.isIgnored = async function (cids, uid) {
-        if (!(parseInt(uid, 10) > 0)) {
-            return cids.map(() => false);
-        }
-        const states = await Categories.getWatchState(cids, uid);
-        return states.map(state => state === Categories.watchStates.ignoring);
-    };
+    Categories.isIgnored = async function (cids, uid) {};
 
     Categories.getWatchState = async function (cids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/watch.js:14:15
     };
 
     Categories.isIgnored = async function (cids, uid) {
-        if (!(parseInt(uid, 10) > 0)) {
+        if (!(true)) {
             return cids.map(() => false);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/watch.js:14:15
     };
 
     Categories.isIgnored = async function (cids, uid) {
-        if (!(parseInt(uid, 10) > 0)) {
+        if (!(false)) {
             return cids.map(() => false);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/watch.js:15:29
 
     Categories.isIgnored = async function (cids, uid) {
         if (!(parseInt(uid, 10) > 0)) {
-            return cids.map(() => false);
+            return cids.map(() => undefined);
         }
         const states = await Categories.getWatchState(cids, uid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/watch.js:15:35
 
     Categories.isIgnored = async function (cids, uid) {
         if (!(parseInt(uid, 10) > 0)) {
-            return cids.map(() => false);
+            return cids.map(() => true);
         }
         const states = await Categories.getWatchState(cids, uid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/watch.js:18:36
             return cids.map(() => false);
         }
         const states = await Categories.getWatchState(cids, uid);
-        return states.map(state => state === Categories.watchStates.ignoring);
+        return states.map(state => false);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/watch.js:18:27
             return cids.map(() => false);
         }
         const states = await Categories.getWatchState(cids, uid);
-        return states.map(state => state === Categories.watchStates.ignoring);
+        return states.map(() => undefined);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/watch.js:21:59
         return states.map(state => state === Categories.watchStates.ignoring);
     };
 
-    Categories.getWatchState = async function (cids, uid) {
-        if (!(parseInt(uid, 10) > 0)) {
-            return cids.map(() => Categories.watchStates.notwatching);
-        }
-        if (!Array.isArray(cids) || !cids.length) {
-            return [];
-        }
-        const keys = cids.map(cid => `cid:${cid}:uid:watch:state`);
-        const [userSettings, states] = await Promise.all([
-            user.getSettings(uid),
-            db.sortedSetsScore(keys, uid),
-        ]);
-        return states.map(state => state || Categories.watchStates[userSettings.categoryWatchState]);
-    };
+    Categories.getWatchState = async function (cids, uid) {};
 
     Categories.getIgnorers = async function (cid, start, stop) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/watch.js:22:13
     };
 
     Categories.getWatchState = async function (cids, uid) {
-        if (!(parseInt(uid, 10) > 0)) {
+        if (false) {
             return cids.map(() => Categories.watchStates.notwatching);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/watch.js:22:15
     };
 
     Categories.getWatchState = async function (cids, uid) {
-        if (!(parseInt(uid, 10) > 0)) {
+        if (!(true)) {
             return cids.map(() => Categories.watchStates.notwatching);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/watch.js:23:29
 
     Categories.getWatchState = async function (cids, uid) {
         if (!(parseInt(uid, 10) > 0)) {
-            return cids.map(() => Categories.watchStates.notwatching);
+            return cids.map(() => undefined);
         }
         if (!Array.isArray(cids) || !cids.length) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/watch.js:25:13
         if (!(parseInt(uid, 10) > 0)) {
             return cids.map(() => Categories.watchStates.notwatching);
         }
-        if (!Array.isArray(cids) || !cids.length) {
+        if (false) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/watch.js:25:13
         if (!(parseInt(uid, 10) > 0)) {
             return cids.map(() => Categories.watchStates.notwatching);
         }
-        if (!Array.isArray(cids) || !cids.length) {
+        if (true) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/watch.js:28:31
         if (!Array.isArray(cids) || !cids.length) {
             return [];
         }
-        const keys = cids.map(cid => `cid:${cid}:uid:watch:state`);
+        const keys = cids.map(() => undefined);
         const [userSettings, states] = await Promise.all([
             user.getSettings(uid),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/watch.js:33:27
             user.getSettings(uid),
             db.sortedSetsScore(keys, uid),
         ]);
-        return states.map(state => state || Categories.watchStates[userSettings.categoryWatchState]);
+        return states.map(() => undefined);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/watch.js:33:36
             user.getSettings(uid),
             db.sortedSetsScore(keys, uid),
         ]);
-        return states.map(state => state || Categories.watchStates[userSettings.categoryWatchState]);
+        return states.map(state => state && Categories.watchStates[userSettings.categoryWatchState]);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/watch.js:36:64
         return states.map(state => state || Categories.watchStates[userSettings.categoryWatchState]);
     };
 
-    Categories.getIgnorers = async function (cid, start, stop) {
-        const count = (stop === -1) ? -1 : (stop - start + 1);
-        return await db.getSortedSetRevRangeByScore(`cid:${cid}:uid:watch:state`, start, count, Categories.watchStates.ignoring, Categories.watchStates.ignoring);
-    };
+    Categories.getIgnorers = async function (cid, start, stop) {};
 
     Categories.filterIgnoringUids = async function (cid, uids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/watch.js:37:24
     };
 
     Categories.getIgnorers = async function (cid, start, stop) {
-        const count = (stop === -1) ? -1 : (stop - start + 1);
+        const count = (false) ? -1 : (stop - start + 1);
         return await db.getSortedSetRevRangeByScore(`cid:${cid}:uid:watch:state`, start, count, Categories.watchStates.ignoring, Categories.watchStates.ignoring);
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/categories/watch.js:37:39
     };
 
     Categories.getIgnorers = async function (cid, start, stop) {
-        const count = (stop === -1) ? -1 : (stop - start + 1);
+        const count = (stop === -1) ? +1 : (stop - start + 1);
         return await db.getSortedSetRevRangeByScore(`cid:${cid}:uid:watch:state`, start, count, Categories.watchStates.ignoring, Categories.watchStates.ignoring);
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BlockStatement
src/categories/watch.js:41:64
         return await db.getSortedSetRevRangeByScore(`cid:${cid}:uid:watch:state`, start, count, Categories.watchStates.ignoring, Categories.watchStates.ignoring);
     };
 
-    Categories.filterIgnoringUids = async function (cid, uids) {
-        const states = await Categories.getUidsWatchStates(cid, uids);
-        const readingUids = uids.filter((uid, index) => uid && states[index] !== Categories.watchStates.ignoring);
-        return readingUids;
-    };
+    Categories.filterIgnoringUids = async function (cid, uids) {};
 
     Categories.getUidsWatchStates = async function (cid, uids) {

[NoCoverage] MethodExpression
src/categories/watch.js:43:29
 
     Categories.filterIgnoringUids = async function (cid, uids) {
         const states = await Categories.getUidsWatchStates(cid, uids);
-        const readingUids = uids.filter((uid, index) => uid && states[index] !== Categories.watchStates.ignoring);
+        const readingUids = uids;
         return readingUids;
     };

[NoCoverage] ArrowFunction
src/categories/watch.js:43:41
 
     Categories.filterIgnoringUids = async function (cid, uids) {
         const states = await Categories.getUidsWatchStates(cid, uids);
-        const readingUids = uids.filter((uid, index) => uid && states[index] !== Categories.watchStates.ignoring);
+        const readingUids = uids.filter(() => undefined);
         return readingUids;
     };

[Killed] BlockStatement
src/categories/watch.js:47:64
         return readingUids;
     };
 
-    Categories.getUidsWatchStates = async function (cid, uids) {
-        const [userSettings, states] = await Promise.all([
-            user.getMultipleUserSettings(uids),
-            db.sortedSetScores(`cid:${cid}:uid:watch:state`, uids),
-        ]);
-        return states.map((state, index) => state || Categories.watchStates[userSettings[index].categoryWatchState]);
-    };
+    Categories.getUidsWatchStates = async function (cid, uids) {};
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/watch.js:52:45
             user.getMultipleUserSettings(uids),
             db.sortedSetScores(`cid:${cid}:uid:watch:state`, uids),
         ]);
-        return states.map((state, index) => state || Categories.watchStates[userSettings[index].categoryWatchState]);
+        return states.map((state, index) => true);
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/watch.js:52:45
             user.getMultipleUserSettings(uids),
             db.sortedSetScores(`cid:${cid}:uid:watch:state`, uids),
         ]);
-        return states.map((state, index) => state || Categories.watchStates[userSettings[index].categoryWatchState]);
+        return states.map((state, index) => false);
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
