[Killed] BooleanLiteral
src/categories/index.js:264:51
     async function recursive(keys) {
         let childrenCids = await db.getSortedSetRange(keys, 0, -1);
 
-        childrenCids = childrenCids.filter(cid => !allCids.includes(parseInt(cid, 10)));
+        childrenCids = childrenCids.filter(cid => allCids.includes(parseInt(cid, 10)));
         if (!childrenCids.length) {
             return;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/index.js:264:24
     async function recursive(keys) {
         let childrenCids = await db.getSortedSetRange(keys, 0, -1);
 
-        childrenCids = childrenCids.filter(cid => !allCids.includes(parseInt(cid, 10)));
+        childrenCids = childrenCids;
         if (!childrenCids.length) {
             return;
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/index.js:265:13
         let childrenCids = await db.getSortedSetRange(keys, 0, -1);
 
         childrenCids = childrenCids.filter(cid => !allCids.includes(parseInt(cid, 10)));
-        if (!childrenCids.length) {
+        if (false) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:265:35
         let childrenCids = await db.getSortedSetRange(keys, 0, -1);
 
         childrenCids = childrenCids.filter(cid => !allCids.includes(parseInt(cid, 10)));
-        if (!childrenCids.length) {
-            return;
-        }
+        if (!childrenCids.length) {}
         keys = childrenCids.map(cid => `cid:${cid}:children`);
         childrenCids.forEach(cid => allCids.push(parseInt(cid, 10)));
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/categories/index.js:268:33
         if (!childrenCids.length) {
             return;
         }
-        keys = childrenCids.map(cid => `cid:${cid}:children`);
+        keys = childrenCids.map(() => undefined);
         childrenCids.forEach(cid => allCids.push(parseInt(cid, 10)));
         await recursive(keys);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:269:30
             return;
         }
         keys = childrenCids.map(cid => `cid:${cid}:children`);
-        childrenCids.forEach(cid => allCids.push(parseInt(cid, 10)));
+        childrenCids.forEach(() => undefined);
         await recursive(keys);
     }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/categories/index.js:272:17
         childrenCids.forEach(cid => allCids.push(parseInt(cid, 10)));
         await recursive(keys);
     }
-    const key = `cid:${rootCid}:children`;
+    const key = ``;
     const cacheKey = `${key}:all`;
     const childrenCids = cache.get(cacheKey);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:275:9
     const key = `cid:${rootCid}:children`;
     const cacheKey = `${key}:all`;
     const childrenCids = cache.get(cacheKey);
-    if (childrenCids) {
+    if (true) {
         return childrenCids.slice();
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:275:9
     const key = `cid:${rootCid}:children`;
     const cacheKey = `${key}:all`;
     const childrenCids = cache.get(cacheKey);
-    if (childrenCids) {
+    if (false) {
         return childrenCids.slice();
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/index.js:276:16
     const cacheKey = `${key}:all`;
     const childrenCids = cache.get(cacheKey);
     if (childrenCids) {
-        return childrenCids.slice();
+        return childrenCids;
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/index.js:282:12
     await recursive(key);
     allCids = _.uniq(allCids);
     cache.set(cacheKey, allCids);
-    return allCids.slice();
+    return allCids;
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BlockStatement
src/categories/index.js:285:71
     return allCids.slice();
 };
 
-Categories.flattenCategories = function (allCategories, categoryData) {
-    categoryData.forEach((category) => {
-        if (category) {
-            allCategories.push(category);
-
-            if (Array.isArray(category.children) && category.children.length) {
-                Categories.flattenCategories(allCategories, category.children);
-            }
-        }
-    });
-};
+Categories.flattenCategories = function (allCategories, categoryData) {};
 
 /**

[NoCoverage] BlockStatement
src/categories/index.js:286:40
 };
 
 Categories.flattenCategories = function (allCategories, categoryData) {
-    categoryData.forEach((category) => {
-        if (category) {
-            allCategories.push(category);
-
-            if (Array.isArray(category.children) && category.children.length) {
-                Categories.flattenCategories(allCategories, category.children);
-            }
-        }
-    });
+    categoryData.forEach((category) => {});
 };
 

[NoCoverage] ConditionalExpression
src/categories/index.js:287:13
 
 Categories.flattenCategories = function (allCategories, categoryData) {
     categoryData.forEach((category) => {
-        if (category) {
+        if (false) {
             allCategories.push(category);
 

[NoCoverage] BlockStatement
src/categories/index.js:287:23
 
 Categories.flattenCategories = function (allCategories, categoryData) {
     categoryData.forEach((category) => {
-        if (category) {
-            allCategories.push(category);
-
-            if (Array.isArray(category.children) && category.children.length) {
-                Categories.flattenCategories(allCategories, category.children);
-            }
-        }
+        if (category) {}
     });
 };

[NoCoverage] ConditionalExpression
src/categories/index.js:290:17
         if (category) {
             allCategories.push(category);
 
-            if (Array.isArray(category.children) && category.children.length) {
+            if (true) {
                 Categories.flattenCategories(allCategories, category.children);
             }

[NoCoverage] LogicalOperator
src/categories/index.js:290:17
         if (category) {
             allCategories.push(category);
 
-            if (Array.isArray(category.children) && category.children.length) {
+            if (Array.isArray(category.children) || category.children.length) {
                 Categories.flattenCategories(allCategories, category.children);
             }

[Killed] ConditionalExpression
src/categories/index.js:304:17
  * @param parentCid {number} start from 0 to build full tree
  */
 Categories.getTree = function (categories, parentCid) {
-    parentCid = parentCid || 0;
+    parentCid = true;
     const cids = categories.map(category => category && category.cid);
     const cidToCategory = {};
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] LogicalOperator
src/categories/index.js:304:17
  * @param parentCid {number} start from 0 to build full tree
  */
 Categories.getTree = function (categories, parentCid) {
-    parentCid = parentCid || 0;
+    parentCid = parentCid && 0;
     const cids = categories.map(category => category && category.cid);
     const cidToCategory = {};
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:305:45
  */
 Categories.getTree = function (categories, parentCid) {
     parentCid = parentCid || 0;
-    const cids = categories.map(category => category && category.cid);
+    const cids = categories.map(category => true);
     const cidToCategory = {};
     const parents = {};
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:305:45
  */
 Categories.getTree = function (categories, parentCid) {
     parentCid = parentCid || 0;
-    const cids = categories.map(category => category && category.cid);
+    const cids = categories.map(category => false);
     const cidToCategory = {};
     const parents = {};
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:308:34
     const cids = categories.map(category => category && category.cid);
     const cidToCategory = {};
     const parents = {};
-    cids.forEach((cid, index) => {
-        if (cid) {
-            categories[index].children = undefined;
-            cidToCategory[cid] = categories[index];
-            parents[cid] = { ...categories[index] };
-        }
-    });
+    cids.forEach((cid, index) => {});
 
     const tree = [];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:309:13
     const cidToCategory = {};
     const parents = {};
     cids.forEach((cid, index) => {
-        if (cid) {
+        if (false) {
             categories[index].children = undefined;
             cidToCategory[cid] = categories[index];
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/index.js:309:13
     const cidToCategory = {};
     const parents = {};
     cids.forEach((cid, index) => {
-        if (cid) {
+        if (true) {
             categories[index].children = undefined;
             cidToCategory[cid] = categories[index];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:318:38
 
     const tree = [];
 
-    categories.forEach((category) => {
-        if (category) {
-            category.children = category.children || [];
-            if (!category.cid) {
-                return;
-            }
-            if (!category.hasOwnProperty('parentCid') || category.parentCid === null) {
-                category.parentCid = 0;
-            }
-            if (category.parentCid === parentCid) {
-                tree.push(category);
-                category.parent = parents[parentCid];
-            } else {
-                const parent = cidToCategory[category.parentCid];
-                if (parent && parent.cid !== category.cid) {
-                    category.parent = parents[category.parentCid];
-                    parent.children = parent.children || [];
-                    parent.children.push(category);
-                }
-            }
-        }
-    });
+    categories.forEach((category) => {});
     function sortTree(tree) {
         tree.sort((a, b) => {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:319:13
     const tree = [];
 
     categories.forEach((category) => {
-        if (category) {
+        if (true) {
             category.children = category.children || [];
             if (!category.cid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:319:13
     const tree = [];
 
     categories.forEach((category) => {
-        if (category) {
+        if (false) {
             category.children = category.children || [];
             if (!category.cid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/index.js:320:33
 
     categories.forEach((category) => {
         if (category) {
-            category.children = category.children || [];
+            category.children = category.children && [];
             if (!category.cid) {
                 return;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:320:33
 
     categories.forEach((category) => {
         if (category) {
-            category.children = category.children || [];
+            category.children = true;
             if (!category.cid) {
                 return;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:321:17
     categories.forEach((category) => {
         if (category) {
             category.children = category.children || [];
-            if (!category.cid) {
+            if (false) {
                 return;
             }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/index.js:321:17
     categories.forEach((category) => {
         if (category) {
             category.children = category.children || [];
-            if (!category.cid) {
+            if (true) {
                 return;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:324:58
             if (!category.cid) {
                 return;
             }
-            if (!category.hasOwnProperty('parentCid') || category.parentCid === null) {
+            if (!category.hasOwnProperty('parentCid') || false) {
                 category.parentCid = 0;
             }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] LogicalOperator
src/categories/index.js:324:17
             if (!category.cid) {
                 return;
             }
-            if (!category.hasOwnProperty('parentCid') || category.parentCid === null) {
+            if (!category.hasOwnProperty('parentCid') && category.parentCid === null) {
                 category.parentCid = 0;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:327:17
             if (!category.hasOwnProperty('parentCid') || category.parentCid === null) {
                 category.parentCid = 0;
             }
-            if (category.parentCid === parentCid) {
+            if (false) {
                 tree.push(category);
                 category.parent = parents[parentCid];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:327:17
             if (!category.hasOwnProperty('parentCid') || category.parentCid === null) {
                 category.parentCid = 0;
             }
-            if (category.parentCid === parentCid) {
+            if (true) {
                 tree.push(category);
                 category.parent = parents[parentCid];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:330:20
             if (category.parentCid === parentCid) {
                 tree.push(category);
                 category.parent = parents[parentCid];
-            } else {
-                const parent = cidToCategory[category.parentCid];
-                if (parent && parent.cid !== category.cid) {
-                    category.parent = parents[category.parentCid];
-                    parent.children = parent.children || [];
-                    parent.children.push(category);
-                }
-            }
+            } else {}
         }
     });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/index.js:332:21
                 category.parent = parents[parentCid];
             } else {
                 const parent = cidToCategory[category.parentCid];
-                if (parent && parent.cid !== category.cid) {
+                if (parent || parent.cid !== category.cid) {
                     category.parent = parents[category.parentCid];
                     parent.children = parent.children || [];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:332:60
                 category.parent = parents[parentCid];
             } else {
                 const parent = cidToCategory[category.parentCid];
-                if (parent && parent.cid !== category.cid) {
-                    category.parent = parents[category.parentCid];
-                    parent.children = parent.children || [];
-                    parent.children.push(category);
-                }
+                if (parent && parent.cid !== category.cid) {}
             }
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:334:39
                 const parent = cidToCategory[category.parentCid];
                 if (parent && parent.cid !== category.cid) {
                     category.parent = parents[category.parentCid];
-                    parent.children = parent.children || [];
+                    parent.children = true;
                     parent.children.push(category);
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/index.js:334:39
                 const parent = cidToCategory[category.parentCid];
                 if (parent && parent.cid !== category.cid) {
                     category.parent = parents[category.parentCid];
-                    parent.children = parent.children || [];
+                    parent.children = parent.children && [];
                     parent.children.push(category);
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:340:29
             }
         }
     });
-    function sortTree(tree) {
-        tree.sort((a, b) => {
-            if (a.order !== b.order) {
-                return a.order - b.order;
-            }
-            return a.cid - b.cid;
-        });
-        tree.forEach((category) => {
-            if (category && Array.isArray(category.children)) {
-                sortTree(category.children);
-            }
-        });
-    }
+    function sortTree(tree) {}
     sortTree(tree);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/index.js:341:9
         }
     });
     function sortTree(tree) {
-        tree.sort((a, b) => {
-            if (a.order !== b.order) {
-                return a.order - b.order;
-            }
-            return a.cid - b.cid;
-        });
+        tree;
         tree.forEach((category) => {
             if (category && Array.isArray(category.children)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:341:29
         }
     });
     function sortTree(tree) {
-        tree.sort((a, b) => {
-            if (a.order !== b.order) {
-                return a.order - b.order;
-            }
-            return a.cid - b.cid;
-        });
+        tree.sort((a, b) => {});
         tree.forEach((category) => {
             if (category && Array.isArray(category.children)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:342:17
     });
     function sortTree(tree) {
         tree.sort((a, b) => {
-            if (a.order !== b.order) {
+            if (true) {
                 return a.order - b.order;
             }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/index.js:342:17
     });
     function sortTree(tree) {
         tree.sort((a, b) => {
-            if (a.order !== b.order) {
+            if (false) {
                 return a.order - b.order;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/categories/index.js:343:24
     function sortTree(tree) {
         tree.sort((a, b) => {
             if (a.order !== b.order) {
-                return a.order - b.order;
+                return a.order + b.order;
             }
             return a.cid - b.cid;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ArithmeticOperator
src/categories/index.js:345:20
             if (a.order !== b.order) {
                 return a.order - b.order;
             }
-            return a.cid - b.cid;
+            return a.cid + b.cid;
         });
         tree.forEach((category) => {

[Killed] BlockStatement
src/categories/index.js:347:36
             }
             return a.cid - b.cid;
         });
-        tree.forEach((category) => {
-            if (category && Array.isArray(category.children)) {
-                sortTree(category.children);
-            }
-        });
+        tree.forEach((category) => {});
     }
     sortTree(tree);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:348:17
             return a.cid - b.cid;
         });
         tree.forEach((category) => {
-            if (category && Array.isArray(category.children)) {
+            if (true) {
                 sortTree(category.children);
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:348:63
             return a.cid - b.cid;
         });
         tree.forEach((category) => {
-            if (category && Array.isArray(category.children)) {
-                sortTree(category.children);
-            }
+            if (category && Array.isArray(category.children)) {}
         });
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:355:24
     }
     sortTree(tree);
 
-    categories.forEach(c => calculateTopicPostCount(c));
+    categories.forEach(() => undefined);
     return tree;
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:359:69
     return tree;
 };
 
-Categories.buildForSelect = async function (uid, privilege, fields) {
-    const cids = await Categories.getCidsByPrivilege('categories:cid', uid, privilege);
-    return await getSelectData(cids, fields);
-};
+Categories.buildForSelect = async function (uid, privilege, fields) {};
 
 Categories.buildForSelectAll = async function (fields) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[NoCoverage] BlockStatement
src/categories/index.js:364:56
     return await getSelectData(cids, fields);
 };
 
-Categories.buildForSelectAll = async function (fields) {
-    const cids = await Categories.getAllCidsFromSet('categories:cid');
-    return await getSelectData(cids, fields);
-};
+Categories.buildForSelectAll = async function (fields) {};
 
 async function getSelectData(cids, fields) {

[Killed] BlockStatement
src/categories/index.js:369:44
     return await getSelectData(cids, fields);
 };
 
-async function getSelectData(cids, fields) {
-    const categoryData = await Categories.getCategoriesData(cids);
-    const tree = Categories.getTree(categoryData);
-    return Categories.buildForSelectCategories(tree, fields);
-}
+async function getSelectData(cids, fields) {}
 
 Categories.buildForSelectCategories = function (categories, fields, parentCid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/index.js:376:64
 }
 
 Categories.buildForSelectCategories = function (categories, fields, parentCid) {
-    function recursive(category, categoriesData, level, depth) {
-        const bullet = level ? '&bull; ' : '';
-        category.value = category.cid;
-        category.level = level;
-        category.text = level + bullet + category.name;
-        category.depth = depth;
-        categoriesData.push(category);
-        if (Array.isArray(category.children)) {
-            category.children.forEach(child => recursive(child, categoriesData, `&nbsp;&nbsp;&nbsp;&nbsp;${level}`, depth + 1));
-        }
-    }
+    function recursive(category, categoriesData, level, depth) {}
     parentCid = parentCid || 0;
     const categoriesData = [];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/index.js:377:44
 
 Categories.buildForSelectCategories = function (categories, fields, parentCid) {
     function recursive(category, categoriesData, level, depth) {
-        const bullet = level ? '&bull; ' : '';
+        const bullet = level ? '&bull; ' : "Stryker was here!";
         category.value = category.cid;
         category.level = level;
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArithmeticOperator
src/categories/index.js:380:25
         const bullet = level ? '&bull; ' : '';
         category.value = category.cid;
         category.level = level;
-        category.text = level + bullet + category.name;
+        category.text = level + bullet - category.name;
         category.depth = depth;
         categoriesData.push(category);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/categories/index.js:380:25
         const bullet = level ? '&bull; ' : '';
         category.value = category.cid;
         category.level = level;
-        category.text = level + bullet + category.name;
+        category.text = level - bullet + category.name;
         category.depth = depth;
         categoriesData.push(category);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:383:13
         category.text = level + bullet + category.name;
         category.depth = depth;
         categoriesData.push(category);
-        if (Array.isArray(category.children)) {
+        if (true) {
             category.children.forEach(child => recursive(child, categoriesData, `&nbsp;&nbsp;&nbsp;&nbsp;${level}`, depth + 1));
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:383:13
         category.text = level + bullet + category.name;
         category.depth = depth;
         categoriesData.push(category);
-        if (Array.isArray(category.children)) {
+        if (false) {
             category.children.forEach(child => recursive(child, categoriesData, `&nbsp;&nbsp;&nbsp;&nbsp;${level}`, depth + 1));
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:384:39
         category.depth = depth;
         categoriesData.push(category);
         if (Array.isArray(category.children)) {
-            category.children.forEach(child => recursive(child, categoriesData, `&nbsp;&nbsp;&nbsp;&nbsp;${level}`, depth + 1));
+            category.children.forEach(() => undefined);
         }
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
