[Killed] BlockStatement
src/categories/activeusers.js:8:40
 const posts = require('../posts');
 const db = require('../database');
 
-module.exports = function (Categories) {
-    Categories.getActiveUsers = async function (cids) {
-        if (!Array.isArray(cids)) {
-            cids = [cids];
-        }
-        const pids = await db.getSortedSetRevRange(cids.map(cid => `cid:${cid}:pids`), 0, 24);
-        const postData = await posts.getPostsFields(pids, ['uid']);
-        return _.uniq(postData.map(post => post.uid).filter(uid => uid));
-    };
-};
+module.exports = function (Categories) {};
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/categories/activeusers.js:9:55
 const db = require('../database');
 
 module.exports = function (Categories) {
-    Categories.getActiveUsers = async function (cids) {
-        if (!Array.isArray(cids)) {
-            cids = [cids];
-        }
-        const pids = await db.getSortedSetRevRange(cids.map(cid => `cid:${cid}:pids`), 0, 24);
-        const postData = await posts.getPostsFields(pids, ['uid']);
-        return _.uniq(postData.map(post => post.uid).filter(uid => uid));
-    };
+    Categories.getActiveUsers = async function (cids) {};
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/categories/activeusers.js:10:35
 
 module.exports = function (Categories) {
     Categories.getActiveUsers = async function (cids) {
-        if (!Array.isArray(cids)) {
-            cids = [cids];
-        }
+        if (!Array.isArray(cids)) {}
         const pids = await db.getSortedSetRevRange(cids.map(cid => `cid:${cid}:pids`), 0, 24);
         const postData = await posts.getPostsFields(pids, ['uid']);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/categories/activeusers.js:10:13
 
 module.exports = function (Categories) {
     Categories.getActiveUsers = async function (cids) {
-        if (!Array.isArray(cids)) {
+        if (true) {
             cids = [cids];
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArrowFunction
src/categories/activeusers.js:13:61
         if (!Array.isArray(cids)) {
             cids = [cids];
         }
-        const pids = await db.getSortedSetRevRange(cids.map(cid => `cid:${cid}:pids`), 0, 24);
+        const pids = await db.getSortedSetRevRange(cids.map(() => undefined), 0, 24);
         const postData = await posts.getPostsFields(pids, ['uid']);
         return _.uniq(postData.map(post => post.uid).filter(uid => uid));
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrayDeclaration
src/categories/activeusers.js:14:59
             cids = [cids];
         }
         const pids = await db.getSortedSetRevRange(cids.map(cid => `cid:${cid}:pids`), 0, 24);
-        const postData = await posts.getPostsFields(pids, ['uid']);
+        const postData = await posts.getPostsFields(pids, []);
         return _.uniq(postData.map(post => post.uid).filter(uid => uid));
     };
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] MethodExpression
src/categories/activeusers.js:15:23
         }
         const pids = await db.getSortedSetRevRange(cids.map(cid => `cid:${cid}:pids`), 0, 24);
         const postData = await posts.getPostsFields(pids, ['uid']);
-        return _.uniq(postData.map(post => post.uid).filter(uid => uid));
+        return _.uniq(postData.map(post => post.uid));
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/categories/activeusers.js:15:36
         }
         const pids = await db.getSortedSetRevRange(cids.map(cid => `cid:${cid}:pids`), 0, 24);
         const postData = await posts.getPostsFields(pids, ['uid']);
-        return _.uniq(postData.map(post => post.uid).filter(uid => uid));
+        return _.uniq(postData.map(() => undefined).filter(uid => uid));
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing
