[Killed] StringLiteral
src/categories/data.js:11:25
 const utils = require('../utils');
 
 const intFields = [
-    'cid', 'parentCid', 'disabled', 'isSection', 'order',
+    'cid', 'parentCid', "", 'isSection', 'order',
     'topic_count', 'post_count', 'numRecentReplies',
     'minTags', 'maxTags', 'postQueue', 'subCategoriesPerPage',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/categories/data.js:11:50
 const utils = require('../utils');
 
 const intFields = [
-    'cid', 'parentCid', 'disabled', 'isSection', 'order',
+    'cid', 'parentCid', 'disabled', 'isSection', "",
     'topic_count', 'post_count', 'numRecentReplies',
     'minTags', 'maxTags', 'postQueue', 'subCategoriesPerPage',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/categories/data.js:12:5
 
 const intFields = [
     'cid', 'parentCid', 'disabled', 'isSection', 'order',
-    'topic_count', 'post_count', 'numRecentReplies',
+    "", 'post_count', 'numRecentReplies',
     'minTags', 'maxTags', 'postQueue', 'subCategoriesPerPage',
 ];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/categories/data.js:13:16
 const intFields = [
     'cid', 'parentCid', 'disabled', 'isSection', 'order',
     'topic_count', 'post_count', 'numRecentReplies',
-    'minTags', 'maxTags', 'postQueue', 'subCategoriesPerPage',
+    'minTags', "", 'postQueue', 'subCategoriesPerPage',
 ];
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/categories/data.js:17:68
 ];
 
 module.exports = function (Categories) {
-    Categories.getCategoriesFields = async function (cids, fields) {
-        if (!Array.isArray(cids) || !cids.length) {
-            return [];
-        }
-
-        const keys = cids.map(cid => `category:${cid}`);
-        const categories = await db.getObjects(keys, fields);
-        const result = await plugins.hooks.fire('filter:category.getFields', {
-            cids: cids,
-            categories: categories,
-            fields: fields,
-            keys: keys,
-        });
-        result.categories.forEach(category => modifyCategory(category, fields));
-        return result.categories;
-    };
+    Categories.getCategoriesFields = async function (cids, fields) {};
 
     Categories.getCategoryData = async function (cid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/data.js:18:13
 
 module.exports = function (Categories) {
     Categories.getCategoriesFields = async function (cids, fields) {
-        if (!Array.isArray(cids) || !cids.length) {
+        if (false) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/data.js:18:13
 
 module.exports = function (Categories) {
     Categories.getCategoriesFields = async function (cids, fields) {
-        if (!Array.isArray(cids) || !cids.length) {
+        if (!Array.isArray(cids) && !cids.length) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/data.js:22:31
             return [];
         }
 
-        const keys = cids.map(cid => `category:${cid}`);
+        const keys = cids.map(() => undefined);
         const categories = await db.getObjects(keys, fields);
         const result = await plugins.hooks.fire('filter:category.getFields', {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/data.js:22:38
             return [];
         }
 
-        const keys = cids.map(cid => `category:${cid}`);
+        const keys = cids.map(cid => ``);
         const categories = await db.getObjects(keys, fields);
         const result = await plugins.hooks.fire('filter:category.getFields', {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/data.js:24:49
 
         const keys = cids.map(cid => `category:${cid}`);
         const categories = await db.getObjects(keys, fields);
-        const result = await plugins.hooks.fire('filter:category.getFields', {
+        const result = await plugins.hooks.fire("", {
             cids: cids,
             categories: categories,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/data.js:30:35
             fields: fields,
             keys: keys,
         });
-        result.categories.forEach(category => modifyCategory(category, fields));
+        result.categories.forEach(() => undefined);
         return result.categories;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/data.js:34:55
         return result.categories;
     };
 
-    Categories.getCategoryData = async function (cid) {
-        const categories = await Categories.getCategoriesFields([cid], []);
-        return categories && categories.length ? categories[0] : null;
-    };
+    Categories.getCategoryData = async function (cid) {};
 
     Categories.getCategoriesData = async function (cids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/data.js:36:16
 
     Categories.getCategoryData = async function (cid) {
         const categories = await Categories.getCategoriesFields([cid], []);
-        return categories && categories.length ? categories[0] : null;
+        return false ? categories[0] : null;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/data.js:36:16
 
     Categories.getCategoryData = async function (cid) {
         const categories = await Categories.getCategoriesFields([cid], []);
-        return categories && categories.length ? categories[0] : null;
+        return true ? categories[0] : null;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/data.js:39:58
         return categories && categories.length ? categories[0] : null;
     };
 
-    Categories.getCategoriesData = async function (cids) {
-        return await Categories.getCategoriesFields(cids, []);
-    };
+    Categories.getCategoriesData = async function (cids) {};
 
     Categories.getCategoryField = async function (cid, field) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/data.js:43:63
         return await Categories.getCategoriesFields(cids, []);
     };
 
-    Categories.getCategoryField = async function (cid, field) {
-        const category = await Categories.getCategoryFields(cid, [field]);
-        return category ? category[field] : null;
-    };
+    Categories.getCategoryField = async function (cid, field) {};
 
     Categories.getCategoryFields = async function (cid, fields) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/data.js:48:65
         return category ? category[field] : null;
     };
 
-    Categories.getCategoryFields = async function (cid, fields) {
-        const categories = await Categories.getCategoriesFields([cid], fields);
-        return categories ? categories[0] : null;
-    };
+    Categories.getCategoryFields = async function (cid, fields) {};
 
     Categories.getAllCategoryFields = async function (fields) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/data.js:49:65
     };
 
     Categories.getCategoryFields = async function (cid, fields) {
-        const categories = await Categories.getCategoriesFields([cid], fields);
+        const categories = await Categories.getCategoriesFields([], fields);
         return categories ? categories[0] : null;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/data.js:53:63
         return categories ? categories[0] : null;
     };
 
-    Categories.getAllCategoryFields = async function (fields) {
-        const cids = await Categories.getAllCidsFromSet('categories:cid');
-        return await Categories.getCategoriesFields(cids, fields);
-    };
+    Categories.getAllCategoryFields = async function (fields) {};
 
     Categories.setCategoryField = async function (cid, field, value) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/data.js:58:70
         return await Categories.getCategoriesFields(cids, fields);
     };
 
-    Categories.setCategoryField = async function (cid, field, value) {
-        await db.setObjectField(`category:${cid}`, field, value);
-    };
+    Categories.setCategoryField = async function (cid, field, value) {};
 
     Categories.incrementCategoryFieldBy = async function (cid, field, value) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/data.js:59:33
     };
 
     Categories.setCategoryField = async function (cid, field, value) {
-        await db.setObjectField(`category:${cid}`, field, value);
+        await db.setObjectField(``, field, value);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/data.js:62:78
         await db.setObjectField(`category:${cid}`, field, value);
     };
 
-    Categories.incrementCategoryFieldBy = async function (cid, field, value) {
-        await db.incrObjectFieldBy(`category:${cid}`, field, value);
-    };
+    Categories.incrementCategoryFieldBy = async function (cid, field, value) {};
 };
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/categories/data.js:67:69
     };
 };
 
-function defaultIntField(category, fields, fieldName, defaultField) {
-    if (!fields.length || fields.includes(fieldName)) {
-        const useDefault = !category.hasOwnProperty(fieldName) ||
-            category[fieldName] === null ||
-            category[fieldName] === '' ||
-            !utils.isNumber(category[fieldName]);
-
-        category[fieldName] = useDefault ? meta.config[defaultField] : category[fieldName];
-    }
-}
+function defaultIntField(category, fields, fieldName, defaultField) {}
 
 function modifyCategory(category, fields) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/data.js:68:55
 };
 
 function defaultIntField(category, fields, fieldName, defaultField) {
-    if (!fields.length || fields.includes(fieldName)) {
-        const useDefault = !category.hasOwnProperty(fieldName) ||
-            category[fieldName] === null ||
-            category[fieldName] === '' ||
-            !utils.isNumber(category[fieldName]);
-
-        category[fieldName] = useDefault ? meta.config[defaultField] : category[fieldName];
-    }
+    if (!fields.length || fields.includes(fieldName)) {}
 }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/data.js:68:9
 };
 
 function defaultIntField(category, fields, fieldName, defaultField) {
-    if (!fields.length || fields.includes(fieldName)) {
+    if (true) {
         const useDefault = !category.hasOwnProperty(fieldName) ||
             category[fieldName] === null ||
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] LogicalOperator
src/categories/data.js:69:28
 
 function defaultIntField(category, fields, fieldName, defaultField) {
     if (!fields.length || fields.includes(fieldName)) {
-        const useDefault = !category.hasOwnProperty(fieldName) ||
-            category[fieldName] === null ||
-            category[fieldName] === '' ||
-            !utils.isNumber(category[fieldName]);
+        const useDefault = (!category.hasOwnProperty(fieldName) || category[fieldName] === null || category[fieldName] === '') && !utils.isNumber(category[fieldName]);
 
         category[fieldName] = useDefault ? meta.config[defaultField] : category[fieldName];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/data.js:69:28
 
 function defaultIntField(category, fields, fieldName, defaultField) {
     if (!fields.length || fields.includes(fieldName)) {
-        const useDefault = !category.hasOwnProperty(fieldName) ||
+        const useDefault = category.hasOwnProperty(fieldName) ||
             category[fieldName] === null ||
             category[fieldName] === '' ||
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/data.js:70:13
 function defaultIntField(category, fields, fieldName, defaultField) {
     if (!fields.length || fields.includes(fieldName)) {
         const useDefault = !category.hasOwnProperty(fieldName) ||
-            category[fieldName] === null ||
+            category[fieldName] !== null ||
             category[fieldName] === '' ||
             !utils.isNumber(category[fieldName]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/data.js:70:13
 function defaultIntField(category, fields, fieldName, defaultField) {
     if (!fields.length || fields.includes(fieldName)) {
         const useDefault = !category.hasOwnProperty(fieldName) ||
-            category[fieldName] === null ||
+            false ||
             category[fieldName] === '' ||
             !utils.isNumber(category[fieldName]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/data.js:71:13
     if (!fields.length || fields.includes(fieldName)) {
         const useDefault = !category.hasOwnProperty(fieldName) ||
             category[fieldName] === null ||
-            category[fieldName] === '' ||
+            category[fieldName] !== '' ||
             !utils.isNumber(category[fieldName]);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/data.js:71:13
     if (!fields.length || fields.includes(fieldName)) {
         const useDefault = !category.hasOwnProperty(fieldName) ||
             category[fieldName] === null ||
-            category[fieldName] === '' ||
+            false ||
             !utils.isNumber(category[fieldName]);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/data.js:72:13
         const useDefault = !category.hasOwnProperty(fieldName) ||
             category[fieldName] === null ||
             category[fieldName] === '' ||
-            !utils.isNumber(category[fieldName]);
+            utils.isNumber(category[fieldName]);
 
         category[fieldName] = useDefault ? meta.config[defaultField] : category[fieldName];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/data.js:79:9
 }
 
 function modifyCategory(category, fields) {
-    if (!category) {
+    if (category) {
         return;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/data.js:79:9
 }
 
 function modifyCategory(category, fields) {
-    if (!category) {
+    if (true) {
         return;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/data.js:83:50
         return;
     }
 
-    defaultIntField(category, fields, 'minTags', 'minimumTagsPerTopic');
+    defaultIntField(category, fields, 'minTags', "");
     defaultIntField(category, fields, 'maxTags', 'maximumTagsPerTopic');
     defaultIntField(category, fields, 'postQueue', 'postQueue');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/data.js:85:39
 
     defaultIntField(category, fields, 'minTags', 'minimumTagsPerTopic');
     defaultIntField(category, fields, 'maxTags', 'maximumTagsPerTopic');
-    defaultIntField(category, fields, 'postQueue', 'postQueue');
+    defaultIntField(category, fields, "", 'postQueue');
 
     db.parseIntFields(category, intFields, fields);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/data.js:89:88
 
     db.parseIntFields(category, intFields, fields);
 
-    const escapeFields = ['name', 'color', 'bgColor', 'backgroundImage', 'imageClass', 'class', 'link'];
+    const escapeFields = ['name', 'color', 'bgColor', 'backgroundImage', 'imageClass', "", 'link'];
     escapeFields.forEach((field) => {
         if (category.hasOwnProperty(field)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/data.js:89:44
 
     db.parseIntFields(category, intFields, fields);
 
-    const escapeFields = ['name', 'color', 'bgColor', 'backgroundImage', 'imageClass', 'class', 'link'];
+    const escapeFields = ['name', 'color', "", 'backgroundImage', 'imageClass', 'class', 'link'];
     escapeFields.forEach((field) => {
         if (category.hasOwnProperty(field)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/data.js:90:37
     db.parseIntFields(category, intFields, fields);
 
     const escapeFields = ['name', 'color', 'bgColor', 'backgroundImage', 'imageClass', 'class', 'link'];
-    escapeFields.forEach((field) => {
-        if (category.hasOwnProperty(field)) {
-            category[field] = validator.escape(String(category[field] || ''));
-        }
-    });
+    escapeFields.forEach((field) => {});
 
     if (category.hasOwnProperty('icon')) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/data.js:91:13
 
     const escapeFields = ['name', 'color', 'bgColor', 'backgroundImage', 'imageClass', 'class', 'link'];
     escapeFields.forEach((field) => {
-        if (category.hasOwnProperty(field)) {
+        if (true) {
             category[field] = validator.escape(String(category[field] || ''));
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/data.js:91:13
 
     const escapeFields = ['name', 'color', 'bgColor', 'backgroundImage', 'imageClass', 'class', 'link'];
     escapeFields.forEach((field) => {
-        if (category.hasOwnProperty(field)) {
+        if (false) {
             category[field] = validator.escape(String(category[field] || ''));
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/data.js:92:55
     const escapeFields = ['name', 'color', 'bgColor', 'backgroundImage', 'imageClass', 'class', 'link'];
     escapeFields.forEach((field) => {
         if (category.hasOwnProperty(field)) {
-            category[field] = validator.escape(String(category[field] || ''));
+            category[field] = validator.escape(String(true));
         }
     });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/data.js:92:55
     const escapeFields = ['name', 'color', 'bgColor', 'backgroundImage', 'imageClass', 'class', 'link'];
     escapeFields.forEach((field) => {
         if (category.hasOwnProperty(field)) {
-            category[field] = validator.escape(String(category[field] || ''));
+            category[field] = validator.escape(String(category[field] && ''));
         }
     });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/data.js:96:9
         }
     });
 
-    if (category.hasOwnProperty('icon')) {
+    if (true) {
         category.icon = category.icon || 'hidden';
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/data.js:96:42
         }
     });
 
-    if (category.hasOwnProperty('icon')) {
-        category.icon = category.icon || 'hidden';
-    }
+    if (category.hasOwnProperty('icon')) {}
 
     if (category.hasOwnProperty('post_count')) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/data.js:97:25
     });
 
     if (category.hasOwnProperty('icon')) {
-        category.icon = category.icon || 'hidden';
+        category.icon = category.icon && 'hidden';
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/data.js:97:25
     });
 
     if (category.hasOwnProperty('icon')) {
-        category.icon = category.icon || 'hidden';
+        category.icon = false;
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/data.js:100:48
         category.icon = category.icon || 'hidden';
     }
 
-    if (category.hasOwnProperty('post_count')) {
-        category.totalPostCount = category.post_count;
-    }
+    if (category.hasOwnProperty('post_count')) {}
 
     if (category.hasOwnProperty('topic_count')) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/data.js:100:9
         category.icon = category.icon || 'hidden';
     }
 
-    if (category.hasOwnProperty('post_count')) {
+    if (true) {
         category.totalPostCount = category.post_count;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/data.js:104:9
         category.totalPostCount = category.post_count;
     }
 
-    if (category.hasOwnProperty('topic_count')) {
+    if (false) {
         category.totalTopicCount = category.topic_count;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/data.js:104:49
         category.totalPostCount = category.post_count;
     }
 
-    if (category.hasOwnProperty('topic_count')) {
-        category.totalTopicCount = category.topic_count;
-    }
+    if (category.hasOwnProperty('topic_count')) {}
 
     if (category.description) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/categories/data.js:108:31
         category.totalTopicCount = category.topic_count;
     }
 
-    if (category.description) {
-        category.description = validator.escape(String(category.description));
-        category.descriptionParsed = category.descriptionParsed || category.description;
-    }
+    if (category.description) {}
 }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/data.js:108:9
         category.totalTopicCount = category.topic_count;
     }
 
-    if (category.description) {
+    if (false) {
         category.description = validator.escape(String(category.description));
         category.descriptionParsed = category.descriptionParsed || category.description;
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/data.js:110:38
 
     if (category.description) {
         category.description = validator.escape(String(category.description));
-        category.descriptionParsed = category.descriptionParsed || category.description;
+        category.descriptionParsed = true;
     }
 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/data.js:110:38
 
     if (category.description) {
         category.description = validator.escape(String(category.description));
-        category.descriptionParsed = category.descriptionParsed || category.description;
+        category.descriptionParsed = category.descriptionParsed && category.description;
     }
 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
