[Killed] ArithmeticOperator
src/categories/index.js:384:117
         category.depth = depth;
         categoriesData.push(category);
         if (Array.isArray(category.children)) {
-            category.children.forEach(child => recursive(child, categoriesData, `&nbsp;&nbsp;&nbsp;&nbsp;${level}`, depth + 1));
+            category.children.forEach(child => recursive(child, categoriesData, `&nbsp;&nbsp;&nbsp;&nbsp;${level}`, depth - 1));
         }
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:387:17
             category.children.forEach(child => recursive(child, categoriesData, `&nbsp;&nbsp;&nbsp;&nbsp;${level}`, depth + 1));
         }
     }
-    parentCid = parentCid || 0;
+    parentCid = true;
     const categoriesData = [];
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/index.js:387:17
             category.children.forEach(child => recursive(child, categoriesData, `&nbsp;&nbsp;&nbsp;&nbsp;${level}`, depth + 1));
         }
     }
-    parentCid = parentCid || 0;
+    parentCid = parentCid && 0;
     const categoriesData = [];
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:390:58
     parentCid = parentCid || 0;
     const categoriesData = [];
 
-    const rootCategories = categories.filter(category => category && category.parentCid === parentCid);
+    const rootCategories = categories.filter(category => true);
 
     rootCategories.forEach(category => recursive(category, categoriesData, '', 0));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:390:70
     parentCid = parentCid || 0;
     const categoriesData = [];
 
-    const rootCategories = categories.filter(category => category && category.parentCid === parentCid);
+    const rootCategories = categories.filter(category => category && true);
 
     rootCategories.forEach(category => recursive(category, categoriesData, '', 0));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:392:28
 
     const rootCategories = categories.filter(category => category && category.parentCid === parentCid);
 
-    rootCategories.forEach(category => recursive(category, categoriesData, '', 0));
+    rootCategories.forEach(() => undefined);
 
     const pickFields = [
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/index.js:395:16
     rootCategories.forEach(category => recursive(category, categoriesData, '', 0));
 
     const pickFields = [
-        'cid', 'name', 'level', 'icon', 'parentCid',
+        'cid', "", 'level', 'icon', 'parentCid',
         'color', 'bgColor', 'backgroundImage', 'imageClass',
     ];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/index.js:395:41
     rootCategories.forEach(category => recursive(category, categoriesData, '', 0));
 
     const pickFields = [
-        'cid', 'name', 'level', 'icon', 'parentCid',
+        'cid', 'name', 'level', 'icon', "",
         'color', 'bgColor', 'backgroundImage', 'imageClass',
     ];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:398:14
         'cid', 'name', 'level', 'icon', 'parentCid',
         'color', 'bgColor', 'backgroundImage', 'imageClass',
     ];
-    fields = fields || [];
+    fields = false;
     if (fields.includes('text') && fields.includes('value')) {
         return categoriesData.map(category => _.pick(category, fields));
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/index.js:398:14
         'cid', 'name', 'level', 'icon', 'parentCid',
         'color', 'bgColor', 'backgroundImage', 'imageClass',
     ];
-    fields = fields || [];
+    fields = true;
     if (fields.includes('text') && fields.includes('value')) {
         return categoriesData.map(category => _.pick(category, fields));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:399:9
         'color', 'bgColor', 'backgroundImage', 'imageClass',
     ];
     fields = fields || [];
-    if (fields.includes('text') && fields.includes('value')) {
+    if (true) {
         return categoriesData.map(category => _.pick(category, fields));
     }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/index.js:399:9
         'color', 'bgColor', 'backgroundImage', 'imageClass',
     ];
     fields = fields || [];
-    if (fields.includes('text') && fields.includes('value')) {
+    if (false) {
         return categoriesData.map(category => _.pick(category, fields));
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ArrowFunction
src/categories/index.js:400:35
     ];
     fields = fields || [];
     if (fields.includes('text') && fields.includes('value')) {
-        return categoriesData.map(category => _.pick(category, fields));
+        return categoriesData.map(() => undefined);
     }
     if (fields.length) {

[Killed] ConditionalExpression
src/categories/index.js:402:9
     if (fields.includes('text') && fields.includes('value')) {
         return categoriesData.map(category => _.pick(category, fields));
     }
-    if (fields.length) {
+    if (false) {
         pickFields.push(...fields);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/index.js:402:9
     if (fields.includes('text') && fields.includes('value')) {
         return categoriesData.map(category => _.pick(category, fields));
     }
-    if (fields.length) {
+    if (true) {
         pickFields.push(...fields);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/index.js:406:31
         pickFields.push(...fields);
     }
 
-    return categoriesData.map(category => _.pick(category, pickFields));
+    return categoriesData.map(() => undefined);
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
