[Killed] BlockStatement
src/categories/recentreplies.js:15:74
 const batch = require('../batch');
 
 module.exports = function (Categories) {
-    Categories.getRecentReplies = async function (cid, uid, start, stop) {
-        // backwards compatibility, treat start as count
-        if (stop === undefined && start > 0) {
-            winston.warn('[Categories.getRecentReplies] 3 params deprecated please use Categories.getRecentReplies(cid, uid, start, stop)');
-            stop = start - 1;
-            start = 0;
-        }
-        let pids = await db.getSortedSetRevRange(`cid:${cid}:pids`, start, stop);
-        pids = await privileges.posts.filter('topics:read', pids, uid);
-        return await posts.getPostSummaryByPids(pids, uid, { stripTags: true });
-    };
+    Categories.getRecentReplies = async function (cid, uid, start, stop) {};
 
     Categories.updateRecentTid = async function (cid, tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:17:13
 module.exports = function (Categories) {
     Categories.getRecentReplies = async function (cid, uid, start, stop) {
         // backwards compatibility, treat start as count
-        if (stop === undefined && start > 0) {
+        if (false) {
             winston.warn('[Categories.getRecentReplies] 3 params deprecated please use Categories.getRecentReplies(cid, uid, start, stop)');
             stop = start - 1;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:17:13
 module.exports = function (Categories) {
     Categories.getRecentReplies = async function (cid, uid, start, stop) {
         // backwards compatibility, treat start as count
-        if (stop === undefined && start > 0) {
+        if (true) {
             winston.warn('[Categories.getRecentReplies] 3 params deprecated please use Categories.getRecentReplies(cid, uid, start, stop)');
             stop = start - 1;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ArithmeticOperator
src/categories/recentreplies.js:19:20
         // backwards compatibility, treat start as count
         if (stop === undefined && start > 0) {
             winston.warn('[Categories.getRecentReplies] 3 params deprecated please use Categories.getRecentReplies(cid, uid, start, stop)');
-            stop = start - 1;
+            stop = start + 1;
             start = 0;
         }

[Killed] StringLiteral
src/categories/recentreplies.js:22:50
             stop = start - 1;
             start = 0;
         }
-        let pids = await db.getSortedSetRevRange(`cid:${cid}:pids`, start, stop);
+        let pids = await db.getSortedSetRevRange(``, start, stop);
         pids = await privileges.posts.filter('topics:read', pids, uid);
         return await posts.getPostSummaryByPids(pids, uid, { stripTags: true });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/recentreplies.js:23:22
             start = 0;
         }
         let pids = await db.getSortedSetRevRange(`cid:${cid}:pids`, start, stop);
-        pids = await privileges.posts.filter('topics:read', pids, uid);
+        pids = await privileges.posts;
         return await posts.getPostSummaryByPids(pids, uid, { stripTags: true });
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/recentreplies.js:23:46
             start = 0;
         }
         let pids = await db.getSortedSetRevRange(`cid:${cid}:pids`, start, stop);
-        pids = await privileges.posts.filter('topics:read', pids, uid);
+        pids = await privileges.posts.filter("", pids, uid);
         return await posts.getPostSummaryByPids(pids, uid, { stripTags: true });
     };
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BooleanLiteral
src/categories/recentreplies.js:24:73
         }
         let pids = await db.getSortedSetRevRange(`cid:${cid}:pids`, start, stop);
         pids = await privileges.posts.filter('topics:read', pids, uid);
-        return await posts.getPostSummaryByPids(pids, uid, { stripTags: true });
+        return await posts.getPostSummaryByPids(pids, uid, { stripTags: false });
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:27:60
         return await posts.getPostSummaryByPids(pids, uid, { stripTags: true });
     };
 
-    Categories.updateRecentTid = async function (cid, tid) {
-        const [count, numRecentReplies] = await Promise.all([
-            db.sortedSetCard(`cid:${cid}:recent_tids`),
-            db.getObjectField(`category:${cid}`, 'numRecentReplies'),
-        ]);
-
-        if (count >= numRecentReplies) {
-            const data = await db.getSortedSetRangeWithScores(`cid:${cid}:recent_tids`, 0, count - numRecentReplies);
-            const shouldRemove = !(data.length === 1 && count === 1 && data[0].value === String(tid));
-            if (data.length && shouldRemove) {
-                await db.sortedSetsRemoveRangeByScore([`cid:${cid}:recent_tids`], '-inf', data[data.length - 1].score);
-            }
-        }
-        if (numRecentReplies > 0) {
-            await db.sortedSetAdd(`cid:${cid}:recent_tids`, Date.now(), tid);
-        }
-        await plugins.hooks.fire('action:categories.updateRecentTid', { cid: cid, tid: tid });
-    };
+    Categories.updateRecentTid = async function (cid, tid) {};
 
     Categories.updateRecentTidForCid = async function (cid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:33:40
             db.getObjectField(`category:${cid}`, 'numRecentReplies'),
         ]);
 
-        if (count >= numRecentReplies) {
-            const data = await db.getSortedSetRangeWithScores(`cid:${cid}:recent_tids`, 0, count - numRecentReplies);
-            const shouldRemove = !(data.length === 1 && count === 1 && data[0].value === String(tid));
-            if (data.length && shouldRemove) {
-                await db.sortedSetsRemoveRangeByScore([`cid:${cid}:recent_tids`], '-inf', data[data.length - 1].score);
-            }
-        }
+        if (count >= numRecentReplies) {}
         if (numRecentReplies > 0) {
             await db.sortedSetAdd(`cid:${cid}:recent_tids`, Date.now(), tid);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] EqualityOperator
src/categories/recentreplies.js:33:13
             db.getObjectField(`category:${cid}`, 'numRecentReplies'),
         ]);
 
-        if (count >= numRecentReplies) {
+        if (count < numRecentReplies) {
             const data = await db.getSortedSetRangeWithScores(`cid:${cid}:recent_tids`, 0, count - numRecentReplies);
             const shouldRemove = !(data.length === 1 && count === 1 && data[0].value === String(tid));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/categories/recentreplies.js:34:92
         ]);
 
         if (count >= numRecentReplies) {
-            const data = await db.getSortedSetRangeWithScores(`cid:${cid}:recent_tids`, 0, count - numRecentReplies);
+            const data = await db.getSortedSetRangeWithScores(`cid:${cid}:recent_tids`, 0, count + numRecentReplies);
             const shouldRemove = !(data.length === 1 && count === 1 && data[0].value === String(tid));
             if (data.length && shouldRemove) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:35:72
 
         if (count >= numRecentReplies) {
             const data = await db.getSortedSetRangeWithScores(`cid:${cid}:recent_tids`, 0, count - numRecentReplies);
-            const shouldRemove = !(data.length === 1 && count === 1 && data[0].value === String(tid));
+            const shouldRemove = !(data.length === 1 && count === 1 && true);
             if (data.length && shouldRemove) {
                 await db.sortedSetsRemoveRangeByScore([`cid:${cid}:recent_tids`], '-inf', data[data.length - 1].score);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] EqualityOperator
src/categories/recentreplies.js:35:72
 
         if (count >= numRecentReplies) {
             const data = await db.getSortedSetRangeWithScores(`cid:${cid}:recent_tids`, 0, count - numRecentReplies);
-            const shouldRemove = !(data.length === 1 && count === 1 && data[0].value === String(tid));
+            const shouldRemove = !(data.length === 1 && count === 1 && data[0].value !== String(tid));
             if (data.length && shouldRemove) {
                 await db.sortedSetsRemoveRangeByScore([`cid:${cid}:recent_tids`], '-inf', data[data.length - 1].score);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:36:17
         if (count >= numRecentReplies) {
             const data = await db.getSortedSetRangeWithScores(`cid:${cid}:recent_tids`, 0, count - numRecentReplies);
             const shouldRemove = !(data.length === 1 && count === 1 && data[0].value === String(tid));
-            if (data.length && shouldRemove) {
+            if (false) {
                 await db.sortedSetsRemoveRangeByScore([`cid:${cid}:recent_tids`], '-inf', data[data.length - 1].score);
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:36:17
         if (count >= numRecentReplies) {
             const data = await db.getSortedSetRangeWithScores(`cid:${cid}:recent_tids`, 0, count - numRecentReplies);
             const shouldRemove = !(data.length === 1 && count === 1 && data[0].value === String(tid));
-            if (data.length && shouldRemove) {
+            if (true) {
                 await db.sortedSetsRemoveRangeByScore([`cid:${cid}:recent_tids`], '-inf', data[data.length - 1].score);
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/categories/recentreplies.js:37:96
             const data = await db.getSortedSetRangeWithScores(`cid:${cid}:recent_tids`, 0, count - numRecentReplies);
             const shouldRemove = !(data.length === 1 && count === 1 && data[0].value === String(tid));
             if (data.length && shouldRemove) {
-                await db.sortedSetsRemoveRangeByScore([`cid:${cid}:recent_tids`], '-inf', data[data.length - 1].score);
+                await db.sortedSetsRemoveRangeByScore([`cid:${cid}:recent_tids`], '-inf', data[data.length + 1].score);
             }
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/recentreplies.js:37:56
             const data = await db.getSortedSetRangeWithScores(`cid:${cid}:recent_tids`, 0, count - numRecentReplies);
             const shouldRemove = !(data.length === 1 && count === 1 && data[0].value === String(tid));
             if (data.length && shouldRemove) {
-                await db.sortedSetsRemoveRangeByScore([`cid:${cid}:recent_tids`], '-inf', data[data.length - 1].score);
+                await db.sortedSetsRemoveRangeByScore([``], '-inf', data[data.length - 1].score);
             }
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/recentreplies.js:40:13
                 await db.sortedSetsRemoveRangeByScore([`cid:${cid}:recent_tids`], '-inf', data[data.length - 1].score);
             }
         }
-        if (numRecentReplies > 0) {
+        if (true) {
             await db.sortedSetAdd(`cid:${cid}:recent_tids`, Date.now(), tid);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/recentreplies.js:40:13
                 await db.sortedSetsRemoveRangeByScore([`cid:${cid}:recent_tids`], '-inf', data[data.length - 1].score);
             }
         }
-        if (numRecentReplies > 0) {
+        if (numRecentReplies <= 0) {
             await db.sortedSetAdd(`cid:${cid}:recent_tids`, Date.now(), tid);
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/categories/recentreplies.js:46:61
         await plugins.hooks.fire('action:categories.updateRecentTid', { cid: cid, tid: tid });
     };
 
-    Categories.updateRecentTidForCid = async function (cid) {
-        let postData;
-        let topicData;
-        let index = 0;
-        do {
-            /* eslint-disable no-await-in-loop */
-            const pids = await db.getSortedSetRevRange(`cid:${cid}:pids`, index, index);
-            if (!pids.length) {
-                return;
-            }
-            postData = await posts.getPostFields(pids[0], ['tid', 'deleted']);
-
-            if (postData && postData.tid && !postData.deleted) {
-                topicData = await topics.getTopicData(postData.tid);
-            }
-            index += 1;
-        } while (!topicData || topicData.deleted || topicData.scheduled);
-
-        if (postData && postData.tid) {
-            await Categories.updateRecentTid(cid, postData.tid);
-        }
-    };
+    Categories.updateRecentTidForCid = async function (cid) {};
 
     Categories.getRecentTopicReplies = async function (categoryData, uid, query) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:50:12
         let postData;
         let topicData;
         let index = 0;
-        do {
-            /* eslint-disable no-await-in-loop */
-            const pids = await db.getSortedSetRevRange(`cid:${cid}:pids`, index, index);
-            if (!pids.length) {
-                return;
-            }
-            postData = await posts.getPostFields(pids[0], ['tid', 'deleted']);
-
-            if (postData && postData.tid && !postData.deleted) {
-                topicData = await topics.getTopicData(postData.tid);
-            }
-            index += 1;
-        } while (!topicData || topicData.deleted || topicData.scheduled);
+        do {} while (!topicData || topicData.deleted || topicData.scheduled);
 
         if (postData && postData.tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/recentreplies.js:53:17
         do {
             /* eslint-disable no-await-in-loop */
             const pids = await db.getSortedSetRevRange(`cid:${cid}:pids`, index, index);
-            if (!pids.length) {
+            if (pids.length) {
                 return;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:53:31
         do {
             /* eslint-disable no-await-in-loop */
             const pids = await db.getSortedSetRevRange(`cid:${cid}:pids`, index, index);
-            if (!pids.length) {
-                return;
-            }
+            if (!pids.length) {}
             postData = await posts.getPostFields(pids[0], ['tid', 'deleted']);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/recentreplies.js:56:67
             if (!pids.length) {
                 return;
             }
-            postData = await posts.getPostFields(pids[0], ['tid', 'deleted']);
+            postData = await posts.getPostFields(pids[0], ['tid', ""]);
 
             if (postData && postData.tid && !postData.deleted) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:58:64
             }
             postData = await posts.getPostFields(pids[0], ['tid', 'deleted']);
 
-            if (postData && postData.tid && !postData.deleted) {
-                topicData = await topics.getTopicData(postData.tid);
-            }
+            if (postData && postData.tid && !postData.deleted) {}
             index += 1;
         } while (!topicData || topicData.deleted || topicData.scheduled);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/recentreplies.js:58:17
             }
             postData = await posts.getPostFields(pids[0], ['tid', 'deleted']);
 
-            if (postData && postData.tid && !postData.deleted) {
+            if (false) {
                 topicData = await topics.getTopicData(postData.tid);
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/recentreplies.js:62:18
                 topicData = await topics.getTopicData(postData.tid);
             }
             index += 1;
-        } while (!topicData || topicData.deleted || topicData.scheduled);
+        } while ((!topicData || topicData.deleted) && topicData.scheduled);
 
         if (postData && postData.tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:62:18
                 topicData = await topics.getTopicData(postData.tid);
             }
             index += 1;
-        } while (!topicData || topicData.deleted || topicData.scheduled);
+        } while (false);
 
         if (postData && postData.tid) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] LogicalOperator
src/categories/recentreplies.js:64:13
             index += 1;
         } while (!topicData || topicData.deleted || topicData.scheduled);
 
-        if (postData && postData.tid) {
+        if (postData || postData.tid) {
             await Categories.updateRecentTid(cid, postData.tid);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:64:13
             index += 1;
         } while (!topicData || topicData.deleted || topicData.scheduled);
 
-        if (postData && postData.tid) {
+        if (false) {
             await Categories.updateRecentTid(cid, postData.tid);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:70:67
     };
 
     Categories.getRecentTopicReplies = async function (categoryData, uid, query) {
-        if (!Array.isArray(categoryData) || !categoryData.length) {
-            return;
-        }
+        if (!Array.isArray(categoryData) || !categoryData.length) {}
         const categoriesToLoad =
             categoryData.filter(c => c && c.numRecentReplies && parseInt(c.numRecentReplies, 10) > 0);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/recentreplies.js:70:13
     };
 
     Categories.getRecentTopicReplies = async function (categoryData, uid, query) {
-        if (!Array.isArray(categoryData) || !categoryData.length) {
+        if (Array.isArray(categoryData) || !categoryData.length) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] LogicalOperator
src/categories/recentreplies.js:74:38
             return;
         }
         const categoriesToLoad =
-            categoryData.filter(c => c && c.numRecentReplies && parseInt(c.numRecentReplies, 10) > 0);
+            categoryData.filter(c => c || c.numRecentReplies && parseInt(c.numRecentReplies, 10) > 0);
         let keys = [];
         if (plugins.hooks.hasListeners('filter:categories.getRecentTopicReplies')) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:74:38
             return;
         }
         const categoriesToLoad =
-            categoryData.filter(c => c && c.numRecentReplies && parseInt(c.numRecentReplies, 10) > 0);
+            categoryData.filter(c => true);
         let keys = [];
         if (plugins.hooks.hasListeners('filter:categories.getRecentTopicReplies')) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/recentreplies.js:75:20
         }
         const categoriesToLoad =
             categoryData.filter(c => c && c.numRecentReplies && parseInt(c.numRecentReplies, 10) > 0);
-        let keys = [];
+        let keys = ["Stryker was here"];
         if (plugins.hooks.hasListeners('filter:categories.getRecentTopicReplies')) {
             const result = await plugins.hooks.fire('filter:categories.getRecentTopicReplies', {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:76:13
         const categoriesToLoad =
             categoryData.filter(c => c && c.numRecentReplies && parseInt(c.numRecentReplies, 10) > 0);
         let keys = [];
-        if (plugins.hooks.hasListeners('filter:categories.getRecentTopicReplies')) {
+        if (false) {
             const result = await plugins.hooks.fire('filter:categories.getRecentTopicReplies', {
                 categories: categoriesToLoad,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:76:13
         const categoriesToLoad =
             categoryData.filter(c => c && c.numRecentReplies && parseInt(c.numRecentReplies, 10) > 0);
         let keys = [];
-        if (plugins.hooks.hasListeners('filter:categories.getRecentTopicReplies')) {
+        if (true) {
             const result = await plugins.hooks.fire('filter:categories.getRecentTopicReplies', {
                 categories: categoriesToLoad,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:84:16
                 keys: [],
             });
             keys = result.keys;
-        } else {
-            keys = categoriesToLoad.map(c => `cid:${c.cid}:recent_tids`);
-        }
+        } else {}
 
         const results = await db.getSortedSetsMembers(keys);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/recentreplies.js:85:41
             });
             keys = result.keys;
         } else {
-            keys = categoriesToLoad.map(c => `cid:${c.cid}:recent_tids`);
+            keys = categoriesToLoad.map(() => undefined);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/recentreplies.js:89:27
         }
 
         const results = await db.getSortedSetsMembers(keys);
-        let tids = _.uniq(_.flatten(results).filter(Boolean));
+        let tids = _.uniq(_.flatten(results));
 
         tids = await privileges.topics.filterTids('topics:read', tids, uid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/recentreplies.js:91:51
         const results = await db.getSortedSetsMembers(keys);
         let tids = _.uniq(_.flatten(results).filter(Boolean));
 
-        tids = await privileges.topics.filterTids('topics:read', tids, uid);
+        tids = await privileges.topics.filterTids("", tids, uid);
         const topics = await getTopics(tids, uid);
         assignTopicsToCategories(categoryData, topics);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/recentreplies.js:101:69
     async function getTopics(tids, uid) {
         const topicData = await topics.getTopicsFields(
             tids,
-            ['tid', 'mainPid', 'slug', 'title', 'teaserPid', 'cid', 'postcount']
+            ['tid', 'mainPid', 'slug', 'title', 'teaserPid', 'cid', ""]
         );
         topicData.forEach((topic) => {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/recentreplies.js:101:13
     async function getTopics(tids, uid) {
         const topicData = await topics.getTopicsFields(
             tids,
-            ['tid', 'mainPid', 'slug', 'title', 'teaserPid', 'cid', 'postcount']
+            []
         );
         topicData.forEach((topic) => {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/categories/recentreplies.js:103:38
             tids,
             ['tid', 'mainPid', 'slug', 'title', 'teaserPid', 'cid', 'postcount']
         );
-        topicData.forEach((topic) => {
-            if (topic) {
-                topic.teaserPid = topic.teaserPid || topic.mainPid;
-            }
-        });
+        topicData.forEach((topic) => {});
         const cids = _.uniq(topicData.map(t => t && t.cid).filter(cid => parseInt(cid, 10)));
         const getToRoot = async () => await Promise.all(cids.map(Categories.getParentCids));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:104:17
             ['tid', 'mainPid', 'slug', 'title', 'teaserPid', 'cid', 'postcount']
         );
         topicData.forEach((topic) => {
-            if (topic) {
+            if (false) {
                 topic.teaserPid = topic.teaserPid || topic.mainPid;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:104:24
             ['tid', 'mainPid', 'slug', 'title', 'teaserPid', 'cid', 'postcount']
         );
         topicData.forEach((topic) => {
-            if (topic) {
-                topic.teaserPid = topic.teaserPid || topic.mainPid;
-            }
+            if (topic) {}
         });
         const cids = _.uniq(topicData.map(t => t && t.cid).filter(cid => parseInt(cid, 10)));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/recentreplies.js:105:35
         );
         topicData.forEach((topic) => {
             if (topic) {
-                topic.teaserPid = topic.teaserPid || topic.mainPid;
+                topic.teaserPid = topic.teaserPid && topic.mainPid;
             }
         });
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/recentreplies.js:105:35
         );
         topicData.forEach((topic) => {
             if (topic) {
-                topic.teaserPid = topic.teaserPid || topic.mainPid;
+                topic.teaserPid = true;
             }
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
