[Killed] LogicalOperator
src/categories/recentreplies.js:108:48
                 topic.teaserPid = topic.teaserPid || topic.mainPid;
             }
         });
-        const cids = _.uniq(topicData.map(t => t && t.cid).filter(cid => parseInt(cid, 10)));
+        const cids = _.uniq(topicData.map(t => t || t.cid).filter(cid => parseInt(cid, 10)));
         const getToRoot = async () => await Promise.all(cids.map(Categories.getParentCids));
         const [toRoot, teasers] = await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/recentreplies.js:108:29
                 topic.teaserPid = topic.teaserPid || topic.mainPid;
             }
         });
-        const cids = _.uniq(topicData.map(t => t && t.cid).filter(cid => parseInt(cid, 10)));
+        const cids = _.uniq(topicData.map(t => t && t.cid));
         const getToRoot = async () => await Promise.all(cids.map(Categories.getParentCids));
         const [toRoot, teasers] = await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/recentreplies.js:109:27
             }
         });
         const cids = _.uniq(topicData.map(t => t && t.cid).filter(cid => parseInt(cid, 10)));
-        const getToRoot = async () => await Promise.all(cids.map(Categories.getParentCids));
+        const getToRoot = () => undefined;
         const [toRoot, teasers] = await Promise.all([
             getToRoot(),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/recentreplies.js:110:53
         });
         const cids = _.uniq(topicData.map(t => t && t.cid).filter(cid => parseInt(cid, 10)));
         const getToRoot = async () => await Promise.all(cids.map(Categories.getParentCids));
-        const [toRoot, teasers] = await Promise.all([
-            getToRoot(),
-            topics.getTeasers(topicData, uid),
-        ]);
+        const [toRoot, teasers] = await Promise.all([]);
         const cidToRoot = _.zipObject(cids, toRoot);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:116:44
         ]);
         const cidToRoot = _.zipObject(cids, toRoot);
 
-        teasers.forEach((teaser, index) => {
-            if (teaser) {
-                teaser.cid = topicData[index].cid;
-                teaser.parentCids = cidToRoot[teaser.cid];
-                teaser.tid = undefined;
-                teaser.uid = undefined;
-                teaser.topic = {
-                    slug: topicData[index].slug,
-                    title: topicData[index].title,
-                };
-            }
-        });
+        teasers.forEach((teaser, index) => {});
         return teasers.filter(Boolean);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:117:17
         const cidToRoot = _.zipObject(cids, toRoot);
 
         teasers.forEach((teaser, index) => {
-            if (teaser) {
+            if (true) {
                 teaser.cid = topicData[index].cid;
                 teaser.parentCids = cidToRoot[teaser.cid];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:117:25
         const cidToRoot = _.zipObject(cids, toRoot);
 
         teasers.forEach((teaser, index) => {
-            if (teaser) {
-                teaser.cid = topicData[index].cid;
-                teaser.parentCids = cidToRoot[teaser.cid];
-                teaser.tid = undefined;
-                teaser.uid = undefined;
-                teaser.topic = {
-                    slug: topicData[index].slug,
-                    title: topicData[index].title,
-                };
-            }
+            if (teaser) {}
         });
         return teasers.filter(Boolean);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/categories/recentreplies.js:122:32
                 teaser.parentCids = cidToRoot[teaser.cid];
                 teaser.tid = undefined;
                 teaser.uid = undefined;
-                teaser.topic = {
-                    slug: topicData[index].slug,
-                    title: topicData[index].title,
-                };
+                teaser.topic = {};
             }
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/recentreplies.js:128:16
                 };
             }
         });
-        return teasers.filter(Boolean);
+        return teasers;
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:131:59
         return teasers.filter(Boolean);
     }
 
-    function assignTopicsToCategories(categories, topics) {
-        categories.forEach((category) => {
-            if (category) {
-                category.posts = topics
-                    .filter(t => t.cid && (t.cid === category.cid || t.parentCids.includes(category.cid)))
-                    .sort((a, b) => b.pid - a.pid)
-                    .slice(0, parseInt(category.numRecentReplies, 10));
-            }
-        });
-        topics.forEach((t) => { t.parentCids = undefined; });
-    }
+    function assignTopicsToCategories(categories, topics) {}
 
     function bubbleUpChildrenPosts(categoryData) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:132:42
     }
 
     function assignTopicsToCategories(categories, topics) {
-        categories.forEach((category) => {
-            if (category) {
-                category.posts = topics
-                    .filter(t => t.cid && (t.cid === category.cid || t.parentCids.includes(category.cid)))
-                    .sort((a, b) => b.pid - a.pid)
-                    .slice(0, parseInt(category.numRecentReplies, 10));
-            }
-        });
+        categories.forEach((category) => {});
         topics.forEach((t) => { t.parentCids = undefined; });
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:133:27
 
     function assignTopicsToCategories(categories, topics) {
         categories.forEach((category) => {
-            if (category) {
-                category.posts = topics
-                    .filter(t => t.cid && (t.cid === category.cid || t.parentCids.includes(category.cid)))
-                    .sort((a, b) => b.pid - a.pid)
-                    .slice(0, parseInt(category.numRecentReplies, 10));
-            }
+            if (category) {}
         });
         topics.forEach((t) => { t.parentCids = undefined; });
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] MethodExpression
src/categories/recentreplies.js:134:34
     function assignTopicsToCategories(categories, topics) {
         categories.forEach((category) => {
             if (category) {
-                category.posts = topics
-                    .filter(t => t.cid && (t.cid === category.cid || t.parentCids.includes(category.cid)))
+                category.posts = topics
                     .sort((a, b) => b.pid - a.pid)
                     .slice(0, parseInt(category.numRecentReplies, 10));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/recentreplies.js:134:34
     function assignTopicsToCategories(categories, topics) {
         categories.forEach((category) => {
             if (category) {
-                category.posts = topics
-                    .filter(t => t.cid && (t.cid === category.cid || t.parentCids.includes(category.cid)))
-                    .sort((a, b) => b.pid - a.pid)
-                    .slice(0, parseInt(category.numRecentReplies, 10));
+                category.posts = topics.filter(t => t.cid && (t.cid === category.cid || t.parentCids.includes(category.cid))).sort((a, b) => b.pid - a.pid);
             }
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/recentreplies.js:135:29
         categories.forEach((category) => {
             if (category) {
                 category.posts = topics
-                    .filter(t => t.cid && (t.cid === category.cid || t.parentCids.includes(category.cid)))
+                    .filter(() => undefined)
                     .sort((a, b) => b.pid - a.pid)
                     .slice(0, parseInt(category.numRecentReplies, 10));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/recentreplies.js:135:44
         categories.forEach((category) => {
             if (category) {
                 category.posts = topics
-                    .filter(t => t.cid && (t.cid === category.cid || t.parentCids.includes(category.cid)))
+                    .filter(t => t.cid && (t.cid === category.cid && t.parentCids.includes(category.cid)))
                     .sort((a, b) => b.pid - a.pid)
                     .slice(0, parseInt(category.numRecentReplies, 10));
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/categories/recentreplies.js:136:27
             if (category) {
                 category.posts = topics
                     .filter(t => t.cid && (t.cid === category.cid || t.parentCids.includes(category.cid)))
-                    .sort((a, b) => b.pid - a.pid)
+                    .sort(() => undefined)
                     .slice(0, parseInt(category.numRecentReplies, 10));
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ArithmeticOperator
src/categories/recentreplies.js:136:37
             if (category) {
                 category.posts = topics
                     .filter(t => t.cid && (t.cid === category.cid || t.parentCids.includes(category.cid)))
-                    .sort((a, b) => b.pid - a.pid)
+                    .sort((a, b) => b.pid + a.pid)
                     .slice(0, parseInt(category.numRecentReplies, 10));
             }

[Killed] BlockStatement
src/categories/recentreplies.js:140:31
                     .slice(0, parseInt(category.numRecentReplies, 10));
             }
         });
-        topics.forEach((t) => { t.parentCids = undefined; });
+        topics.forEach((t) => {});
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:143:50
         topics.forEach((t) => { t.parentCids = undefined; });
     }
 
-    function bubbleUpChildrenPosts(categoryData) {
-        categoryData.forEach((category) => {
-            if (category) {
-                if (category.posts.length) {
-                    return;
-                }
-                const posts = [];
-                getPostsRecursive(category, posts);
-
-                posts.sort((a, b) => b.pid - a.pid);
-                if (posts.length) {
-                    category.posts = [posts[0]];
-                }
-            }
-        });
-    }
+    function bubbleUpChildrenPosts(categoryData) {}
 
     function getPostsRecursive(category, posts) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:144:44
     }
 
     function bubbleUpChildrenPosts(categoryData) {
-        categoryData.forEach((category) => {
-            if (category) {
-                if (category.posts.length) {
-                    return;
-                }
-                const posts = [];
-                getPostsRecursive(category, posts);
-
-                posts.sort((a, b) => b.pid - a.pid);
-                if (posts.length) {
-                    category.posts = [posts[0]];
-                }
-            }
-        });
+        categoryData.forEach((category) => {});
     }
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/categories/recentreplies.js:145:27
 
     function bubbleUpChildrenPosts(categoryData) {
         categoryData.forEach((category) => {
-            if (category) {
-                if (category.posts.length) {
-                    return;
-                }
-                const posts = [];
-                getPostsRecursive(category, posts);
-
-                posts.sort((a, b) => b.pid - a.pid);
-                if (posts.length) {
-                    category.posts = [posts[0]];
-                }
-            }
+            if (category) {}
         });
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:146:21
     function bubbleUpChildrenPosts(categoryData) {
         categoryData.forEach((category) => {
             if (category) {
-                if (category.posts.length) {
+                if (false) {
                     return;
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:146:21
     function bubbleUpChildrenPosts(categoryData) {
         categoryData.forEach((category) => {
             if (category) {
-                if (category.posts.length) {
+                if (true) {
                     return;
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/recentreplies.js:152:17
                 const posts = [];
                 getPostsRecursive(category, posts);
 
-                posts.sort((a, b) => b.pid - a.pid);
+                posts;
                 if (posts.length) {
                     category.posts = [posts[0]];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/recentreplies.js:152:28
                 const posts = [];
                 getPostsRecursive(category, posts);
 
-                posts.sort((a, b) => b.pid - a.pid);
+                posts.sort(() => undefined);
                 if (posts.length) {
                     category.posts = [posts[0]];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:153:21
                 getPostsRecursive(category, posts);
 
                 posts.sort((a, b) => b.pid - a.pid);
-                if (posts.length) {
+                if (false) {
                     category.posts = [posts[0]];
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:153:21
                 getPostsRecursive(category, posts);
 
                 posts.sort((a, b) => b.pid - a.pid);
-                if (posts.length) {
+                if (true) {
                     category.posts = [posts[0]];
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:160:49
         });
     }
 
-    function getPostsRecursive(category, posts) {
-        if (Array.isArray(category.posts)) {
-            category.posts.forEach(p => posts.push(p));
-        }
-
-        category.children.forEach(child => getPostsRecursive(child, posts));
-    }
+    function getPostsRecursive(category, posts) {}
 
     // terrible name, should be topics.moveTopicPosts
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:161:44
     }
 
     function getPostsRecursive(category, posts) {
-        if (Array.isArray(category.posts)) {
-            category.posts.forEach(p => posts.push(p));
-        }
+        if (Array.isArray(category.posts)) {}
 
         category.children.forEach(child => getPostsRecursive(child, posts));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:161:13
     }
 
     function getPostsRecursive(category, posts) {
-        if (Array.isArray(category.posts)) {
+        if (true) {
             category.posts.forEach(p => posts.push(p));
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/recentreplies.js:162:36
 
     function getPostsRecursive(category, posts) {
         if (Array.isArray(category.posts)) {
-            category.posts.forEach(p => posts.push(p));
+            category.posts.forEach(() => undefined);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/recentreplies.js:165:35
             category.posts.forEach(p => posts.push(p));
         }
 
-        category.children.forEach(child => getPostsRecursive(child, posts));
+        category.children.forEach(() => undefined);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/recentreplies.js:171:56
     // terrible name, should be topics.moveTopicPosts
     Categories.moveRecentReplies = async function (tid, oldCid, cid) {
         await updatePostCount(tid, oldCid, cid);
-        const [pids, topicDeleted] = await Promise.all([
-            topics.getPids(tid),
-            topics.getTopicField(tid, 'deleted'),
-        ]);
+        const [pids, topicDeleted] = await Promise.all([]);
 
         await batch.processArray(pids, async (pids) => {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:176:56
             topics.getTopicField(tid, 'deleted'),
         ]);
 
-        await batch.processArray(pids, async (pids) => {
-            const postData = await posts.getPostsFields(pids, ['pid', 'deleted', 'uid', 'timestamp', 'upvotes', 'downvotes']);
-
-            const bulkRemove = [];
-            const bulkAdd = [];
-            postData.forEach((post) => {
-                bulkRemove.push([`cid:${oldCid}:uid:${post.uid}:pids`, post.pid]);
-                bulkRemove.push([`cid:${oldCid}:uid:${post.uid}:pids:votes`, post.pid]);
-                bulkAdd.push([`cid:${cid}:uid:${post.uid}:pids`, post.timestamp, post.pid]);
-                if (post.votes > 0 || post.votes < 0) {
-                    bulkAdd.push([`cid:${cid}:uid:${post.uid}:pids:votes`, post.votes, post.pid]);
-                }
-            });
-
-            const postsToReAdd = postData.filter(p => !p.deleted && !topicDeleted);
-            const timestamps = postsToReAdd.map(p => p && p.timestamp);
-            await Promise.all([
-                db.sortedSetRemove(`cid:${oldCid}:pids`, pids),
-                db.sortedSetAdd(`cid:${cid}:pids`, timestamps, postsToReAdd.map(p => p.pid)),
-                db.sortedSetRemoveBulk(bulkRemove),
-                db.sortedSetAddBulk(bulkAdd),
-            ]);
-        }, { batch: 500 });
+        await batch.processArray(pids, async (pids) => {}, { batch: 500 });
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/recentreplies.js:180:29
             const postData = await posts.getPostsFields(pids, ['pid', 'deleted', 'uid', 'timestamp', 'upvotes', 'downvotes']);
 
             const bulkRemove = [];
-            const bulkAdd = [];
+            const bulkAdd = ["Stryker was here"];
             postData.forEach((post) => {
                 bulkRemove.push([`cid:${oldCid}:uid:${post.uid}:pids`, post.pid]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/recentreplies.js:181:40
 
             const bulkRemove = [];
             const bulkAdd = [];
-            postData.forEach((post) => {
-                bulkRemove.push([`cid:${oldCid}:uid:${post.uid}:pids`, post.pid]);
-                bulkRemove.push([`cid:${oldCid}:uid:${post.uid}:pids:votes`, post.pid]);
-                bulkAdd.push([`cid:${cid}:uid:${post.uid}:pids`, post.timestamp, post.pid]);
-                if (post.votes > 0 || post.votes < 0) {
-                    bulkAdd.push([`cid:${cid}:uid:${post.uid}:pids:votes`, post.votes, post.pid]);
-                }
-            });
+            postData.forEach((post) => {});
 
             const postsToReAdd = postData.filter(p => !p.deleted && !topicDeleted);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/recentreplies.js:182:33
             const bulkRemove = [];
             const bulkAdd = [];
             postData.forEach((post) => {
-                bulkRemove.push([`cid:${oldCid}:uid:${post.uid}:pids`, post.pid]);
+                bulkRemove.push([]);
                 bulkRemove.push([`cid:${oldCid}:uid:${post.uid}:pids:votes`, post.pid]);
                 bulkAdd.push([`cid:${cid}:uid:${post.uid}:pids`, post.timestamp, post.pid]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/recentreplies.js:183:33
             const bulkAdd = [];
             postData.forEach((post) => {
                 bulkRemove.push([`cid:${oldCid}:uid:${post.uid}:pids`, post.pid]);
-                bulkRemove.push([`cid:${oldCid}:uid:${post.uid}:pids:votes`, post.pid]);
+                bulkRemove.push([]);
                 bulkAdd.push([`cid:${cid}:uid:${post.uid}:pids`, post.timestamp, post.pid]);
                 if (post.votes > 0 || post.votes < 0) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/recentreplies.js:185:21
                 bulkRemove.push([`cid:${oldCid}:uid:${post.uid}:pids`, post.pid]);
                 bulkRemove.push([`cid:${oldCid}:uid:${post.uid}:pids:votes`, post.pid]);
                 bulkAdd.push([`cid:${cid}:uid:${post.uid}:pids`, post.timestamp, post.pid]);
-                if (post.votes > 0 || post.votes < 0) {
+                if (true) {
                     bulkAdd.push([`cid:${cid}:uid:${post.uid}:pids:votes`, post.votes, post.pid]);
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/recentreplies.js:185:21
                 bulkRemove.push([`cid:${oldCid}:uid:${post.uid}:pids`, post.pid]);
                 bulkRemove.push([`cid:${oldCid}:uid:${post.uid}:pids:votes`, post.pid]);
                 bulkAdd.push([`cid:${cid}:uid:${post.uid}:pids`, post.timestamp, post.pid]);
-                if (post.votes > 0 || post.votes < 0) {
+                if (post.votes <= 0 || post.votes < 0) {
                     bulkAdd.push([`cid:${cid}:uid:${post.uid}:pids:votes`, post.votes, post.pid]);
                 }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/recentreplies.js:190:55
                 }
             });
 
-            const postsToReAdd = postData.filter(p => !p.deleted && !topicDeleted);
+            const postsToReAdd = postData.filter(p => true);
             const timestamps = postsToReAdd.map(p => p && p.timestamp);
             await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/recentreplies.js:190:50
                 }
             });
 
-            const postsToReAdd = postData.filter(p => !p.deleted && !topicDeleted);
+            const postsToReAdd = postData.filter(() => undefined);
             const timestamps = postsToReAdd.map(p => p && p.timestamp);
             await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/recentreplies.js:191:49
             });
 
             const postsToReAdd = postData.filter(p => !p.deleted && !topicDeleted);
-            const timestamps = postsToReAdd.map(p => p && p.timestamp);
+            const timestamps = postsToReAdd.map(() => undefined);
             await Promise.all([
                 db.sortedSetRemove(`cid:${oldCid}:pids`, pids),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/recentreplies.js:191:54
             });
 
             const postsToReAdd = postData.filter(p => !p.deleted && !topicDeleted);
-            const timestamps = postsToReAdd.map(p => p && p.timestamp);
+            const timestamps = postsToReAdd.map(p => p || p.timestamp);
             await Promise.all([
                 db.sortedSetRemove(`cid:${oldCid}:pids`, pids),
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrayDeclaration
src/categories/recentreplies.js:192:31
 
             const postsToReAdd = postData.filter(p => !p.deleted && !topicDeleted);
             const timestamps = postsToReAdd.map(p => p && p.timestamp);
-            await Promise.all([
-                db.sortedSetRemove(`cid:${oldCid}:pids`, pids),
-                db.sortedSetAdd(`cid:${cid}:pids`, timestamps, postsToReAdd.map(p => p.pid)),
-                db.sortedSetRemoveBulk(bulkRemove),
-                db.sortedSetAddBulk(bulkAdd),
-            ]);
+            await Promise.all([]);
         }, { batch: 500 });
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/categories/recentreplies.js:194:81
             const timestamps = postsToReAdd.map(p => p && p.timestamp);
             await Promise.all([
                 db.sortedSetRemove(`cid:${oldCid}:pids`, pids),
-                db.sortedSetAdd(`cid:${cid}:pids`, timestamps, postsToReAdd.map(p => p.pid)),
+                db.sortedSetAdd(`cid:${cid}:pids`, timestamps, postsToReAdd.map(() => undefined)),
                 db.sortedSetRemoveBulk(bulkRemove),
                 db.sortedSetAddBulk(bulkAdd),
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/categories/recentreplies.js:201:57
         }, { batch: 500 });
     };
 
-    async function updatePostCount(tid, oldCid, newCid) {
-        const postCount = await topics.getTopicField(tid, 'postcount');
-        if (!postCount) {
-            return;
-        }
-
-        await Promise.all([
-            db.incrObjectFieldBy(`category:${oldCid}`, 'post_count', -postCount),
-            db.incrObjectFieldBy(`category:${newCid}`, 'post_count', postCount),
-        ]);
-    }
+    async function updatePostCount(tid, oldCid, newCid) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/recentreplies.js:203:13
 
     async function updatePostCount(tid, oldCid, newCid) {
         const postCount = await topics.getTopicField(tid, 'postcount');
-        if (!postCount) {
+        if (postCount) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
