[Killed] ConditionalExpression
src/categories/recentreplies.js:203:13
 
     async function updatePostCount(tid, oldCid, newCid) {
         const postCount = await topics.getTopicField(tid, 'postcount');
-        if (!postCount) {
+        if (true) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/recentreplies.js:207:27
             return;
         }
 
-        await Promise.all([
-            db.incrObjectFieldBy(`category:${oldCid}`, 'post_count', -postCount),
-            db.incrObjectFieldBy(`category:${newCid}`, 'post_count', postCount),
-        ]);
+        await Promise.all([]);
     }
 };
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] UnaryOperator
src/categories/recentreplies.js:208:70
         }
 
         await Promise.all([
-            db.incrObjectFieldBy(`category:${oldCid}`, 'post_count', -postCount),
+            db.incrObjectFieldBy(`category:${oldCid}`, 'post_count', +postCount),
             db.incrObjectFieldBy(`category:${newCid}`, 'post_count', postCount),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/recentreplies.js:209:34
 
         await Promise.all([
             db.incrObjectFieldBy(`category:${oldCid}`, 'post_count', -postCount),
-            db.incrObjectFieldBy(`category:${newCid}`, 'post_count', postCount),
+            db.incrObjectFieldBy(``, 'post_count', postCount),
         ]);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
