[NoCoverage] ConditionalExpression
src/categories/search.js:11:23
 
 module.exports = function (Categories) {
     Categories.search = async function (data) {
-        const query = data.query || '';
+        const query = false;
         const page = data.page || 1;
         const uid = data.uid || 0;

[NoCoverage] LogicalOperator
src/categories/search.js:11:23
 
 module.exports = function (Categories) {
     Categories.search = async function (data) {
-        const query = data.query || '';
+        const query = data.query && '';
         const page = data.page || 1;
         const uid = data.uid || 0;

[NoCoverage] ConditionalExpression
src/categories/search.js:12:22
 module.exports = function (Categories) {
     Categories.search = async function (data) {
         const query = data.query || '';
-        const page = data.page || 1;
+        const page = true;
         const uid = data.uid || 0;
         const paginate = data.hasOwnProperty('paginate') ? data.paginate : true;

[NoCoverage] LogicalOperator
src/categories/search.js:12:22
 module.exports = function (Categories) {
     Categories.search = async function (data) {
         const query = data.query || '';
-        const page = data.page || 1;
+        const page = data.page && 1;
         const uid = data.uid || 0;
         const paginate = data.hasOwnProperty('paginate') ? data.paginate : true;

[NoCoverage] ConditionalExpression
src/categories/search.js:13:21
     Categories.search = async function (data) {
         const query = data.query || '';
         const page = data.page || 1;
-        const uid = data.uid || 0;
+        const uid = false;
         const paginate = data.hasOwnProperty('paginate') ? data.paginate : true;
 

[NoCoverage] ConditionalExpression
src/categories/search.js:13:21
     Categories.search = async function (data) {
         const query = data.query || '';
         const page = data.page || 1;
-        const uid = data.uid || 0;
+        const uid = true;
         const paginate = data.hasOwnProperty('paginate') ? data.paginate : true;
 

[NoCoverage] BooleanLiteral
src/categories/search.js:14:76
         const query = data.query || '';
         const page = data.page || 1;
         const uid = data.uid || 0;
-        const paginate = data.hasOwnProperty('paginate') ? data.paginate : true;
+        const paginate = data.hasOwnProperty('paginate') ? data.paginate : false;
 
         const startTime = process.hrtime();

[NoCoverage] StringLiteral
src/categories/search.js:14:46
         const query = data.query || '';
         const page = data.page || 1;
         const uid = data.uid || 0;
-        const paginate = data.hasOwnProperty('paginate') ? data.paginate : true;
+        const paginate = data.hasOwnProperty("") ? data.paginate : true;
 
         const startTime = process.hrtime();

[NoCoverage] StringLiteral
src/categories/search.js:25:55
             cids: cids,
             uid: uid,
         });
-        cids = await privileges.categories.filterCids('find', result.cids, uid);
+        cids = await privileges.categories.filterCids("", result.cids, uid);
 
         const searchResult = {

[NoCoverage] ConditionalExpression
src/categories/search.js:31:13
             matchCount: cids.length,
         };
 
-        if (paginate) {
+        if (false) {
             const resultsPerPage = data.resultsPerPage || 50;
             const start = Math.max(0, page - 1) * resultsPerPage;

[NoCoverage] BlockStatement
src/categories/search.js:31:23
             matchCount: cids.length,
         };
 
-        if (paginate) {
-            const resultsPerPage = data.resultsPerPage || 50;
-            const start = Math.max(0, page - 1) * resultsPerPage;
-            const stop = start + resultsPerPage;
-            searchResult.pageCount = Math.ceil(cids.length / resultsPerPage);
-            cids = cids.slice(start, stop);
-        }
+        if (paginate) {}
 
         const childrenCids = await getChildrenCids(cids, uid);

[NoCoverage] ConditionalExpression
src/categories/search.js:32:36
         };
 
         if (paginate) {
-            const resultsPerPage = data.resultsPerPage || 50;
+            const resultsPerPage = false;
             const start = Math.max(0, page - 1) * resultsPerPage;
             const stop = start + resultsPerPage;

[NoCoverage] LogicalOperator
src/categories/search.js:32:36
         };
 
         if (paginate) {
-            const resultsPerPage = data.resultsPerPage || 50;
+            const resultsPerPage = data.resultsPerPage && 50;
             const start = Math.max(0, page - 1) * resultsPerPage;
             const stop = start + resultsPerPage;

[NoCoverage] ArithmeticOperator
src/categories/search.js:33:39
 
         if (paginate) {
             const resultsPerPage = data.resultsPerPage || 50;
-            const start = Math.max(0, page - 1) * resultsPerPage;
+            const start = Math.max(0, page + 1) * resultsPerPage;
             const stop = start + resultsPerPage;
             searchResult.pageCount = Math.ceil(cids.length / resultsPerPage);

[NoCoverage] MethodExpression
src/categories/search.js:33:27
 
         if (paginate) {
             const resultsPerPage = data.resultsPerPage || 50;
-            const start = Math.max(0, page - 1) * resultsPerPage;
+            const start = Math.min(0, page - 1) * resultsPerPage;
             const stop = start + resultsPerPage;
             searchResult.pageCount = Math.ceil(cids.length / resultsPerPage);

[NoCoverage] ArithmeticOperator
src/categories/search.js:34:26
         if (paginate) {
             const resultsPerPage = data.resultsPerPage || 50;
             const start = Math.max(0, page - 1) * resultsPerPage;
-            const stop = start + resultsPerPage;
+            const stop = start - resultsPerPage;
             searchResult.pageCount = Math.ceil(cids.length / resultsPerPage);
             cids = cids.slice(start, stop);

[NoCoverage] ArithmeticOperator
src/categories/search.js:35:48
             const resultsPerPage = data.resultsPerPage || 50;
             const start = Math.max(0, page - 1) * resultsPerPage;
             const stop = start + resultsPerPage;
-            searchResult.pageCount = Math.ceil(cids.length / resultsPerPage);
+            searchResult.pageCount = Math.ceil(cids.length * resultsPerPage);
             cids = cids.slice(start, stop);
         }

[NoCoverage] MethodExpression
src/categories/search.js:36:20
             const start = Math.max(0, page - 1) * resultsPerPage;
             const stop = start + resultsPerPage;
             searchResult.pageCount = Math.ceil(cids.length / resultsPerPage);
-            cids = cids.slice(start, stop);
+            cids = cids;
         }
 

[NoCoverage] BlockStatement
src/categories/search.js:45:44
 
         Categories.getTree(categoryData, 0);
         await Categories.getRecentTopicReplies(categoryData, uid, data.qs);
-        categoryData.forEach((category) => {
-            if (category && Array.isArray(category.children)) {
-                category.children = category.children.slice(0, category.subCategoriesPerPage);
-                category.children.forEach((child) => {
-                    child.children = undefined;
-                });
-            }
-        });
+        categoryData.forEach((category) => {});
 
         categoryData.sort((c1, c2) => {

[NoCoverage] ConditionalExpression
src/categories/search.js:46:17
         Categories.getTree(categoryData, 0);
         await Categories.getRecentTopicReplies(categoryData, uid, data.qs);
         categoryData.forEach((category) => {
-            if (category && Array.isArray(category.children)) {
+            if (true) {
                 category.children = category.children.slice(0, category.subCategoriesPerPage);
                 category.children.forEach((child) => {

[NoCoverage] LogicalOperator
src/categories/search.js:46:17
         Categories.getTree(categoryData, 0);
         await Categories.getRecentTopicReplies(categoryData, uid, data.qs);
         categoryData.forEach((category) => {
-            if (category && Array.isArray(category.children)) {
+            if (category || Array.isArray(category.children)) {
                 category.children = category.children.slice(0, category.subCategoriesPerPage);
                 category.children.forEach((child) => {

[NoCoverage] MethodExpression
src/categories/search.js:47:37
         await Categories.getRecentTopicReplies(categoryData, uid, data.qs);
         categoryData.forEach((category) => {
             if (category && Array.isArray(category.children)) {
-                category.children = category.children.slice(0, category.subCategoriesPerPage);
+                category.children = category.children;
                 category.children.forEach((child) => {
                     child.children = undefined;

[NoCoverage] BlockStatement
src/categories/search.js:48:54
         categoryData.forEach((category) => {
             if (category && Array.isArray(category.children)) {
                 category.children = category.children.slice(0, category.subCategoriesPerPage);
-                category.children.forEach((child) => {
-                    child.children = undefined;
-                });
+                category.children.forEach((child) => {});
             }
         });

[NoCoverage] MethodExpression
src/categories/search.js:54:9
             }
         });
 
-        categoryData.sort((c1, c2) => {
-            if (c1.parentCid !== c2.parentCid) {
-                return c1.parentCid - c2.parentCid;
-            }
-            return c1.order - c2.order;
-        });
+        categoryData;
         searchResult.timing = (process.elapsedTimeSince(startTime) / 1000).toFixed(2);
         searchResult.categories = categoryData.filter(c => cids.includes(c.cid));

[NoCoverage] BlockStatement
src/categories/search.js:54:39
             }
         });
 
-        categoryData.sort((c1, c2) => {
-            if (c1.parentCid !== c2.parentCid) {
-                return c1.parentCid - c2.parentCid;
-            }
-            return c1.order - c2.order;
-        });
+        categoryData.sort((c1, c2) => {});
         searchResult.timing = (process.elapsedTimeSince(startTime) / 1000).toFixed(2);
         searchResult.categories = categoryData.filter(c => cids.includes(c.cid));

[NoCoverage] ConditionalExpression
src/categories/search.js:55:17
         });
 
         categoryData.sort((c1, c2) => {
-            if (c1.parentCid !== c2.parentCid) {
+            if (false) {
                 return c1.parentCid - c2.parentCid;
             }

[NoCoverage] ConditionalExpression
src/categories/search.js:55:17
         });
 
         categoryData.sort((c1, c2) => {
-            if (c1.parentCid !== c2.parentCid) {
+            if (true) {
                 return c1.parentCid - c2.parentCid;
             }

[NoCoverage] ArithmeticOperator
src/categories/search.js:56:24
 
         categoryData.sort((c1, c2) => {
             if (c1.parentCid !== c2.parentCid) {
-                return c1.parentCid - c2.parentCid;
+                return c1.parentCid + c2.parentCid;
             }
             return c1.order - c2.order;

[NoCoverage] ArithmeticOperator
src/categories/search.js:58:20
             if (c1.parentCid !== c2.parentCid) {
                 return c1.parentCid - c2.parentCid;
             }
-            return c1.order - c2.order;
+            return c1.order + c2.order;
         });
         searchResult.timing = (process.elapsedTimeSince(startTime) / 1000).toFixed(2);

[NoCoverage] ArithmeticOperator
src/categories/search.js:60:32
             }
             return c1.order - c2.order;
         });
-        searchResult.timing = (process.elapsedTimeSince(startTime) / 1000).toFixed(2);
+        searchResult.timing = (process.elapsedTimeSince(startTime) * 1000).toFixed(2);
         searchResult.categories = categoryData.filter(c => cids.includes(c.cid));
         return searchResult;

[NoCoverage] ArrowFunction
src/categories/search.js:61:55
             return c1.order - c2.order;
         });
         searchResult.timing = (process.elapsedTimeSince(startTime) / 1000).toFixed(2);
-        searchResult.categories = categoryData.filter(c => cids.includes(c.cid));
+        searchResult.categories = categoryData.filter(() => undefined);
         return searchResult;
     };

[NoCoverage] MethodExpression
src/categories/search.js:61:35
             return c1.order - c2.order;
         });
         searchResult.timing = (process.elapsedTimeSince(startTime) / 1000).toFixed(2);
-        searchResult.categories = categoryData.filter(c => cids.includes(c.cid));
+        searchResult.categories = categoryData;
         return searchResult;
     };

[NoCoverage] BlockStatement
src/categories/search.js:65:45
         return searchResult;
     };
 
-    async function findCids(query, hardCap) {
-        if (!query || String(query).length < 2) {
-            return [];
-        }
-        const data = await db.getSortedSetScan({
-            key: 'categories:name',
-            match: `*${String(query).toLowerCase()}*`,
-            limit: hardCap || 500,
-        });
-        return data.map(data => parseInt(data.split(':').pop(), 10));
-    }
+    async function findCids(query, hardCap) {}
 
     async function getChildrenCids(cids, uid) {

[NoCoverage] EqualityOperator
src/categories/search.js:66:23
     };
 
     async function findCids(query, hardCap) {
-        if (!query || String(query).length < 2) {
+        if (!query || String(query).length <= 2) {
             return [];
         }

[NoCoverage] ConditionalExpression
src/categories/search.js:66:13
     };
 
     async function findCids(query, hardCap) {
-        if (!query || String(query).length < 2) {
+        if (true) {
             return [];
         }

[NoCoverage] StringLiteral
src/categories/search.js:70:18
             return [];
         }
         const data = await db.getSortedSetScan({
-            key: 'categories:name',
+            key: "",
             match: `*${String(query).toLowerCase()}*`,
             limit: hardCap || 500,

[NoCoverage] MethodExpression
src/categories/search.js:71:24
         }
         const data = await db.getSortedSetScan({
             key: 'categories:name',
-            match: `*${String(query).toLowerCase()}*`,
+            match: `*${String(query).toUpperCase()}*`,
             limit: hardCap || 500,
         });

[NoCoverage] StringLiteral
src/categories/search.js:71:20
         }
         const data = await db.getSortedSetScan({
             key: 'categories:name',
-            match: `*${String(query).toLowerCase()}*`,
+            match: ``,
             limit: hardCap || 500,
         });

[NoCoverage] ConditionalExpression
src/categories/search.js:72:20
         const data = await db.getSortedSetScan({
             key: 'categories:name',
             match: `*${String(query).toLowerCase()}*`,
-            limit: hardCap || 500,
+            limit: false,
         });
         return data.map(data => parseInt(data.split(':').pop(), 10));

[NoCoverage] LogicalOperator
src/categories/search.js:72:20
         const data = await db.getSortedSetScan({
             key: 'categories:name',
             match: `*${String(query).toLowerCase()}*`,
-            limit: hardCap || 500,
+            limit: hardCap && 500,
         });
         return data.map(data => parseInt(data.split(':').pop(), 10));

[NoCoverage] ArrowFunction
src/categories/search.js:74:25
             match: `*${String(query).toLowerCase()}*`,
             limit: hardCap || 500,
         });
-        return data.map(data => parseInt(data.split(':').pop(), 10));
+        return data.map(() => undefined);
     }
 

[NoCoverage] BlockStatement
src/categories/search.js:77:47
         return data.map(data => parseInt(data.split(':').pop(), 10));
     }
 
-    async function getChildrenCids(cids, uid) {
-        const childrenCids = await Promise.all(cids.map(cid => Categories.getChildrenCids(cid)));
-        return await privileges.categories.filterCids('find', _.flatten(childrenCids), uid);
-    }
+    async function getChildrenCids(cids, uid) {}
 };
 

[NoCoverage] ArrowFunction
src/categories/search.js:78:57
     }
 
     async function getChildrenCids(cids, uid) {
-        const childrenCids = await Promise.all(cids.map(cid => Categories.getChildrenCids(cid)));
+        const childrenCids = await Promise.all(cids.map(() => undefined));
         return await privileges.categories.filterCids('find', _.flatten(childrenCids), uid);
     }
