[Killed] BlockStatement
src/categories/topics.js:11:58
 const user = require('../user');
 
 module.exports = function (Categories) {
-    Categories.getCategoryTopics = async function (data) {
-        let results = await plugins.hooks.fire('filter:category.topics.prepare', data);
-        const tids = await Categories.getTopicIds(results);
-        let topicsData = await topics.getTopicsByTids(tids, data.uid);
-        topicsData = await user.blocks.filter(data.uid, topicsData);
-
-        if (!topicsData.length) {
-            return { topics: [], uid: data.uid };
-        }
-        topics.calculateTopicIndices(topicsData, data.start);
-
-        results = await plugins.hooks.fire('filter:category.topics.get', { cid: data.cid, topics: topicsData, uid: data.uid });
-        return { topics: results.topics, nextStart: data.stop + 1 };
-    };
+    Categories.getCategoryTopics = async function (data) {};
 
     Categories.getTopicIds = async function (data) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/topics.js:12:48
 
 module.exports = function (Categories) {
     Categories.getCategoryTopics = async function (data) {
-        let results = await plugins.hooks.fire('filter:category.topics.prepare', data);
+        let results = await plugins.hooks.fire("", data);
         const tids = await Categories.getTopicIds(results);
         let topicsData = await topics.getTopicsByTids(tids, data.uid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/topics.js:15:28
         let results = await plugins.hooks.fire('filter:category.topics.prepare', data);
         const tids = await Categories.getTopicIds(results);
         let topicsData = await topics.getTopicsByTids(tids, data.uid);
-        topicsData = await user.blocks.filter(data.uid, topicsData);
+        topicsData = await user.blocks;
 
         if (!topicsData.length) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/topics.js:17:13
         let topicsData = await topics.getTopicsByTids(tids, data.uid);
         topicsData = await user.blocks.filter(data.uid, topicsData);
 
-        if (!topicsData.length) {
+        if (topicsData.length) {
             return { topics: [], uid: data.uid };
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/topics.js:17:33
         let topicsData = await topics.getTopicsByTids(tids, data.uid);
         topicsData = await user.blocks.filter(data.uid, topicsData);
 
-        if (!topicsData.length) {
-            return { topics: [], uid: data.uid };
-        }
+        if (!topicsData.length) {}
         topics.calculateTopicIndices(topicsData, data.start);
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ObjectLiteral
src/categories/topics.js:18:20
         topicsData = await user.blocks.filter(data.uid, topicsData);
 
         if (!topicsData.length) {
-            return { topics: [], uid: data.uid };
+            return {};
         }
         topics.calculateTopicIndices(topicsData, data.start);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/topics.js:18:30
         topicsData = await user.blocks.filter(data.uid, topicsData);
 
         if (!topicsData.length) {
-            return { topics: [], uid: data.uid };
+            return { topics: ["Stryker was here"], uid: data.uid };
         }
         topics.calculateTopicIndices(topicsData, data.start);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/categories/topics.js:23:53
         topics.calculateTopicIndices(topicsData, data.start);
 
         results = await plugins.hooks.fire('filter:category.topics.get', { cid: data.cid, topics: topicsData, uid: data.uid });
-        return { topics: results.topics, nextStart: data.stop + 1 };
+        return { topics: results.topics, nextStart: data.stop - 1 };
     };
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ObjectLiteral
src/categories/topics.js:27:31
     };
 
     Categories.getTopicIds = async function (data) {
-        const dataForPinned = { ...data };
+        const dataForPinned = {};
         dataForPinned.start = 0;
         dataForPinned.stop = -1;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/categories/topics.js:29:30
     Categories.getTopicIds = async function (data) {
         const dataForPinned = { ...data };
         dataForPinned.start = 0;
-        dataForPinned.stop = -1;
+        dataForPinned.stop = +1;
 
         const [pinnedTids, set, direction] = await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/topics.js:31:64
         dataForPinned.start = 0;
         dataForPinned.stop = -1;
 
-        const [pinnedTids, set, direction] = await Promise.all([
-            Categories.getPinnedTids(dataForPinned),
-            Categories.buildTopicsSortedSet(data),
-            Categories.getSortedSetRangeDirection(data.sort),
-        ]);
+        const [pinnedTids, set, direction] = await Promise.all([]);
 
         const totalPinnedCount = pinnedTids.length;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/topics.js:38:34
         ]);
 
         const totalPinnedCount = pinnedTids.length;
-        const pinnedTidsOnPage = pinnedTids.slice(data.start, data.stop !== -1 ? data.stop + 1 : undefined);
+        const pinnedTidsOnPage = pinnedTids;
         const pinnedCountOnPage = pinnedTidsOnPage.length;
         const topicsPerPage = data.stop - data.start + 1;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/categories/topics.js:38:77
         ]);
 
         const totalPinnedCount = pinnedTids.length;
-        const pinnedTidsOnPage = pinnedTids.slice(data.start, data.stop !== -1 ? data.stop + 1 : undefined);
+        const pinnedTidsOnPage = pinnedTids.slice(data.start, data.stop !== +1 ? data.stop + 1 : undefined);
         const pinnedCountOnPage = pinnedTidsOnPage.length;
         const topicsPerPage = data.stop - data.start + 1;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/categories/topics.js:40:31
         const totalPinnedCount = pinnedTids.length;
         const pinnedTidsOnPage = pinnedTids.slice(data.start, data.stop !== -1 ? data.stop + 1 : undefined);
         const pinnedCountOnPage = pinnedTidsOnPage.length;
-        const topicsPerPage = data.stop - data.start + 1;
+        const topicsPerPage = data.stop + data.start + 1;
         const normalTidsToGet = Math.max(0, topicsPerPage - pinnedCountOnPage);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/categories/topics.js:40:31
         const totalPinnedCount = pinnedTids.length;
         const pinnedTidsOnPage = pinnedTids.slice(data.start, data.stop !== -1 ? data.stop + 1 : undefined);
         const pinnedCountOnPage = pinnedTidsOnPage.length;
-        const topicsPerPage = data.stop - data.start + 1;
+        const topicsPerPage = data.stop - data.start - 1;
         const normalTidsToGet = Math.max(0, topicsPerPage - pinnedCountOnPage);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/categories/topics.js:41:33
         const pinnedTidsOnPage = pinnedTids.slice(data.start, data.stop !== -1 ? data.stop + 1 : undefined);
         const pinnedCountOnPage = pinnedTidsOnPage.length;
         const topicsPerPage = data.stop - data.start + 1;
-        const normalTidsToGet = Math.max(0, topicsPerPage - pinnedCountOnPage);
+        const normalTidsToGet = Math.min(0, topicsPerPage - pinnedCountOnPage);
 
         if (!normalTidsToGet && data.stop !== -1) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/categories/topics.js:41:45
         const pinnedTidsOnPage = pinnedTids.slice(data.start, data.stop !== -1 ? data.stop + 1 : undefined);
         const pinnedCountOnPage = pinnedTidsOnPage.length;
         const topicsPerPage = data.stop - data.start + 1;
-        const normalTidsToGet = Math.max(0, topicsPerPage - pinnedCountOnPage);
+        const normalTidsToGet = Math.max(0, topicsPerPage + pinnedCountOnPage);
 
         if (!normalTidsToGet && data.stop !== -1) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] UnaryOperator
src/categories/topics.js:43:47
         const topicsPerPage = data.stop - data.start + 1;
         const normalTidsToGet = Math.max(0, topicsPerPage - pinnedCountOnPage);
 
-        if (!normalTidsToGet && data.stop !== -1) {
+        if (!normalTidsToGet && data.stop !== +1) {
             return pinnedTidsOnPage;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:43:13
         const topicsPerPage = data.stop - data.start + 1;
         const normalTidsToGet = Math.max(0, topicsPerPage - pinnedCountOnPage);
 
-        if (!normalTidsToGet && data.stop !== -1) {
+        if (true) {
             return pinnedTidsOnPage;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:47:13
             return pinnedTidsOnPage;
         }
 
-        if (plugins.hooks.hasListeners('filter:categories.getTopicIds')) {
+        if (false) {
             const result = await plugins.hooks.fire('filter:categories.getTopicIds', {
                 tids: [],
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/topics.js:47:74
             return pinnedTidsOnPage;
         }
 
-        if (plugins.hooks.hasListeners('filter:categories.getTopicIds')) {
-            const result = await plugins.hooks.fire('filter:categories.getTopicIds', {
-                tids: [],
-                data: data,
-                pinnedTids: pinnedTidsOnPage,
-                allPinnedTids: pinnedTids,
-                totalPinnedCount: totalPinnedCount,
-                normalTidsToGet: normalTidsToGet,
-            });
-            return result && result.tids;
-        }
+        if (plugins.hooks.hasListeners('filter:categories.getTopicIds')) {}
 
         let { start } = data;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:56:20
                 totalPinnedCount: totalPinnedCount,
                 normalTidsToGet: normalTidsToGet,
             });
-            return result && result.tids;
+            return true;
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:56:20
                 totalPinnedCount: totalPinnedCount,
                 normalTidsToGet: normalTidsToGet,
             });
-            return result && result.tids;
+            return false;
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/topics.js:60:13
         }
 
         let { start } = data;
-        if (start > 0 && totalPinnedCount) {
+        if (start <= 0 && totalPinnedCount) {
             start -= totalPinnedCount - pinnedCountOnPage;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:60:13
         }
 
         let { start } = data;
-        if (start > 0 && totalPinnedCount) {
+        if (false) {
             start -= totalPinnedCount - pinnedCountOnPage;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] AssignmentOperator
src/categories/topics.js:61:13
 
         let { start } = data;
         if (start > 0 && totalPinnedCount) {
-            start -= totalPinnedCount - pinnedCountOnPage;
+            start += totalPinnedCount - pinnedCountOnPage;
         }
 

[NoCoverage] ArithmeticOperator
src/categories/topics.js:61:22
 
         let { start } = data;
         if (start > 0 && totalPinnedCount) {
-            start -= totalPinnedCount - pinnedCountOnPage;
+            start -= totalPinnedCount + pinnedCountOnPage;
         }
 

[Killed] ArithmeticOperator
src/categories/topics.js:64:53
             start -= totalPinnedCount - pinnedCountOnPage;
         }
 
-        const stop = data.stop === -1 ? data.stop : start + normalTidsToGet - 1;
+        const stop = data.stop === -1 ? data.stop : start - normalTidsToGet - 1;
         let normalTids;
         const reverse = direction === 'highest-to-lowest';
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/topics.js:64:22
             start -= totalPinnedCount - pinnedCountOnPage;
         }
 
-        const stop = data.stop === -1 ? data.stop : start + normalTidsToGet - 1;
+        const stop = data.stop !== -1 ? data.stop : start + normalTidsToGet - 1;
         let normalTids;
         const reverse = direction === 'highest-to-lowest';
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/topics.js:66:25
 
         const stop = data.stop === -1 ? data.stop : start + normalTidsToGet - 1;
         let normalTids;
-        const reverse = direction === 'highest-to-lowest';
+        const reverse = false;
         if (Array.isArray(set)) {
             const weights = set.map((s, index) => (index ? 0 : 1));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/topics.js:66:25
 
         const stop = data.stop === -1 ? data.stop : start + normalTidsToGet - 1;
         let normalTids;
-        const reverse = direction === 'highest-to-lowest';
+        const reverse = direction !== 'highest-to-lowest';
         if (Array.isArray(set)) {
             const weights = set.map((s, index) => (index ? 0 : 1));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/topics.js:67:33
         const stop = data.stop === -1 ? data.stop : start + normalTidsToGet - 1;
         let normalTids;
         const reverse = direction === 'highest-to-lowest';
-        if (Array.isArray(set)) {
-            const weights = set.map((s, index) => (index ? 0 : 1));
-            normalTids = await db[reverse ? 'getSortedSetRevIntersect' : 'getSortedSetIntersect']({ sets: set, start: start, stop: stop, weights: weights });
-        } else {
+        if (Array.isArray(set)) {} else {
             normalTids = await db[reverse ? 'getSortedSetRevRange' : 'getSortedSetRange'](set, start, stop);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:67:13
         const stop = data.stop === -1 ? data.stop : start + normalTidsToGet - 1;
         let normalTids;
         const reverse = direction === 'highest-to-lowest';
-        if (Array.isArray(set)) {
+        if (false) {
             const weights = set.map((s, index) => (index ? 0 : 1));
             normalTids = await db[reverse ? 'getSortedSetRevIntersect' : 'getSortedSetIntersect']({ sets: set, start: start, stop: stop, weights: weights });
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/categories/topics.js:68:37
         let normalTids;
         const reverse = direction === 'highest-to-lowest';
         if (Array.isArray(set)) {
-            const weights = set.map((s, index) => (index ? 0 : 1));
+            const weights = set.map(() => undefined);
             normalTids = await db[reverse ? 'getSortedSetRevIntersect' : 'getSortedSetIntersect']({ sets: set, start: start, stop: stop, weights: weights });
         } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/categories/topics.js:69:99
         const reverse = direction === 'highest-to-lowest';
         if (Array.isArray(set)) {
             const weights = set.map((s, index) => (index ? 0 : 1));
-            normalTids = await db[reverse ? 'getSortedSetRevIntersect' : 'getSortedSetIntersect']({ sets: set, start: start, stop: stop, weights: weights });
+            normalTids = await db[reverse ? 'getSortedSetRevIntersect' : 'getSortedSetIntersect']({});
         } else {
             normalTids = await db[reverse ? 'getSortedSetRevRange' : 'getSortedSetRange'](set, start, stop);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/topics.js:70:16
         if (Array.isArray(set)) {
             const weights = set.map((s, index) => (index ? 0 : 1));
             normalTids = await db[reverse ? 'getSortedSetRevIntersect' : 'getSortedSetIntersect']({ sets: set, start: start, stop: stop, weights: weights });
-        } else {
-            normalTids = await db[reverse ? 'getSortedSetRevRange' : 'getSortedSetRange'](set, start, stop);
-        }
+        } else {}
         normalTids = normalTids.filter(tid => !pinnedTids.includes(tid));
         return pinnedTidsOnPage.concat(normalTids);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] MethodExpression
src/categories/topics.js:73:22
         } else {
             normalTids = await db[reverse ? 'getSortedSetRevRange' : 'getSortedSetRange'](set, start, stop);
         }
-        normalTids = normalTids.filter(tid => !pinnedTids.includes(tid));
+        normalTids = normalTids;
         return pinnedTidsOnPage.concat(normalTids);
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/topics.js:73:47
         } else {
             normalTids = await db[reverse ? 'getSortedSetRevRange' : 'getSortedSetRange'](set, start, stop);
         }
-        normalTids = normalTids.filter(tid => !pinnedTids.includes(tid));
+        normalTids = normalTids.filter(tid => pinnedTids.includes(tid));
         return pinnedTidsOnPage.concat(normalTids);
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/topics.js:77:54
         return pinnedTidsOnPage.concat(normalTids);
     };
 
-    Categories.getTopicCount = async function (data) {
-        if (plugins.hooks.hasListeners('filter:categories.getTopicCount')) {
-            const result = await plugins.hooks.fire('filter:categories.getTopicCount', {
-                topicCount: data.category.topic_count,
-                data: data,
-            });
-            return result && result.topicCount;
-        }
-        const set = await Categories.buildTopicsSortedSet(data);
-        if (Array.isArray(set)) {
-            return await db.sortedSetIntersectCard(set);
-        } else if (data.targetUid && set) {
-            return await db.sortedSetCard(set);
-        }
-        return data.category.topic_count;
-    };
+    Categories.getTopicCount = async function (data) {};
 
     Categories.buildTopicsSortedSet = async function (data) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/topics.js:78:13
     };
 
     Categories.getTopicCount = async function (data) {
-        if (plugins.hooks.hasListeners('filter:categories.getTopicCount')) {
+        if (false) {
             const result = await plugins.hooks.fire('filter:categories.getTopicCount', {
                 topicCount: data.category.topic_count,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:78:13
     };
 
     Categories.getTopicCount = async function (data) {
-        if (plugins.hooks.hasListeners('filter:categories.getTopicCount')) {
+        if (true) {
             const result = await plugins.hooks.fire('filter:categories.getTopicCount', {
                 topicCount: data.category.topic_count,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] StringLiteral
src/categories/topics.js:79:53
 
     Categories.getTopicCount = async function (data) {
         if (plugins.hooks.hasListeners('filter:categories.getTopicCount')) {
-            const result = await plugins.hooks.fire('filter:categories.getTopicCount', {
+            const result = await plugins.hooks.fire("", {
                 topicCount: data.category.topic_count,
                 data: data,

[NoCoverage] LogicalOperator
src/categories/topics.js:83:20
                 topicCount: data.category.topic_count,
                 data: data,
             });
-            return result && result.topicCount;
+            return result || result.topicCount;
         }
         const set = await Categories.buildTopicsSortedSet(data);

[NoCoverage] ConditionalExpression
src/categories/topics.js:83:20
                 topicCount: data.category.topic_count,
                 data: data,
             });
-            return result && result.topicCount;
+            return false;
         }
         const set = await Categories.buildTopicsSortedSet(data);

[Killed] ConditionalExpression
src/categories/topics.js:86:13
             return result && result.topicCount;
         }
         const set = await Categories.buildTopicsSortedSet(data);
-        if (Array.isArray(set)) {
+        if (false) {
             return await db.sortedSetIntersectCard(set);
         } else if (data.targetUid && set) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:86:13
             return result && result.topicCount;
         }
         const set = await Categories.buildTopicsSortedSet(data);
-        if (Array.isArray(set)) {
+        if (true) {
             return await db.sortedSetIntersectCard(set);
         } else if (data.targetUid && set) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:88:20
         const set = await Categories.buildTopicsSortedSet(data);
         if (Array.isArray(set)) {
             return await db.sortedSetIntersectCard(set);
-        } else if (data.targetUid && set) {
+        } else if (true) {
             return await db.sortedSetCard(set);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/topics.js:88:20
         const set = await Categories.buildTopicsSortedSet(data);
         if (Array.isArray(set)) {
             return await db.sortedSetIntersectCard(set);
-        } else if (data.targetUid && set) {
+        } else if (data.targetUid || set) {
             return await db.sortedSetCard(set);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/topics.js:97:22
     Categories.buildTopicsSortedSet = async function (data) {
         const { cid } = data;
         let set = `cid:${cid}:tids`;
-        const sort = data.sort || (data.settings && data.settings.categoryTopicSort) || meta.config.categoryTopicSort || 'newest_to_oldest';
+        const sort = data.sort && data.settings && data.settings.categoryTopicSort || meta.config.categoryTopicSort || 'newest_to_oldest';
 
         if (sort === 'most_posts') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:97:22
     Categories.buildTopicsSortedSet = async function (data) {
         const { cid } = data;
         let set = `cid:${cid}:tids`;
-        const sort = data.sort || (data.settings && data.settings.categoryTopicSort) || meta.config.categoryTopicSort || 'newest_to_oldest';
+        const sort = false;
 
         if (sort === 'most_posts') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:99:13
         let set = `cid:${cid}:tids`;
         const sort = data.sort || (data.settings && data.settings.categoryTopicSort) || meta.config.categoryTopicSort || 'newest_to_oldest';
 
-        if (sort === 'most_posts') {
+        if (true) {
             set = `cid:${cid}:tids:posts`;
         } else if (sort === 'most_votes') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/topics.js:99:13
         let set = `cid:${cid}:tids`;
         const sort = data.sort || (data.settings && data.settings.categoryTopicSort) || meta.config.categoryTopicSort || 'newest_to_oldest';
 
-        if (sort === 'most_posts') {
+        if (sort !== 'most_posts') {
             set = `cid:${cid}:tids:posts`;
         } else if (sort === 'most_votes') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:101:20
 
         if (sort === 'most_posts') {
             set = `cid:${cid}:tids:posts`;
-        } else if (sort === 'most_votes') {
+        } else if (false) {
             set = `cid:${cid}:tids:votes`;
         } else if (sort === 'most_views') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:101:20
 
         if (sort === 'most_posts') {
             set = `cid:${cid}:tids:posts`;
-        } else if (sort === 'most_votes') {
+        } else if (true) {
             set = `cid:${cid}:tids:votes`;
         } else if (sort === 'most_views') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/categories/topics.js:103:20
             set = `cid:${cid}:tids:posts`;
         } else if (sort === 'most_votes') {
             set = `cid:${cid}:tids:votes`;
-        } else if (sort === 'most_views') {
+        } else if (sort !== 'most_views') {
             set = `cid:${cid}:tids:views`;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:103:20
             set = `cid:${cid}:tids:posts`;
         } else if (sort === 'most_votes') {
             set = `cid:${cid}:tids:votes`;
-        } else if (sort === 'most_views') {
+        } else if (true) {
             set = `cid:${cid}:tids:views`;
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing
