[Killed] ConditionalExpression
src/categories/topics.js:107:13
             set = `cid:${cid}:tids:views`;
         }
 
-        if (data.tag) {
+        if (true) {
             if (Array.isArray(data.tag)) {
                 set = [set].concat(data.tag.map(tag => `tag:${tag}:topics`));
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/topics.js:107:13
             set = `cid:${cid}:tids:views`;
         }
 
-        if (data.tag) {
+        if (false) {
             if (Array.isArray(data.tag)) {
                 set = [set].concat(data.tag.map(tag => `tag:${tag}:topics`));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:108:17
         }
 
         if (data.tag) {
-            if (Array.isArray(data.tag)) {
+            if (true) {
                 set = [set].concat(data.tag.map(tag => `tag:${tag}:topics`));
             } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:108:17
         }
 
         if (data.tag) {
-            if (Array.isArray(data.tag)) {
+            if (false) {
                 set = [set].concat(data.tag.map(tag => `tag:${tag}:topics`));
             } else {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[NoCoverage] ArrowFunction
src/categories/topics.js:109:49
 
         if (data.tag) {
             if (Array.isArray(data.tag)) {
-                set = [set].concat(data.tag.map(tag => `tag:${tag}:topics`));
+                set = [set].concat(data.tag.map(() => undefined));
             } else {
                 set = [set, `tag:${data.tag}:topics`];

[Killed] BlockStatement
src/categories/topics.js:110:20
         if (data.tag) {
             if (Array.isArray(data.tag)) {
                 set = [set].concat(data.tag.map(tag => `tag:${tag}:topics`));
-            } else {
-                set = [set, `tag:${data.tag}:topics`];
-            }
+            } else {}
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/topics.js:111:29
             if (Array.isArray(data.tag)) {
                 set = [set].concat(data.tag.map(tag => `tag:${tag}:topics`));
             } else {
-                set = [set, `tag:${data.tag}:topics`];
+                set = [set, ``];
             }
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/topics.js:115:29
             }
         }
 
-        if (data.targetUid) {
-            set = (Array.isArray(set) ? set : [set]).concat([`cid:${cid}:uid:${data.targetUid}:tids`]);
-        }
+        if (data.targetUid) {}
 
         const result = await plugins.hooks.fire('filter:categories.buildTopicsSortedSet', {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:115:13
             }
         }
 
-        if (data.targetUid) {
+        if (true) {
             set = (Array.isArray(set) ? set : [set]).concat([`cid:${cid}:uid:${data.targetUid}:tids`]);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/categories/topics.js:116:47
         }
 
         if (data.targetUid) {
-            set = (Array.isArray(set) ? set : [set]).concat([`cid:${cid}:uid:${data.targetUid}:tids`]);
+            set = (Array.isArray(set) ? set : []).concat([`cid:${cid}:uid:${data.targetUid}:tids`]);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/topics.js:116:62
         }
 
         if (data.targetUid) {
-            set = (Array.isArray(set) ? set : [set]).concat([`cid:${cid}:uid:${data.targetUid}:tids`]);
+            set = (Array.isArray(set) ? set : [set]).concat([``]);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/topics.js:123:16
             set: set,
             data: data,
         });
-        return result && result.set;
+        return false;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:123:16
             set: set,
             data: data,
         });
-        return result && result.set;
+        return true;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/topics.js:126:67
         return result && result.set;
     };
 
-    Categories.getSortedSetRangeDirection = async function (sort) {
-        sort = sort || 'newest_to_oldest';
-        const direction = ['newest_to_oldest', 'most_posts', 'most_votes', 'most_views'].includes(sort) ? 'highest-to-lowest' : 'lowest-to-highest';
-        const result = await plugins.hooks.fire('filter:categories.getSortedSetRangeDirection', {
-            sort: sort,
-            direction: direction,
-        });
-        return result && result.direction;
-    };
+    Categories.getSortedSetRangeDirection = async function (sort) {};
 
     Categories.getAllTopicIds = async function (cid, start, stop) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/topics.js:127:16
     };
 
     Categories.getSortedSetRangeDirection = async function (sort) {
-        sort = sort || 'newest_to_oldest';
+        sort = true;
         const direction = ['newest_to_oldest', 'most_posts', 'most_votes', 'most_views'].includes(sort) ? 'highest-to-lowest' : 'lowest-to-highest';
         const result = await plugins.hooks.fire('filter:categories.getSortedSetRangeDirection', {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:127:16
     };
 
     Categories.getSortedSetRangeDirection = async function (sort) {
-        sort = sort || 'newest_to_oldest';
+        sort = false;
         const direction = ['newest_to_oldest', 'most_posts', 'most_votes', 'most_views'].includes(sort) ? 'highest-to-lowest' : 'lowest-to-highest';
         const result = await plugins.hooks.fire('filter:categories.getSortedSetRangeDirection', {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/topics.js:128:28
 
     Categories.getSortedSetRangeDirection = async function (sort) {
         sort = sort || 'newest_to_oldest';
-        const direction = ['newest_to_oldest', 'most_posts', 'most_votes', 'most_views'].includes(sort) ? 'highest-to-lowest' : 'lowest-to-highest';
+        const direction = ["", 'most_posts', 'most_votes', 'most_views'].includes(sort) ? 'highest-to-lowest' : 'lowest-to-highest';
         const result = await plugins.hooks.fire('filter:categories.getSortedSetRangeDirection', {
             sort: sort,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/topics.js:128:48
 
     Categories.getSortedSetRangeDirection = async function (sort) {
         sort = sort || 'newest_to_oldest';
-        const direction = ['newest_to_oldest', 'most_posts', 'most_votes', 'most_views'].includes(sort) ? 'highest-to-lowest' : 'lowest-to-highest';
+        const direction = ['newest_to_oldest', "", 'most_votes', 'most_views'].includes(sort) ? 'highest-to-lowest' : 'lowest-to-highest';
         const result = await plugins.hooks.fire('filter:categories.getSortedSetRangeDirection', {
             sort: sort,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:133:16
             sort: sort,
             direction: direction,
         });
-        return result && result.direction;
+        return true;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:133:16
             sort: sort,
             direction: direction,
         });
-        return result && result.direction;
+        return false;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/categories/topics.js:136:67
         return result && result.direction;
     };
 
-    Categories.getAllTopicIds = async function (cid, start, stop) {
-        return await db.getSortedSetRange([`cid:${cid}:tids:pinned`, `cid:${cid}:tids`], start, stop);
-    };
+    Categories.getAllTopicIds = async function (cid, start, stop) {};
 
     Categories.getPinnedTids = async function (data) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/topics.js:140:54
         return await db.getSortedSetRange([`cid:${cid}:tids:pinned`, `cid:${cid}:tids`], start, stop);
     };
 
-    Categories.getPinnedTids = async function (data) {
-        if (plugins.hooks.hasListeners('filter:categories.getPinnedTids')) {
-            const result = await plugins.hooks.fire('filter:categories.getPinnedTids', {
-                pinnedTids: [],
-                data: data,
-            });
-            return result && result.pinnedTids;
-        }
-        const [allPinnedTids, canSchedule] = await Promise.all([
-            db.getSortedSetRevRange(`cid:${data.cid}:tids:pinned`, data.start, data.stop),
-            privileges.categories.can('topics:schedule', data.cid, data.uid),
-        ]);
-        const pinnedTids = canSchedule ? allPinnedTids : await filterScheduledTids(allPinnedTids);
-
-        return await topics.tools.checkPinExpiry(pinnedTids);
-    };
+    Categories.getPinnedTids = async function (data) {};
 
     Categories.modifyTopicsByPrivilege = function (topics, privileges) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/categories/topics.js:141:13
     };
 
     Categories.getPinnedTids = async function (data) {
-        if (plugins.hooks.hasListeners('filter:categories.getPinnedTids')) {
+        if (true) {
             const result = await plugins.hooks.fire('filter:categories.getPinnedTids', {
                 pinnedTids: [],
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:141:13
     };
 
     Categories.getPinnedTids = async function (data) {
-        if (plugins.hooks.hasListeners('filter:categories.getPinnedTids')) {
+        if (false) {
             const result = await plugins.hooks.fire('filter:categories.getPinnedTids', {
                 pinnedTids: [],
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] StringLiteral
src/categories/topics.js:142:53
 
     Categories.getPinnedTids = async function (data) {
         if (plugins.hooks.hasListeners('filter:categories.getPinnedTids')) {
-            const result = await plugins.hooks.fire('filter:categories.getPinnedTids', {
+            const result = await plugins.hooks.fire("", {
                 pinnedTids: [],
                 data: data,

[NoCoverage] LogicalOperator
src/categories/topics.js:146:20
                 pinnedTids: [],
                 data: data,
             });
-            return result && result.pinnedTids;
+            return result || result.pinnedTids;
         }
         const [allPinnedTids, canSchedule] = await Promise.all([

[NoCoverage] ConditionalExpression
src/categories/topics.js:146:20
                 pinnedTids: [],
                 data: data,
             });
-            return result && result.pinnedTids;
+            return true;
         }
         const [allPinnedTids, canSchedule] = await Promise.all([

[Killed] ArrayDeclaration
src/categories/topics.js:148:64
             });
             return result && result.pinnedTids;
         }
-        const [allPinnedTids, canSchedule] = await Promise.all([
-            db.getSortedSetRevRange(`cid:${data.cid}:tids:pinned`, data.start, data.stop),
-            privileges.categories.can('topics:schedule', data.cid, data.uid),
-        ]);
+        const [allPinnedTids, canSchedule] = await Promise.all([]);
         const pinnedTids = canSchedule ? allPinnedTids : await filterScheduledTids(allPinnedTids);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/topics.js:149:37
             return result && result.pinnedTids;
         }
         const [allPinnedTids, canSchedule] = await Promise.all([
-            db.getSortedSetRevRange(`cid:${data.cid}:tids:pinned`, data.start, data.stop),
+            db.getSortedSetRevRange(``, data.start, data.stop),
             privileges.categories.can('topics:schedule', data.cid, data.uid),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/topics.js:157:72
         return await topics.tools.checkPinExpiry(pinnedTids);
     };
 
-    Categories.modifyTopicsByPrivilege = function (topics, privileges) {
-        if (!Array.isArray(topics) || !topics.length || privileges.view_deleted) {
-            return;
-        }
-
-        topics.forEach((topic) => {
-            if (!topic.scheduled && topic.deleted && !topic.isOwner) {
-                topic.title = '[[topic:topic_is_deleted]]';
-                if (topic.hasOwnProperty('titleRaw')) {
-                    topic.titleRaw = '[[topic:topic_is_deleted]]';
-                }
-                topic.slug = topic.tid;
-                topic.teaser = null;
-                topic.noAnchor = true;
-                topic.tags = [];
-            }
-        });
-    };
+    Categories.modifyTopicsByPrivilege = function (topics, privileges) {};
 
     Categories.onNewPostMade = async function (cid, pinned, postData) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/topics.js:158:13
     };
 
     Categories.modifyTopicsByPrivilege = function (topics, privileges) {
-        if (!Array.isArray(topics) || !topics.length || privileges.view_deleted) {
+        if (Array.isArray(topics) || !topics.length || privileges.view_deleted) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/topics.js:158:82
     };
 
     Categories.modifyTopicsByPrivilege = function (topics, privileges) {
-        if (!Array.isArray(topics) || !topics.length || privileges.view_deleted) {
-            return;
-        }
+        if (!Array.isArray(topics) || !topics.length || privileges.view_deleted) {}
 
         topics.forEach((topic) => {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/topics.js:162:35
             return;
         }
 
-        topics.forEach((topic) => {
-            if (!topic.scheduled && topic.deleted && !topic.isOwner) {
-                topic.title = '[[topic:topic_is_deleted]]';
-                if (topic.hasOwnProperty('titleRaw')) {
-                    topic.titleRaw = '[[topic:topic_is_deleted]]';
-                }
-                topic.slug = topic.tid;
-                topic.teaser = null;
-                topic.noAnchor = true;
-                topic.tags = [];
-            }
-        });
+        topics.forEach((topic) => {});
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/topics.js:163:54
         }
 
         topics.forEach((topic) => {
-            if (!topic.scheduled && topic.deleted && !topic.isOwner) {
+            if (!topic.scheduled && topic.deleted && topic.isOwner) {
                 topic.title = '[[topic:topic_is_deleted]]';
                 if (topic.hasOwnProperty('titleRaw')) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:163:17
         }
 
         topics.forEach((topic) => {
-            if (!topic.scheduled && topic.deleted && !topic.isOwner) {
+            if (false) {
                 topic.title = '[[topic:topic_is_deleted]]';
                 if (topic.hasOwnProperty('titleRaw')) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/topics.js:165:55
         topics.forEach((topic) => {
             if (!topic.scheduled && topic.deleted && !topic.isOwner) {
                 topic.title = '[[topic:topic_is_deleted]]';
-                if (topic.hasOwnProperty('titleRaw')) {
-                    topic.titleRaw = '[[topic:topic_is_deleted]]';
-                }
+                if (topic.hasOwnProperty('titleRaw')) {}
                 topic.slug = topic.tid;
                 topic.teaser = null;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:165:21
         topics.forEach((topic) => {
             if (!topic.scheduled && topic.deleted && !topic.isOwner) {
                 topic.title = '[[topic:topic_is_deleted]]';
-                if (topic.hasOwnProperty('titleRaw')) {
+                if (false) {
                     topic.titleRaw = '[[topic:topic_is_deleted]]';
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/topics.js:170:34
                 }
                 topic.slug = topic.tid;
                 topic.teaser = null;
-                topic.noAnchor = true;
+                topic.noAnchor = false;
                 topic.tags = [];
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/topics.js:176:71
         });
     };
 
-    Categories.onNewPostMade = async function (cid, pinned, postData) {
-        if (!cid || !postData) {
-            return;
-        }
-        const promises = [
-            db.sortedSetAdd(`cid:${cid}:pids`, postData.timestamp, postData.pid),
-            db.incrObjectField(`category:${cid}`, 'post_count'),
-        ];
-        if (!pinned) {
-            promises.push(db.sortedSetIncrBy(`cid:${cid}:tids:posts`, 1, postData.tid));
-        }
-        await Promise.all(promises);
-        await Categories.updateRecentTidForCid(cid);
-    };
+    Categories.onNewPostMade = async function (cid, pinned, postData) {};
 
     async function filterScheduledTids(tids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/categories/topics.js:177:13
     };
 
     Categories.onNewPostMade = async function (cid, pinned, postData) {
-        if (!cid || !postData) {
+        if (!cid && !postData) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/categories/topics.js:177:13
     };
 
     Categories.onNewPostMade = async function (cid, pinned, postData) {
-        if (!cid || !postData) {
+        if (cid || !postData) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/topics.js:182:32
         }
         const promises = [
             db.sortedSetAdd(`cid:${cid}:pids`, postData.timestamp, postData.pid),
-            db.incrObjectField(`category:${cid}`, 'post_count'),
+            db.incrObjectField(``, 'post_count'),
         ];
         if (!pinned) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:184:13
             db.sortedSetAdd(`cid:${cid}:pids`, postData.timestamp, postData.pid),
             db.incrObjectField(`category:${cid}`, 'post_count'),
         ];
-        if (!pinned) {
+        if (true) {
             promises.push(db.sortedSetIncrBy(`cid:${cid}:tids:posts`, 1, postData.tid));
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/topics.js:184:22
             db.sortedSetAdd(`cid:${cid}:pids`, postData.timestamp, postData.pid),
             db.incrObjectField(`category:${cid}`, 'post_count'),
         ];
-        if (!pinned) {
-            promises.push(db.sortedSetIncrBy(`cid:${cid}:tids:posts`, 1, postData.tid));
-        }
+        if (!pinned) {}
         await Promise.all(promises);
         await Categories.updateRecentTidForCid(cid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/categories/topics.js:185:46
             db.incrObjectField(`category:${cid}`, 'post_count'),
         ];
         if (!pinned) {
-            promises.push(db.sortedSetIncrBy(`cid:${cid}:tids:posts`, 1, postData.tid));
+            promises.push(db.sortedSetIncrBy(``, 1, postData.tid));
         }
         await Promise.all(promises);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/categories/topics.js:191:46
         await Categories.updateRecentTidForCid(cid);
     };
 
-    async function filterScheduledTids(tids) {
-        const scores = await db.sortedSetScores('topics:scheduled', tids);
-        const now = Date.now();
-        return tids.filter((tid, index) => tid && (!scores[index] || scores[index] <= now));
-    }
+    async function filterScheduledTids(tids) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:194:70
     async function filterScheduledTids(tids) {
         const scores = await db.sortedSetScores('topics:scheduled', tids);
         const now = Date.now();
-        return tids.filter((tid, index) => tid && (!scores[index] || scores[index] <= now));
+        return tids.filter((tid, index) => tid && (!scores[index] || false));
     }
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/categories/topics.js:194:52
     async function filterScheduledTids(tids) {
         const scores = await db.sortedSetScores('topics:scheduled', tids);
         const now = Date.now();
-        return tids.filter((tid, index) => tid && (!scores[index] || scores[index] <= now));
+        return tids.filter((tid, index) => tid && (true));
     }
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
