[Killed] ConditionalExpression
src/categories/index.js:239:34
     childrenCids = childrenData.map(child => child.cid);
     const hasRead = await Categories.hasReadCategories(childrenCids, uid);
     childrenData.forEach((child, i) => {
-        child['unread-class'] = (child.topic_count === 0 || (hasRead[i] && uid !== 0)) ? '' : 'unread';
+        child['unread-class'] = (false || (hasRead[i] && uid !== 0)) ? '' : 'unread';
     });
     Categories.getTree([category].concat(childrenData), category.parentCid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
