[Killed] ConditionalExpression
src/categories/recentreplies.js:62:18
                 topicData = await topics.getTopicData(postData.tid);
             }
             index += 1;
-        } while (!topicData || topicData.deleted || topicData.scheduled);
+        } while (false || topicData.scheduled);
 
         if (postData && postData.tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
