[Killed] ConditionalExpression
src/categories/topics.js:97:22
     Categories.buildTopicsSortedSet = async function (data) {
         const { cid } = data;
         let set = `cid:${cid}:tids`;
-        const sort = data.sort || (data.settings && data.settings.categoryTopicSort) || meta.config.categoryTopicSort || 'newest_to_oldest';
+        const sort = false || 'newest_to_oldest';
 
         if (sort === 'most_posts') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
